{
  "category": "compliance",
  "source": "Philippine Accounting Standards, Bookkeeping Requirements, and SEC/BIR Compliance",
  "chunks": [
    {
      "title": "PFRS Framework — Full PFRS for Large and Listed Entities",
      "content": "The Philippine Financial Reporting Standards (PFRS), issued by the Financial Reporting Standards Council (FRSC) under the Philippine Board of Accountancy (BOA), are the mandatory accounting standards for Philippine entities. The PFRS framework follows a tiered system based on entity size and public accountability: Full PFRS applies to: (1) entities with securities listed on the Philippine Stock Exchange (PSE) or any public market; (2) entities in the process of filing financial statements with the SEC for the purpose of issuing any class of instruments in a public market; (3) entities that hold assets in a fiduciary capacity for a broad group of outsiders (banks, insurance companies, brokers/dealers, pension funds, mutual funds); and (4) large entities with total assets exceeding PHP 350,000,000 or total liabilities exceeding PHP 250,000,000. Full PFRS is substantially converged with International Financial Reporting Standards (IFRS) issued by the International Accounting Standards Board (IASB), with certain carve-outs and deferrals specific to the Philippine context. Key standards include: PFRS 15 (Revenue from Contracts with Customers), PFRS 16 (Leases), PAS 12 (Income Taxes), PFRS 9 (Financial Instruments), and PFRS 17 (Insurance Contracts). Entities under Full PFRS must prepare complete financial statements: Statement of Financial Position, Statement of Comprehensive Income, Statement of Changes in Equity, Statement of Cash Flows, and Notes to Financial Statements."
    },
    {
      "title": "PFRS for SMEs and Small Entities",
      "content": "The tiered PFRS framework provides simplified standards for smaller entities: (1) PFRS for Small and Medium-sized Entities (SMEs) — applies to entities with total assets between PHP 100,000,000 and PHP 350,000,000, or total liabilities between PHP 100,000,000 and PHP 250,000,000, that do not have public accountability. PFRS for SMEs is a self-contained standard based on Full PFRS but with simplified recognition, measurement, and disclosure requirements. Key simplifications include: no requirement for comprehensive disclosures on financial instruments, simplified accounting for investment property and biological assets, and reduced disclosure requirements overall. (2) PFRS for Small Entities (SE) — applies to entities with total assets between PHP 3,000,000 and PHP 100,000,000, or total liabilities between PHP 3,000,000 and PHP 100,000,000. PFRS for SE provides further simplifications: historical cost measurement for most assets, simplified revenue recognition, and minimal disclosure requirements. (3) Entities with total assets below PHP 3,000,000 (micro entities) — may use the income tax basis of accounting or simplified bookkeeping as prescribed by the BIR. These entities are essentially allowed to prepare financial statements based on their tax returns rather than PFRS. The categorization is based on the entity's financial statements for the immediately preceding two fiscal years. An entity that crosses a threshold must transition to the appropriate framework within the next fiscal year."
    },
    {
      "title": "SEC Filing Requirements and GFS",
      "content": "The Securities and Exchange Commission (SEC) requires all registered corporations, partnerships, and associations to submit annual financial statements as part of their General Information Sheet (GIS) and Annual Financial Statements (AFS) filing. Key requirements: (1) Audited Financial Statements (AFS) — all entities with paid-up capital of PHP 50,000 or more must submit AFS audited by an independent CPA. Entities with paid-up capital below PHP 50,000 may submit unaudited financial statements. (2) General Form for Financial Statements (GFS) — the SEC prescribes a standardized financial statement format through SEC Memorandum Circulars, including specific line items and disclosures tailored to the Philippine regulatory environment. (3) Filing deadlines — based on the SEC's coding schedule: entities with fiscal year ending December 31 follow an alphabetical filing schedule typically spanning April to June of the following year. Specific deadlines are announced annually by the SEC. (4) Electronic filing — the SEC has implemented the Electronic Filing and Submission Tool (eFAST) for online submission of annual reports. (5) Supplementary schedules — required attachments include: reconciliation of retained earnings, schedule of financial soundness indicators, map showing the company's principal office, and additional disclosures for specific industries. (6) Penalties for late filing: PHP 200/day (basic penalty), escalating for prolonged non-compliance, and potential revocation of the SEC registration for chronic non-filers. Foreign corporations licensed to do business in the Philippines must also file annual reports with the SEC."
    },
    {
      "title": "BIR Bookkeeping Requirements — Books of Accounts",
      "content": "The BIR mandates specific bookkeeping requirements under Sections 232-235 of the NIRC and related revenue regulations: (1) BIR-registered books of accounts — all taxpayers engaged in trade or business must maintain books of accounts that are registered with the BIR before first use. Books must be registered at the RDO where the taxpayer is registered. (2) Required books (manual system): Journal (recording all transactions chronologically), Ledger (classifying transactions by account), and Subsidiary Ledgers (detailed records for receivables, payables, inventory, etc.). (3) For taxpayers using the manual bookkeeping system, loose-leaf books may be used with prior BIR approval (BIR Form 1905 application). (4) Books must be kept at the principal place of business and must be made available for inspection by authorized BIR officers upon request. (5) Entries must be made in ink (for manual books), in English or Filipino, and recorded in Philippine Pesos. For transactions in foreign currency, the peso equivalent must be recorded using the BSP reference exchange rate. (6) All entries must be supported by adequate source documents: official receipts, sales invoices, purchase invoices, delivery receipts, bank statements, contracts, and other relevant documents. (7) Taxpayers with gross quarterly sales/receipts not exceeding PHP 150,000 (micro taxpayers) may use a simplified bookkeeping system with fewer required books."
    },
    {
      "title": "Computerized Accounting System (CAS) Permit",
      "content": "Taxpayers using a computerized accounting system (CAS) or components thereof must secure prior approval from the BIR through a CAS Permit. The requirements and process are governed by RR 11-2014 as amended: (1) Application — filed using BIR Form 1900 (Application for Authority to Use Computerized Accounting System/Components) at the RDO where the taxpayer is registered. Required attachments include: system documentation (flowcharts, data dictionaries, sample reports), sworn statement describing the system, procedural manual, and sample printouts of books, journals, and subsidiary ledgers. (2) Types of CAS: full CAS (integrated accounting system generating all books automatically) or component CAS (using computerized tools for specific accounting functions while maintaining manual books for others). (3) Commonly used systems requiring CAS permits: SAP, Oracle, QuickBooks, Xero, Sage, custom-developed systems, and even Excel-based accounting systems if they serve as the primary bookkeeping tool. (4) The BIR evaluates the application for compliance with audit trail requirements, data integrity, and the ability to generate BIR-prescribed reports. (5) Approval timeline: 30-60 days in practice, though the regulation targets 15 working days. (6) Annual compliance: CAS permit holders must submit a sworn statement with annual income tax returns confirming continued use of the approved system. Any system changes, upgrades, or replacements require a new or amended CAS permit application. (7) Penalties for using an unauthorized CAS: PHP 1,000 per day of unauthorized use (up to PHP 25,000), plus potential disallowance of expenses if books are deemed unreliable."
    },
    {
      "title": "Annual Registration and Books Preservation Requirements",
      "content": "All taxpayers registered with the BIR must comply with annual registration and record preservation requirements: (1) Annual Registration Fee — PHP 500 per year, payable on or before January 31 using BIR Form 0605 (Payment Form). This applies to all business taxpayers (sole proprietors, partnerships, corporations) but NOT to individuals earning purely compensation income. The registration fee is a prerequisite for the renewal of business permits with LGUs. Failure to pay incurs a penalty of 25% surcharge plus 12% interest. (2) Books of Accounts Preservation — under Section 235 of the NIRC, books of accounts and other accounting records must be preserved for a period of ten (10) years from the date of the last entry. This includes: manual books, electronic records, source documents (invoices, receipts, contracts, bank statements), and all supporting schedules and computations. (3) For CAS users, electronic data must be maintained in a format that is accessible and readable for the entire 10-year period, with appropriate backup and disaster recovery measures. (4) The 10-year preservation period runs from the last entry date of the book, NOT from the date of the last transaction. If a journal book has entries from 2020 to 2025, the preservation period runs from the date of the last 2025 entry for another 10 years (until 2035). (5) Destruction of records before the 10-year period requires prior BIR approval. (6) Note the distinction: the BIR assessment prescriptive period is 3 years (or 10 years for fraud), but the record preservation requirement is always 10 years regardless of assessment status."
    },
    {
      "title": "Chart of Accounts and Financial Reporting for Tax Compliance",
      "content": "A well-structured chart of accounts (COA) is fundamental to both financial reporting and tax compliance in the Philippines: (1) The COA should be designed to facilitate the preparation of both PFRS-compliant financial statements and BIR tax returns. (2) Key account categories: Assets (current and non-current), Liabilities (current and non-current), Equity, Revenue, Cost of Sales/Services, Operating Expenses, Other Income/Expenses, and Provision for Income Tax. (3) Tax-specific accounts to include: Input VAT, Output VAT, Withholding Tax Payable (expanded, compensation, final, VAT), Creditable Withholding Tax (taxes withheld on the entity's income), Income Tax Payable, Deferred Tax Assets, Deferred Tax Liabilities. (4) The BIR's prescribed forms (income tax returns, VAT returns, withholding tax returns) require financial information in specific formats that should align with the COA. (5) Reconciliation accounts: maintain bridge accounts or schedules to reconcile PFRS-basis financial statements with income tax return figures, as differences arise from: depreciation methods (straight-line for PFRS vs. specific NIRC rules), revenue recognition timing, allowance for doubtful accounts, unrealized foreign exchange gains/losses, and other book-tax differences. (6) For audit readiness, the COA should have sufficient granularity to support detailed transaction analysis while maintaining manageable complexity. Industry-specific accounts should be added as needed (e.g., contract assets/liabilities for construction companies under PFRS 15)."
    },
    {
      "title": "Record Retention, Penalties, and Practical Compliance Tips",
      "content": "Record retention and bookkeeping compliance carry significant penalties and practical considerations: (1) Penalties for failure to maintain proper books — under Section 275 of the NIRC: PHP 1,000 fine and/or imprisonment of not more than 6 months for each violation. Additionally, the BIR may use 'best evidence available' to reconstruct income and expenses, which typically results in unfavorable assessments. (2) Penalties for failure to make/file/keep required records — Section 266: fine of PHP 10,000 to PHP 50,000 and/or imprisonment of 1-10 years. (3) The BIR may issue a subpoena duces tecum requiring production of specific records; non-compliance may result in contempt proceedings. (4) Practical compliance tips for Philippine businesses: (a) Implement a document management system — digital or physical filing organized by tax type and period. (b) Maintain a monthly closing discipline — reconcile bank statements, update books, and verify VAT input/output monthly. (c) Cross-reference BIR forms — ensure consistency between income tax returns, VAT returns, withholding tax returns, and financial statements. (d) Keep a CWT/BIR Form 2307 log — track all creditable withholding tax certificates received from customers to ensure they are claimed in the income tax return. (e) Reconcile SAWT (Summary Alphalist of Withholding Taxes) — the alphalist of payees must match the figures in the withholding tax returns. (f) Perform year-end tax adjustments — reconcile book income with taxable income and prepare the required reconciliation schedule in the annual income tax return (ITR)."
    },
    {
      "title": "Relationship Between Accounting Records and Tax Compliance",
      "content": "The Philippine tax system relies heavily on the accuracy and completeness of accounting records: (1) Tax returns are derived from books — income tax returns, VAT returns, and withholding tax returns must be consistent with the entries in the registered books of accounts. Discrepancies trigger audit flags. (2) Book-tax differences — Philippine GAAP (PFRS) and the NIRC have different rules for certain transactions, creating temporary and permanent differences: Temporary differences include: depreciation (useful life and methods may differ), allowance for doubtful accounts (deductible for tax only when written off), unrealized foreign exchange gains/losses, and advance income recognition. Permanent differences include: non-deductible expenses (entertainment/representation exceeding 0.5%/1% limits, interest expense on tax-exempt income, bribes/penalties), tax-exempt income (PEZA-registered income, interest on government securities for certain entities), and fringe benefits subject to final tax. (3) The ITR requires a reconciliation schedule (Schedule 6 — Reconciliation of Net Income per Books with Taxable Income). (4) Transfer pricing documentation — for entities with related-party transactions, TP documentation must be supported by accounting records showing the arm's-length nature of intercompany prices. (5) VAT compliance — the integrity of VAT reporting depends on proper recording of sales (output VAT) and purchases (input VAT) in the books, with supporting invoices and receipts. (6) Under the EOPT Act, the BIR is moving toward more automated data matching between taxpayer-filed returns and third-party information, making consistency between accounting records and tax returns increasingly critical."
    }
  ]
}
