{
  "category": "withholding",
  "source": "BIR RR No. 2-98 / RR 11-2018 — Expanded Withholding Tax (EWT) Detailed Guide",
  "chunks": [
    {
      "title": "EWT Overview and Legal Basis",
      "content": "Expanded Withholding Tax (EWT) is a method of collecting income tax at the source by requiring certain income payors to withhold a percentage of income payments made to payees. Legal basis: Sections 57(A) and 58 of the NIRC, as implemented by Revenue Regulations No. 2-98 (as amended by RR 11-2018 under TRAIN Law). The payor is the withholding agent who deducts the tax. The payee receives the net amount and claims the tax withheld as a credit against income tax due. EWT is NOT a final tax — it is creditable against the payee's income tax liability. If total EWT withheld exceeds income tax due, the excess may be refunded or carried over. Withholding agents must: (1) Register with BIR as withholding agents; (2) Issue BIR Form 2307 to payees each quarter; (3) Remit taxes monthly (0619-E) and quarterly (1601-EQ); (4) File annual information return (1604-E)."
    },
    {
      "title": "EWT on Professional Fees",
      "content": "EWT on professional fees (per RR 11-2018 implementing TRAIN Law): (1) Individual professionals with gross income below PHP 3,000,000 — 5% withholding (ATC code WI010); (2) Individual professionals with gross income PHP 3,000,000 or above — 10% withholding (ATC code WI020); (3) Corporations providing professional services — 10% (ATC code WC010); (4) Corporations providing professional services with gross income over PHP 720,000 — 15% (ATC code WC020). 'Professional' includes: lawyers, CPAs, engineers, doctors, architects, dentists, customs brokers, real estate brokers, and other licensed professionals. For income payments to a professional where the payor cannot determine if the individual's gross income exceeds PHP 3M, the 5% rate applies by default. The professional must certify under oath their gross income status. Professionals availing of the 8% flat tax option are still subject to EWT at source — the tax withheld is creditable against the 8% tax due."
    },
    {
      "title": "EWT on Rentals",
      "content": "EWT on rental payments (per RR 2-98 as amended): (1) Rent on real property — 5% (ATC codes WI030/WC030) — applies to rent paid for the use of land, buildings, or other real property; (2) Rent on personal property (equipment, vehicles, machinery) — 5% (ATC codes WI040/WC040); (3) Pole/wire rentals — 5% — applicable to utility pole attachments and telecommunications wire rentals; (4) Billboards, display areas — 5%. The 5% withholding applies regardless of whether the lessor is an individual or corporation. For real property, the tenant (lessee) is the withholding agent. Exemptions: (a) Rental payments to the government; (b) Rental payments below PHP 10,000 per month to an individual lessor (though some BIR rulings may require withholding regardless). The withholding applies to the gross rental amount before any deductions for association dues, CUSA, or other charges passed on to the lessee."
    },
    {
      "title": "EWT on Contractors and Subcontractors",
      "content": "EWT on contractors and subcontractors (per RR 2-98 as amended): (1) General engineering/construction contractors — 2% (ATC codes WI050/WC050); (2) Other contractors (janitorial, security, manpower, messengerial, etc.) — 2%; (3) Subcontractors — 2%. The 2% rate applies to the gross contract/service payment. Definition of contractor: any person who, in the pursuit of an independent business, undertakes to do a specific job or piece of work for others. Distinction from employee: a contractor has control over the means and methods of performing the work, while an employee is subject to the control of the employer. Service agreements with staffing agencies, BPO companies, logistics providers, and similar entities are typically subject to 2% EWT. For construction contracts: the 2% applies to progress billings, retention money (when released), and final payments. If the contractor also provides materials, the 2% applies to the entire contract price (labor + materials combined) unless materials are separately invoiced and the contractor is merely an agent for the material supplier."
    },
    {
      "title": "EWT on Commissions and Advertising",
      "content": "EWT on commissions, brokerage, and advertising (per RR 2-98 as amended): (1) Commission/brokerage fees — Individual: 10% (ATC WI070); Corporation: 10% (ATC WC070); (2) Advertising/promotions — 2% (ATC WC060); (3) Talent fees for TV/radio/stage — Individual: 10% (athletes, entertainers, artists); Corporation: 10%. Commission applies to: insurance agents, real estate brokers, stock brokers, customs brokers, and similar intermediaries. The 10% is applied to the gross commission earned, not the total transaction value facilitated by the broker. Advertising expenses subject to 2% EWT include: media placements, print ads, digital advertising services, promotional events, and marketing services provided by agencies. Note: direct media purchases (buying airtime/ad space directly from media companies) are also subject to 2% EWT. Talent fees include payments to actors, musicians, athletes, models, entertainers, and similar professionals for their services."
    },
    {
      "title": "EWT on Purchase of Goods",
      "content": "EWT on purchase of goods (per RR 2-98 as amended): (1) Purchase of goods from individual suppliers — 1% if aggregate annual purchases exceed PHP 3,000,000 (ATC WI100); (2) Purchase of goods from corporate suppliers — 1% if aggregate annual purchases exceed PHP 3,000,000 (ATC WC100). Prior to TRAIN Law, the threshold for goods was PHP 720,000. TRAIN raised it to PHP 3,000,000 to reduce compliance burden on smaller transactions. The 1% withholding applies to each payment once the buyer determines that total purchases from the specific supplier will exceed PHP 3M for the year. Important exceptions: (a) Government purchases are subject to different rates (1.5%-5%); (b) Purchases of agricultural products from farmers/fishermen in their original state are exempt; (c) Purchases from cooperatives in good standing are exempt; (d) Purchases of gasoline, diesel, and other petroleum products from gas stations — 1% (regardless of amount). Once the aggregate threshold is reached, withholding should be applied retroactively if not withheld on earlier payments."
    },
    {
      "title": "EWT on Service Payments (General)",
      "content": "EWT on general service payments (per RR 2-98 as amended): (1) Service payments to individual service providers — 2% (ATC WI120); (2) Service payments to corporate service providers — 2% (ATC WC120). This is the catch-all category for services not specifically covered by other EWT categories. Examples include: IT services, consulting, maintenance, repair services, cleaning services, training, and other service contracts. The 2% applies to the gross payment before VAT. However, if the invoice separately shows the VAT component, the 2% EWT is computed on the amount exclusive of VAT. Special rates override the general 2%: (a) Professional fees: 5%/10%/15% takes precedence over 2%; (b) Rent: 5% takes precedence; (c) Commissions: 10% takes precedence. When in doubt about the correct category, the payor should apply the rate specific to the nature of the service. Misclassification may result in penalties for the withholding agent."
    },
    {
      "title": "EWT on Transport, Freight, and Insurance",
      "content": "EWT rates for transport, freight, delivery, and insurance (per RR 2-98): (1) Transport/delivery/freight services — 2% (ATC WI150/WC150); (2) Toll fees paid to toll operators — 1% (ATC WI160); (3) Insurance premiums (non-life) — 2% (ATC WI170/WC170). Transport/delivery: applies to trucking services, courier services, cargo forwarding, and logistics providers. The 2% applies to the total freight charge. Toll fees: The 1% applies to amounts paid by companies for employee toll reimbursements or fleet toll charges. Individual motorists are not required to withhold. Insurance premiums: The 2% applies to non-life insurance premiums paid by businesses (fire, theft, liability, etc.). Life insurance premiums are generally not subject to EWT. Health/medical insurance premiums paid by employers for employees may be subject to 2% EWT if the provider is a corporation. Reinsurance premiums paid to non-resident reinsurers are subject to different rates under Section 32(B)(5)(a) NIRC."
    },
    {
      "title": "EWT - Government Withholding Rates",
      "content": "Special EWT rates for payments by the government (per RR 2-98 and various RR amendments): (1) Purchase of goods by the government — 1% for PHP 10,000 and below per purchase; 1.5% for above PHP 10,000; (2) Purchase of services by the government — 2% (same as regular EWT); (3) Professional fees paid by government — 5%/10%/15% (same as regular); (4) Rent paid by government — 5%; (5) Goods sold to government — 1% EWT + 5% Final VAT (if VAT-registered seller). Government agencies include: national government agencies (NGAs), government-owned or controlled corporations (GOCCs), local government units (LGUs), and government financial institutions (GFIs). Government withholding agents must ensure compliance by not releasing payment without proper withholding. The BIR issues Certificates of Tax Withheld (BIR 2307) through the government accounting system. For VAT-registered suppliers to the government, the 5% final withholding VAT (Section 114(C) NIRC) is separate from and in addition to the EWT."
    },
    {
      "title": "EWT - Obligations of Withholding Agents",
      "content": "Obligations of withholding agents under the EWT system: (1) Registration — Must register with BIR as a withholding agent using BIR Form 1903 (for corporations) or 1901/1902 (for individuals); (2) Withholding — Deduct the correct EWT rate from each covered payment at the time of payment or accrual, whichever comes first; (3) Remittance — File BIR Form 0619-E on or before the 10th of the month following the month of withholding (for months 1 and 2 of each quarter); file BIR Form 1601-EQ on or before the last day of the month following the quarter (for month 3 and quarterly summary); (4) Certificate issuance — Issue BIR Form 2307 to payees on or before the 20th day of the month following the quarter; (5) Annual reporting — File BIR Form 1604-E on or before March 1 of the following year with the alphabetical list of payees. Penalties for non-compliance: (a) Failure to withhold — the withholding agent is liable for the tax plus 25% surcharge + 12% interest; (b) Failure to remit — subject to penalties of Sections 248 and 249 NIRC; (c) Failure to issue 2307 — PHP 1,000 per failure; (d) Failure to file returns — PHP 1,000 per return + surcharge + interest."
    }
  ]
}
