{
  "category": "compliance",
  "source": "BIR Registration, Invoicing, and Compliance Requirements",
  "chunks": [
    {
      "title": "Business Registration with BIR",
      "content": "BIR Registration Requirements (NIRC Section 236): Every person subject to any internal revenue tax must register with the BIR. Registration forms: (1) BIR Form 1901 — Self-employed individuals, single proprietors, professionals, mixed income earners; (2) BIR Form 1902 — Employees receiving purely compensation income; (3) BIR Form 1903 — Corporations, partnerships, cooperatives, associations, government entities; (4) BIR Form 1905 — Update of registration information (change of address, business activity, tax type, etc.); (5) BIR Form 2303 — Certificate of Registration (COR) issued upon successful registration. Requirements for registration: (a) TIN application or existing TIN; (b) SEC/DTI registration certificate; (c) Mayor's permit or business permit; (d) Lease contract or proof of business address; (e) BIR Form 0605 (annual registration fee — PHP 500). Deadline: within 30 days from start of business operations. Books of accounts must be registered with the BIR before use."
    },
    {
      "title": "TIN (Tax Identification Number) System",
      "content": "Tax Identification Number (TIN) rules: (1) Every person (individual or juridical) required to make a return, statement, or other document under the NIRC must have a TIN; (2) TIN format: 9 digits with a 3-digit branch code (XXX-XXX-XXX-000); (3) One TIN per taxpayer — having multiple TINs is a criminal offense (fine of PHP 1,000 to PHP 10,000, imprisonment of not less than 6 months); (4) TIN is permanent and does not change even if the taxpayer changes business, address, or civil status; (5) Application: BIR Form 1901 (self-employed), 1902 (employed), 1903 (non-individual entities); (6) Dependents, minors, and other individuals may obtain TIN for specific purposes (e.g., real estate transactions); (7) Non-resident foreign corporations doing business in the Philippines must obtain a TIN before commencing business; (8) TIN Verification Slip — can be requested at any BIR Revenue District Office; (9) eRegistration — some TIN applications can now be done online via BIR's eReg system. Penalty for using a false TIN: PHP 1,000 to PHP 50,000 fine and/or imprisonment."
    },
    {
      "title": "Books of Accounts Requirements",
      "content": "Books of Accounts (NIRC Section 232-235): All taxpayers engaged in trade or business must maintain books of accounts. (1) Manual Books — Must be BIR-registered (stamped by the RDO) before first use. Common books: journal, ledger, subsidiary ledger. (2) Computerized Books — Require BIR permit (BIR Form 1900) and must use BIR-approved Computerized Accounting System (CAS). The CAS must generate: journal of transactions, general ledger, subsidiary sales journal (for output VAT), subsidiary purchase journal (for input VAT), inventory list (for goods sellers). (3) Retention period: 10 years from the last entry or from the due date of the last return filed, whichever is later (Section 235). (4) Examination period: BIR may examine books only once per taxable year unless: (a) fraud is suspected; (b) the taxpayer requests reinvestigation; (c) verification of a withholding tax compliance. (5) Failure to keep books: fine of PHP 1,000 to PHP 50,000 and/or imprisonment. (6) Books must be kept at the principal place of business and available for BIR inspection."
    },
    {
      "title": "Invoice and Receipt Requirements (Detailed)",
      "content": "Invoice and Official Receipt requirements (Sections 113, 237, 238 NIRC): VAT-registered taxpayers must issue: (A) VAT Invoice (for sale of goods) — must contain: (1) 'VAT Invoice' header; (2) Seller's TIN-VAT; (3) BIR Authority to Print (ATP) number; (4) Date; (5) Business name and address of seller; (6) For transactions over PHP 1,000: buyer's name, TIN, address; (7) Description, quantity, unit cost; (8) Total selling price, VAT amount, and total payable shown SEPARATELY; (9) Pre-printed serial number. (B) VAT Official Receipt (for sale of services) — same requirements as above, with 'VAT Official Receipt' header. (C) Non-VAT taxpayers issue: Plain Invoice/Receipt (without 'VAT' designation), showing the 'Non-VAT Registered' or percentage tax details. Authority to Print (ATP): All invoices and receipts must have a BIR ATP, obtained via BIR Form 1906 before printing. ATP is valid for 5 years (extended from 3 years under recent regulations). Loose-leaf invoices/receipts may be used with BIR approval via BIR Form 1900."
    },
    {
      "title": "Electronic Filing and Payment System (eFPS/eBIRForms)",
      "content": "BIR Electronic Filing Systems: (1) eFPS (Electronic Filing and Payment System) — Web-based system for filing returns and paying taxes online. Mandatory for: large taxpayers, top 20,000 corporations, government agencies, and those mandated by RR. Access via efps.bir.gov.ph with digital certificate. Supported returns: 2550M, 2550Q, 1601-C, 1601-EQ, 0619-E, 1702Q, 1701Q, etc. (2) eBIRForms — Offline application for preparing tax returns. Downloaded from BIR website. After preparation, returns can be submitted via email to the designated BIR email address. Used by taxpayers not mandated to use eFPS. (3) Online Registration and Update (eReg) — For TIN applications and registration updates. (4) Online Tax Payment — May be done through: authorized agent banks (AABs), GCash, PayMaya, and other BIR-accredited payment channels. Filing deadlines are the same regardless of electronic or manual filing. Penalties for non-compliance with mandatory eFPS filing: PHP 1,000 per return + applicable surcharges."
    },
    {
      "title": "Summary List of Sales (SLS) Format",
      "content": "Summary List of Sales (SLS) — Required attachment for VAT returns (2550M/2550Q): Format per BIR RELIEF/SLSP guidelines: CSV file with the following columns: (1) Taxpayer's TIN; (2) Registered Name; (3) Last Name; (4) First Name; (5) Middle Name; (6) Customer/Buyer TIN; (7) Registered Name of Customer; (8) Last Name of Customer; (9) First Name of Customer; (10) Middle Name of Customer; (11) Street/Address of Customer; (12) Gross Sales (Amount of Sale); (13) Exempt Sales; (14) Zero-Rated Sales; (15) Taxable Sales; (16) Output Tax (VAT). Rules: (a) Individual transactions over PHP 1,000 must be listed separately; (b) Transactions below PHP 1,000 may be lumped as 'Various' with a generic TIN (000-000-000-000); (c) Must match the totals reported on the VAT return; (d) Must be submitted electronically via eFPS or as attachment to eBIRForms; (e) Quarterly SLS accompanies the 2550Q; monthly SLS accompanies the 2550M. Non-submission or discrepancy with the return may trigger a BIR audit."
    },
    {
      "title": "Summary List of Purchases (SLP) Format",
      "content": "Summary List of Purchases (SLP) — Required attachment for VAT returns (2550M/2550Q): CSV file format (similar to SLS): (1) Taxpayer's TIN; (2) Registered Name; (3-5) Last/First/Middle Name; (6) Supplier TIN; (7) Registered Name of Supplier; (8-10) Last/First/Middle Name of Supplier; (11) Street/Address of Supplier; (12) Amount of Purchase (Gross); (13) Amount of Purchase (Non-VAT/Exempt); (14) Amount of Purchase (Goods for Resale/Manufacture); (15) Amount of Purchase (Goods Other than Resale); (16) Amount of Purchase (Capital Goods); (17) Amount of Purchase (Services); (18) Amount of Purchase (Non-Qualified Purchases/Other); (19) Input Tax (Goods for Resale); (20) Input Tax (Capital Goods); (21) Input Tax (Services); (22) Input Tax (Non-Qualified). Rules mirror SLS: individual purchases over PHP 1,000 must be itemized. Supplier TIN validation is critical — the BIR cross-references SLP data against the suppliers' reported sales. Discrepancies may trigger audits on both parties."
    },
    {
      "title": "SAWT (Summary Alphalist of Withholding Taxes) Format",
      "content": "Summary Alphalist of Withholding Taxes (SAWT) — Required for taxpayers who claim creditable withholding tax credits: Format per BIR guidelines (DAT/CSV file): (1) Reporting period; (2) TIN of withholding agent; (3) Registered name of withholding agent; (4) TIN of payee (the taxpayer filing); (5) Registered name of payee; (6) Return period covered; (7) ATC code; (8) Nature of income; (9) Amount of income; (10) Tax withheld. The SAWT accompanies: quarterly VAT returns (2550Q), quarterly income tax returns (1701Q/1702Q), and annual income tax returns (1701/1702). Each entry corresponds to a BIR Form 2307 certificate received from a withholding agent. The total taxes withheld per SAWT must equal the total creditable taxes claimed on the tax return. BIR Form 2307 certificates must be attached or available for verification. Non-submission of SAWT results in: (a) Disallowance of the creditable withholding tax claimed; (b) Potential penalties for incomplete filing."
    },
    {
      "title": "Large Taxpayers and Top Withholding Agents",
      "content": "BIR Large Taxpayer Classification: The BIR classifies certain taxpayers as 'Large Taxpayers' based on: (1) Tax payments — taxpayers with annual tax payments of PHP 200,000 and above (per tax type); (2) Gross sales — businesses with annual gross sales of PHP 1,000,000,000 and above; (3) Net worth — PHP 300,000,000 and above; (4) Government contractors with contracts exceeding PHP 50,000,000. Large Taxpayers are required to: (a) Register and file with the Large Taxpayers Service (LTS) or Large Taxpayers District Office (LTDO); (b) Use eFPS for all tax filings and payments; (c) Submit additional compliance requirements (quarterly financial statements, etc.); (d) Maintain registered computerized books of accounts. Top 20,000 private corporations: identified annually by the BIR based on tax payments. These are also mandated to use eFPS and comply with enhanced reporting requirements. Benefits of large taxpayer status: dedicated RDO, faster processing, dedicated audit teams. Non-compliance by large taxpayers results in enhanced scrutiny and priority audit selection."
    },
    {
      "title": "Revenue District Office (RDO) System",
      "content": "BIR Revenue District Office (RDO) system: The Philippines is divided into Revenue Regions, each containing multiple Revenue District Offices (RDOs). Key facts: (1) There are approximately 120+ RDOs nationwide; (2) Taxpayers must register and file with the RDO having jurisdiction over their principal place of business; (3) RDO assignment is based on the business address (for non-individuals) or home address (for individuals); (4) RDO code is included in the TIN as the branch code (e.g., TIN 123-456-789-001 where 001 is the RDO/branch); (5) Transfer of RDO — when a taxpayer changes address, they must file BIR Form 1905 to transfer to the new RDO. (6) Each RDO handles: registration, tax return filing, payment processing, issuance of certifications, audit/investigation, and taxpayer assistance. (7) National office programs: Large Taxpayer Service (LTS) handles the largest corporations, Excise LT Regulatory Division handles excise taxpayers. For AIStarlight users: the correct RDO code must be used when filing BIR returns — using the wrong RDO triggers a 25% surcharge."
    }
  ]
}
