{
  "category": "compliance",
  "source": "NIRC Title X - Statutory Penalties / BIR Remedies and Procedures",
  "chunks": [
    {
      "title": "Section 248 - Civil Penalties (Surcharges)",
      "content": "Section 248 NIRC — Civil Penalties: (A) 25% surcharge is imposed on the following: (1) Failure to file any return and pay the tax due thereon as required; (2) Filing a return with an internal revenue officer other than the one authorized to receive the return; (3) Failure to pay the full or part of the amount of tax shown on the return, or the full amount of tax due for which no return is required to be filed, on or before the prescribed date. (B) 50% surcharge is imposed in case of: (1) Willful neglect to file the return within the prescribed period; (2) Filing a false or fraudulent return. The surcharge is computed on the basic tax amount, before interest and other penalties. The surcharge is in addition to any criminal penalties. 'Willful neglect' means intentional and voluntary failure — mere inadvertent delay may warrant only the 25% surcharge. The burden of proving fraud lies with the BIR."
    },
    {
      "title": "Section 249 - Interest on Unpaid Tax",
      "content": "Section 249 NIRC — Interest: (A) In general, there shall be assessed and collected on any unpaid amount of tax, interest at the rate of double the legal interest rate (currently 12% per annum as set by BSP Circular), from the date prescribed for payment until the amount is fully paid. The interest rate was changed from 20% to 12% under the TRAIN Law (effective January 1, 2018). (B) Deficiency interest — Any deficiency in the tax due as the result of a BIR audit shall be subject to interest at the rate of 12% per annum from the date prescribed for its payment until full payment. (C) Delinquency interest — In case of failure to pay the amount of tax due on any return required, or the amount of tax due for which no return is required, or a deficiency tax or any surcharge or interest on the date prescribed, there shall be assessed and collected a delinquency interest of 12% per annum from the due date until full payment. Interest is computed on a per annum basis and is in addition to surcharges and compromise penalties."
    },
    {
      "title": "Compromise Penalties",
      "content": "BIR Compromise Penalties (per RMO 7-2015 and subsequent updates): The BIR may impose compromise penalties in lieu of criminal prosecution for certain violations. Common compromise penalties: (1) Failure to file a return on time — PHP 200 to PHP 50,000 per return depending on the type and taxpayer classification; (2) Failure to keep books of accounts — PHP 1,000 per set; (3) Failure to issue receipts/invoices — PHP 1,000 per document up to PHP 50,000 per incident; (4) Failure to register — PHP 5,000 to PHP 20,000; (5) Failure to display Certificate of Registration — PHP 1,000; (6) Failure to file information returns (SAWT, SLS, SLP) — PHP 1,000 per return. Compromise penalties are lower than the maximum criminal penalties and are offered at the discretion of the BIR as a settlement. Acceptance of compromise does not preclude the BIR from assessing the basic tax, surcharge, and interest. For violations involving deficiency taxes, the compromise penalty is a percentage of the basic deficiency tax (ranging from 10% to 50%)."
    },
    {
      "title": "Criminal Penalties Under NIRC",
      "content": "NIRC Title X — Criminal Penalties for Tax Violations: (1) Section 254 — Willful attempt to evade or defeat tax: Fine of not less than PHP 30,000 but not more than PHP 100,000 AND imprisonment of not less than 2 years but not more than 4 years. Includes willful failure to make a return, filing fraudulent returns, willful evasion. (2) Section 255 — Failure to file return, supply correct information, or pay tax: Fine of not less than PHP 10,000 and not more than PHP 20,000 AND imprisonment of not less than 1 year but not more than 10 years. (3) Section 256 — Failure to obey summons: Fine of not less than PHP 5,000 but not more than PHP 10,000 AND imprisonment of not less than 1 year but not more than 2 years. (4) Section 257 — Making false or fraudulent returns: Fine of not less than PHP 30,000 but not more than PHP 100,000 AND imprisonment of not less than 2 years but not more than 4 years. (5) Section 264 — Failure to issue receipts: Fine of not less than PHP 1,000 and not more than PHP 50,000 AND imprisonment of not less than 2 years but not more than 4 years. Criminal prosecution requires recommendation of the CIR to the DOJ."
    },
    {
      "title": "Section 228 - Assessment Process and Protesting",
      "content": "Section 228 NIRC — Protesting an Assessment: (1) The BIR must inform the taxpayer in writing of the law and facts on which the assessment is based through a Preliminary Assessment Notice (PAN); (2) The taxpayer has 15 days from receipt of PAN to file a reply; (3) If the BIR proceeds, a Formal Letter of Demand (FLD) / Final Assessment Notice (FAN) is issued; (4) The taxpayer may protest the FAN by filing a request for reconsideration (based on existing records) or request for reinvestigation (with new evidence) within 30 days from receipt; (5) If protest is denied, the taxpayer may appeal to the CTA within 30 days from receipt of the denial; (6) If the BIR fails to act on the protest within 180 days, the taxpayer may appeal to the CTA within 30 days from expiry of the 180-day period (inaction is deemed denial). Failure to file a timely protest renders the assessment final, executory, and demandable. The prescriptive period for assessment is 3 years from the filing of the return (10 years in case of fraud or failure to file)."
    },
    {
      "title": "Prescription Periods for Tax Assessment and Collection",
      "content": "NIRC — Prescriptive Periods: (1) Assessment — Section 203: Internal revenue taxes must be assessed within 3 years from the last day prescribed by law for filing the return, or if the return was filed after the deadline, from the date of actual filing. (2) Extended Period — Section 222(a): In case of a false or fraudulent return with intent to evade tax, or failure to file a return, the tax may be assessed within 10 years from discovery of the fraud, falsity, or omission. (3) Collection — Section 222(c): The BIR must collect the assessed tax within 5 years from the date of assessment. (4) Waiver — The 3-year prescriptive period for assessment may be extended by written waiver (BIR-prescribed waiver form) signed by both the taxpayer and the BIR before the original period expires. (5) Suspension — The running of the prescription period is suspended: (a) when the CIR is prohibited from making assessment/collection; (b) when the taxpayer requests for reinvestigation; (c) when the taxpayer is out of the Philippines. Important: An assessment issued beyond the prescriptive period is void and unenforceable."
    },
    {
      "title": "BIR Audit Process and Red Flags",
      "content": "BIR Audit/Investigation Process: (1) Letter of Authority (LOA) — The BIR issues an LOA authorizing revenue officers to examine the taxpayer's books. An LOA is valid for 120 days and must be served within 30 days of issuance. Without a valid LOA, any assessment is void. (2) Tax Verification Notice (TVN) — For limited verification of specific items (not a full audit). Less intrusive than LOA. (3) During audit, BIR examines: books of accounts, invoices, receipts, financial statements, bank records, third-party information. (4) Common audit red flags: (a) Consistently low profit margins compared to industry; (b) Significant unexplained increase in net worth; (c) Discrepancies between VAT returns and income tax returns; (d) Large cash transactions; (e) Frequent amended returns; (f) Non-filing or late filing of returns; (g) Significant zero-rated sales claims; (h) Informer's tips. After audit, BIR issues a Notice of Informal Conference (NIC), then PAN, then FAN if deficiency is found. The taxpayer's right to due process must be observed at each stage."
    },
    {
      "title": "Tax Remedies - Administrative and Judicial",
      "content": "Tax Remedies available to taxpayers: (A) Administrative Remedies: (1) Protest under Section 228 — Request for reconsideration/reinvestigation within 30 days of FAN; (2) Compromise under Section 204 — Agreement to settle for less than the full amount if: (a) reasonable doubt on validity of assessment (minimum compromise: 40% of basic tax assessed), or (b) financial incapacity of taxpayer (minimum: 10%); (3) Abatement under Section 204(B) — Cancellation of tax liability if: (a) unjustly or excessively assessed, or (b) collection is administratively impractical. (B) Judicial Remedies: (1) Appeal to Court of Tax Appeals (CTA) within 30 days from denial of protest or expiry of 180-day period; (2) CTA Division has jurisdiction over: tax assessments, refund/credit cases, penalties, forfeiture; (3) CTA En Banc — appeal from CTA Division decisions; (4) Supreme Court — appeal from CTA En Banc via petition for review on certiorari. Filing fees and bonds are required for CTA appeals. The CTA may issue injunctions to restrain collection of disputed taxes. Taxpayers who pay the assessed tax may file a claim for refund within 2 years from payment."
    },
    {
      "title": "Voluntary Assessment and Amnesty Programs",
      "content": "BIR programs for voluntary compliance and tax amnesty: (1) Voluntary Assessment Program (VAP) — Periodically offered by the BIR, allowing taxpayers to voluntarily declare previously undeclared income and pay a reduced penalty. Typical VAP terms: basic tax + surcharge (usually 10-15%) + interest, with waiver of criminal prosecution. (2) Tax Amnesty Act (RA 11213, 2019) — Provided amnesty for: (a) Estate tax amnesty (6% on net estate, filed within 2 years); (b) General tax amnesty (2% on net worth increase for individuals, 5% for corporations — implementation pending); (c) Tax delinquency amnesty (for assessments issued on or before June 30, 2020 — pay 40% if protest pending, 50% if under collection, 60% if criminal cases). (3) Estate Tax Amnesty was extended multiple times, most recently until June 14, 2025 under RA 11956. Benefits: waiver of surcharges, interest, compromise penalties; immunity from criminal prosecution. Conditions: full payment; no pending court cases (unless withdrawn); must not involve fraud or willful neglect to file. Taxpayers should verify current amnesty programs as they are periodically introduced by Congress."
    }
  ]
}
