{
  "category": "compliance",
  "source": "BIR Audit Process, Assessment Defense, and Taxpayer Remedies — Practical Guide",
  "chunks": [
    {
      "title": "Letter of Authority (LOA) — Initiating the BIR Audit",
      "content": "A BIR audit formally commences with the issuance of a Letter of Authority (LOA) under Section 6(A) of the NIRC and RMO 43-1990. The LOA is the official document authorizing a Revenue Officer (RO) to examine a taxpayer's books of accounts and other accounting records for a specific taxable period and specific tax types. Key rules governing the LOA: (1) The LOA must be signed by the Commissioner of Internal Revenue (CIR) or the duly authorized Regional Director — LOAs signed by unauthorized officials are void and confer no authority to audit. (2) The LOA is valid for 120 days from the date of its issuance; if the audit is not completed within 120 days, the RO must request a re-validation. (3) The scope of the LOA is limited to the tax types and taxable periods specified — the RO cannot examine periods or taxes not covered. (4) Only one LOA should be issued per taxpayer per taxable year (except in specific circumstances). (5) The taxpayer has the right to demand presentation of the LOA and verify its authenticity with the issuing office. (6) An audit conducted without a valid LOA is considered void, and any assessment arising therefrom may be challenged. The taxpayer should immediately photocopy the LOA, note the date of receipt, and verify the RO's credentials. Under RMC 107-2025, all BIR field audits were suspended effective November 24, 2025, as part of an unprecedented reform initiative — taxpayers should confirm the current status of this suspension."
    },
    {
      "title": "LNOA, TVN, and Other Pre-Audit Notices",
      "content": "Besides the LOA, the BIR uses other authorization instruments for limited examinations: (1) Letter Notice of Authority (LNOA) — issued for third-party-information-based verification of specific discrepancies. The LNOA is narrower in scope than the LOA and is used when the BIR identifies potential underreporting through data matching (e.g., third-party information from suppliers, customers, or government agencies does not match the taxpayer's returns). The LNOA does not authorize a full audit but is limited to verifying the specific discrepancy identified. (2) Tax Verification Notice (TVN) — used for simple verification matters such as checking compliance with withholding tax remittance, verifying registration status, or conducting routine compliance checks. The TVN does not authorize a comprehensive audit of books and records. (3) Mission Order (MO) — authorizes revenue officers to conduct surveillance, inventory monitoring, or stocktaking operations at taxpayer premises. Taxpayers should distinguish between these instruments as each carries different rights and obligations. An LNOA or TVN cannot be used to conduct a full-scope audit; if the BIR attempts to expand the scope beyond what the instrument authorizes, the taxpayer should formally object in writing and request a proper LOA if a full audit is intended."
    },
    {
      "title": "Audit Process Timeline — From LOA to Final Assessment",
      "content": "The BIR audit process follows a structured timeline mandated by revenue regulations: (1) LOA Issuance and Presentation — the RO presents the LOA to the taxpayer, who acknowledges receipt. (2) Document Request — the RO issues a checklist of documents required for examination; the taxpayer must submit within 10 working days (extendable upon written request). Failure to submit may result in a subpoena duces tecum or the BIR computing the tax liability based on best evidence available. (3) Examination Phase — the RO reviews books, invoices, receipts, returns, and supporting documents; may conduct third-party verification, inventory observation, and property inspection. (4) Notice of Informal Conference — upon finding discrepancies, the RO invites the taxpayer to an informal conference to discuss preliminary findings and allow the taxpayer to present explanations. (5) Notice of Discrepancy (NoD) — if discrepancies remain unresolved, the BIR issues a NoD detailing the proposed adjustments. The taxpayer has 30 days to respond. (6) Preliminary Assessment Notice (PAN) — if the BIR is not satisfied with the taxpayer's response, it issues a PAN. The taxpayer has 15 days to respond. PAN is not required in cases of: mathematical error, discrepancy between tax return and supporting documents, or excise tax on articles subject to tax. (7) Formal Letter of Demand / Final Assessment Notice (FLD/FAN) — if the taxpayer's response to the PAN is unsatisfactory, the BIR issues the FLD/FAN, which constitutes the formal assessment. The taxpayer has 30 days to protest."
    },
    {
      "title": "Protest Options — Reinvestigation vs Reconsideration",
      "content": "Upon receipt of the Formal Letter of Demand / Final Assessment Notice (FLD/FAN), the taxpayer has 30 days to file a written protest, which may take one of two forms: (1) Request for Reinvestigation — the taxpayer requests re-examination of the assessment based on newly discovered or additional evidence not previously presented during the audit. This requires submission of relevant supporting documents within 60 days from the date of filing the protest. A reinvestigation suspends the running of the prescriptive period for collection. (2) Request for Reconsideration — the taxpayer disputes the assessment based on existing records or legal arguments, without submitting new evidence. This does NOT suspend the prescriptive period for collection. Critical procedural requirements: (a) the protest must be filed within the 30-day period; failure to protest within this period renders the assessment final, executory, and demandable; (b) the protest must state the facts, applicable law, and arguments supporting the taxpayer's position; (c) if requesting reinvestigation, all supporting documents must be submitted within 60 days — failure to submit is deemed a waiver of the right to present evidence. The BIR has 180 days from the filing of the protest (or from the submission of documents, in case of reinvestigation) to resolve the protest. If the BIR denies the protest or fails to act within the 180-day period, the taxpayer may appeal to the Court of Tax Appeals (CTA) within 30 days from denial or lapse of the 180-day period."
    },
    {
      "title": "Appeal to the Court of Tax Appeals (CTA) and Higher Courts",
      "content": "The Court of Tax Appeals (CTA) has exclusive appellate jurisdiction over tax assessments and related matters under RA 1125 as amended by RA 9282. The appeal process follows a strict hierarchy: (1) CTA Division — the taxpayer files a Petition for Review within 30 days from: (a) receipt of the BIR's decision denying the protest; or (b) lapse of the 180-day period without BIR action (in which case the inaction is deemed a denial). The petition must be verified, state the specific errors of the BIR, and be accompanied by proof of payment of docket fees. The CTA Division conducts trial de novo, allowing both parties to present evidence. (2) CTA En Banc — the losing party may file a Motion for Reconsideration or a Petition for Review with the CTA En Banc within 15 days from receipt of the Division's decision. (3) Supreme Court — the final appeal is to the Supreme Court via a Petition for Review on Certiorari under Rule 45 of the Rules of Court, within 15 days from receipt of the CTA En Banc decision. During CTA proceedings, the taxpayer may request a suspension of collection of the assessed tax by either: (a) filing a bond equal to the amount of tax assessed; or (b) depositing the amount with the court. Without such bond or deposit, the BIR may enforce collection through administrative remedies (distraint and levy). The CTA proceedings typically take 2-5 years at the Division level."
    },
    {
      "title": "Prescription Periods — Limitations on BIR Assessments and Collection",
      "content": "The NIRC establishes strict prescriptive periods that limit the BIR's authority to assess and collect taxes: (1) General Rule — the BIR must issue an assessment within three (3) years from the deadline for filing the return or from the date the return was actually filed, whichever is later (Section 203, NIRC). For example, the 2024 income tax return due April 15, 2025, can be assessed until April 15, 2028. (2) Exception for Fraud or Non-Filing — when a false or fraudulent return is filed with intent to evade tax, or when no return is filed, the assessment may be made within ten (10) years from the date of discovery of the fraud or from the date the return should have been filed (Section 222, NIRC). The burden of proving fraud rests on the BIR. (3) Waiver of Statute of Limitations — the BIR may request the taxpayer to execute a written waiver extending the prescriptive period. The waiver must comply with strict requirements under RMO 20-90 and RDAO 05-01: it must specify the tax type, period, and new expiry date; must be signed by the taxpayer or authorized representative; and must be accepted and signed by the authorized BIR official. Defective waivers are void and do not extend the prescriptive period. (4) Collection Prescription — the BIR must collect the assessed tax within five (5) years from the date of assessment (Section 222(c)), or within ten (10) years if the assessment was for fraud/non-filing."
    },
    {
      "title": "Compromise and Abatement — Section 204 NIRC",
      "content": "Section 204 of the NIRC provides two administrative relief mechanisms: (1) Compromise — the CIR may compromise any tax liability (inclusive of penalties and interest) when: (a) there is reasonable doubt as to the validity of the assessment (minimum compromise: 40% of the basic tax assessed); or (b) the taxpayer's financial position demonstrates clear inability to pay (minimum compromise: 10% of the basic tax assessed). The compromise application must be filed with supporting documents (financial statements, proof of financial incapacity, or legal arguments challenging the assessment's validity). Cases involving assessments exceeding PHP 1,000,000 or cases of fraud require approval by the National Evaluation Board (NEB). (2) Abatement — the CIR may abate or cancel a tax liability when: (a) the tax or penalty is unjustly or excessively assessed; (b) the administration and collection costs do not justify the assessment amount. Abatement may also cover penalties and surcharges when the non-compliance is due to the taxpayer's good faith reliance on BIR rulings or reasonable interpretation of the law. The compromise and abatement procedures are detailed in RR 30-2002 and subsequent issuances. Taxpayers should note that availing of compromise does not constitute an admission of liability and does not set a precedent for future assessments. However, the compromise amount must be paid in full within the agreed period, failing which the original assessment is reinstated."
    },
    {
      "title": "RMC 107-2025 — Suspension of BIR Field Audits",
      "content": "Revenue Memorandum Circular (RMC) 107-2025, issued November 24, 2025, announced the unprecedented suspension of all BIR field audits effective immediately. This directive was issued as part of a comprehensive reform initiative under the new BIR leadership, aimed at: (1) reviewing and overhauling the audit selection process to implement a truly risk-based approach under the EOPT Act (RA 11976); (2) addressing long-standing concerns about revenue officer misconduct, extortion, and arbitrary assessments; (3) allowing the BIR to develop and deploy new digital audit tools and data analytics capabilities; (4) aligning audit procedures with international best practices and the OECD Tax Administration framework. The suspension covers: all pending and new Letters of Authority (LOAs); all field audit activities including document examination, property inspection, and third-party verification; and all compliance verification activities conducted at taxpayer premises. The suspension does NOT affect: (a) assessments already issued (FLD/FAN); (b) pending protests and their resolution; (c) CTA proceedings; (d) desk audits and data matching conducted within BIR offices; (e) criminal tax fraud investigations. The BIR has indicated that the suspension is temporary and will be lifted once the new audit framework is in place, but no specific timeline has been provided. Taxpayers who receive LOAs or audit requests during the suspension period should verify the legitimacy of such requests with the BIR regional office."
    },
    {
      "title": "Common Audit Red Flags and Triggers",
      "content": "The BIR's audit selection system identifies taxpayers for examination based on various risk indicators: (1) Zero or minimal VAT for consecutive quarters — particularly suspicious for businesses with significant operations that should generate output VAT. (2) Sales and purchases discrepancies — when third-party data (from suppliers' purchases or customers' sales reports) does not match the taxpayer's reported figures. (3) Consistently reporting losses — businesses reporting net losses for three or more consecutive years, especially when operations appear to continue normally. (4) Large capital gains or property transactions — reported through third-party information from the Register of Deeds, banks, or other agencies. (5) Intercompany transactions — related-party dealings that may involve transfer pricing manipulation, especially cross-border transactions subject to TP documentation requirements. (6) Industry benchmarking anomalies — when a taxpayer's profitability, expense ratios, or tax compliance metrics deviate significantly from industry norms. (7) Informant reports — the BIR maintains a reward system for informants who provide information leading to the discovery of tax violations (Section 282, NIRC). (8) Failure to file returns or late filing patterns. (9) Large withholding tax credits claimed without corresponding income. (10) Sudden changes in reported revenue or expenses between periods. Under the EOPT Act, the BIR is mandated to implement a risk-based audit selection system, moving away from the previous lottery/random selection approach."
    },
    {
      "title": "Practical Defense Strategies for BIR Audits",
      "content": "Effective defense against BIR audits requires proactive preparation and strategic response: (1) Contemporaneous documentation — maintain complete and organized records throughout the year, not just during audit season. Key records include: official receipts, sales invoices, purchase invoices, bank statements, contracts, delivery receipts, and journal entries. (2) Verify LOA validity — confirm the LOA is properly signed, within the 120-day validity period, and covers only the stated tax types and periods. Object in writing to any irregularities. (3) Designate an audit coordinator — assign a knowledgeable staff member or engage a tax counsel/CPA to handle all communications with the revenue officer. Never allow the RO unsupervised access to records. (4) Respond to all notices within prescribed deadlines — missing the 15-day PAN response or 30-day FAN protest period is fatal to the taxpayer's case. (5) Request for particulars — demand specific details of alleged discrepancies; the BIR must provide a detailed computation of the assessed deficiency. (6) Prepare a reconciliation schedule — systematically reconcile reported figures with source documents and explain any differences. (7) Engage tax counsel early — particularly for assessments exceeding PHP 1,000,000 or involving complex issues (transfer pricing, VAT zero-rating, treaty benefits). (8) Cooperate but protect rights — while cooperation expedites the process, the taxpayer is not obligated to produce documents outside the scope of the LOA or beyond the legally required retention period. (9) Consider compromise/abatement for small assessments where the cost of litigation exceeds the tax liability."
    }
  ]
}
