{
  "category": "compliance",
  "source": "BIR Official Forms — Comprehensive Guide",
  "chunks": [
    {
      "title": "BIR Form 2550Q - Quarterly VAT Return",
      "content": "BIR Form 2550Q (Quarterly Value-Added Tax Return): Filed by VAT-registered persons within 25 days after the end of each taxable quarter. The quarterly return consolidates the 3 months of the quarter. Structure mirrors BIR 2550M with quarterly totals: Part I — Taxpayer Information (TIN, RDO, registered name, address, taxable quarter, amendment indicator). Part II — Taxable Sales/Receipts and Output Tax: Line 14A Vatable Sales, Line 14B Sales to Government, Line 14C Zero-Rated Sales, Line 14D Exempt Sales, Line 15 Total Sales. Part III — Output Tax: Line 16 Output VAT on Vatable Sales (14A x 12%), Line 16A VAT Withheld by Government (14B x 5%), Line 16B Total Output Tax. Part IV — Input Tax: Lines 17-21 covering purchases of goods, capital goods, services, imports, and prior period excess credits. Part V — Tax Due/Overpayment. Required attachments: Summary List of Sales (SLS), Summary List of Purchases (SLP), SAWT (if applicable), and Monthly VAT Declarations (2550M) for the first two months of the quarter."
    },
    {
      "title": "BIR Form 1701 - Annual Income Tax Return (Individuals)",
      "content": "BIR Form 1701 (Annual Income Tax Return for Self-Employed Individuals, Estates, and Trusts): Filed on or before April 15 of each year, covering income earned during the preceding calendar year. The form has 3 schedules: Schedule 1 — Income from Business/Profession: gross sales/receipts, less cost of sales, less operating expenses (itemized or OSD at 40%), arriving at net taxable income. Schedule 2 — Non-Business/Non-Professional Income: compensation income (if mixed income earner), passive income already subjected to final tax (for information only). Schedule 3 — Tax Computation: apply graduated income tax rates (0% to 35%), less tax credits/payments (quarterly income taxes paid via 1701Q, creditable withholding taxes via Form 2307, foreign tax credits), arriving at tax due or overpayment. Attachments: financial statements (if itemized deductions), Certificate of Income Tax Withheld (BIR Form 2316), BIR Form 2307 certificates, waiver of husband's right to claim deductions (if applicable). For 8% flat tax filers, BIR Form 1701A (simplified) is used instead."
    },
    {
      "title": "BIR Form 1701A - Annual Income Tax Return (Simplified)",
      "content": "BIR Form 1701A is the simplified Annual Income Tax Return for individuals earning: (1) Purely compensation income (regardless of amount); (2) Purely business/professional income availing of the 8% flat tax rate; (3) Both compensation and business/professional income with the 8% option for business portion. The form is significantly shorter than Form 1701. For 8% filers: Gross Sales/Receipts less PHP 250,000 non-taxable amount, multiplied by 8%. For compensation earners: Gross compensation less non-taxable income (13th month, de minimis, etc.), apply graduated rates. Filing deadline: April 15 of the following year. This form CANNOT be used if: (a) the taxpayer uses itemized deductions for business income; (b) the taxpayer uses OSD for business income (use Form 1701 instead); (c) gross sales/receipts exceed PHP 3,000,000 (must shift to graduated rates). Quarterly declarations during the year use BIR Form 1701Q."
    },
    {
      "title": "BIR Form 1702 - Annual Income Tax Return (Corporations)",
      "content": "BIR Form 1702 (Annual Income Tax Return for Corporations, Partnerships, and Other Non-Individual Taxpayers): Due on the 15th day of the 4th month following the close of the taxable year (April 15 for calendar year filers). Three variants: (1) 1702-RT — for corporations subject to Regular Tax (25% or 20%); (2) 1702-EX — for corporations with only exempt income; (3) 1702-MX — for corporations with mixed income (taxable and exempt). Key sections: Gross income, less cost of sales/services, less deductions (itemized or OSD at 40% of gross income), taxable income, tax due (RCIT or MCIT, whichever is higher). Required attachments: Audited Financial Statements (AFS), tax computation schedule, SAWT, BIR Form 2307 certificates, schedules of deductions, GIS/Articles of Incorporation (first filing). MCIT computation: 1% of gross income, compared with RCIT (25% or 20% of net taxable income). If MCIT > RCIT, pay MCIT; excess MCIT creditable against RCIT for 3 years."
    },
    {
      "title": "BIR Form 1701Q - Quarterly Income Tax Return (Individuals)",
      "content": "BIR Form 1701Q (Quarterly Income Tax Return for Self-Employed Individuals and Professionals): Filed within 60 days after the end of each of the first 3 quarters (no 4th quarter return — replaced by annual return 1701/1701A). Filing deadlines: Q1 (Jan-Mar) — May 30; Q2 (Apr-Jun) — August 29; Q3 (Jul-Sep) — November 29. For graduated income tax filers: Cumulative gross sales/receipts less cumulative cost of sales less cumulative deductions (itemized or OSD), arriving at cumulative taxable income, apply graduated rates, less tax credits (creditable withholding taxes from 2307s, quarterly taxes previously paid). For 8% flat tax filers: Cumulative gross sales/receipts less PHP 250,000 (applied only in Q1), multiplied by 8%, less taxes previously paid. The quarterly return serves as an installment payment of the annual income tax liability. Penalties for late filing: 25% surcharge + 12% annual interest + compromise penalty."
    },
    {
      "title": "BIR Form 1702Q - Quarterly Income Tax Return (Corporations)",
      "content": "BIR Form 1702Q (Quarterly Income Tax Return for Corporations): Filed within 60 days after the end of each of the first 3 quarters. Filing deadlines for calendar year filers: Q1 (Jan-Mar) — May 30; Q2 (Apr-Jun) — August 29; Q3 (Jul-Sep) — November 29. Structure: Cumulative gross income less cumulative allowable deductions (may use OSD at 40% of gross income or itemized), arriving at cumulative taxable income. Tax computation: (1) RCIT — 25% (or 20% for qualifying SMEs) of cumulative taxable income; (2) MCIT — 1% of cumulative gross income; pay the higher amount. Less: prior quarter's income tax payments, creditable withholding taxes from 2307 forms, other tax credits. Excess MCIT from prior years may be credited against RCIT (not against MCIT). Important: The MCIT applies starting from the 4th taxable year of operations. New corporations in their first 3 years pay only RCIT."
    },
    {
      "title": "BIR Form 2316 - Certificate of Compensation Payment/Tax Withheld",
      "content": "BIR Form 2316 (Certificate of Compensation Payment/Tax Withheld): Issued by employers to employees on or before January 31 of the following year, or upon cessation of employer-employee relationship. Purpose: Certifies the total compensation paid and total taxes withheld during the calendar year. Key fields: Employee TIN and name, employer TIN and name, compensation details (basic salary, overtime, 13th month pay, other benefits), non-taxable income (de minimis, 13th month up to PHP 90,000), taxable compensation, tax withheld. The form serves as the employee's income tax return (substituted filing) if: (1) the employee derives purely compensation income; (2) from only one employer; (3) the employer correctly withheld the tax. If the employee has multiple employers, additional income, or seeks to claim deductions, they must file their own BIR Form 1700 (for purely compensation) or 1701 (for mixed income). Employers must submit an alphabetical list of employees with BIR Form 1604-CF on or before January 31."
    },
    {
      "title": "BIR Form 1601-C - Monthly Remittance of Withholding Tax on Compensation",
      "content": "BIR Form 1601-C (Monthly Remittance Return of Income Taxes Withheld on Compensation): Filed by employers who withhold income taxes from employee compensation. Due date: On or before the 10th day of the following month. The return reports: (1) Total compensation paid during the month; (2) Total taxes withheld per the withholding tax table (based on employee's tax status: single, married, number of dependents — though TRAIN removed personal exemptions, the table is now simplified); (3) Adjustments for over/under withholding. Monthly withholding tax on compensation is computed using the BIR Withholding Tax Table (Annex A of RR 11-2018, as amended), which applies the graduated rates on a monthly basis. Example: Employee with monthly taxable compensation of PHP 30,000: First PHP 20,833 (PHP 250,000/12) is exempt; Excess PHP 9,167 x 15% = PHP 1,375 tax withheld monthly. For the month of December, the employer makes a year-end adjustment to reconcile total withholding with annual tax due."
    },
    {
      "title": "BIR Form 2307 - Certificate of Creditable Tax Withheld at Source",
      "content": "BIR Form 2307 (Certificate of Creditable Tax Withheld at Source): Issued by the income payor to the income payee, certifying the amount of expanded withholding tax (EWT) withheld. Key details: (1) Payor's TIN, name, address; (2) Payee's TIN, name, address; (3) ATC (Alphalist of Tax Code) code identifying the nature of income; (4) Amount of income payment; (5) Tax withheld (rate x income). The certificate covers a calendar quarter and must be issued to the payee on or before the 20th day of the month following the close of the quarter. The payee uses BIR 2307 to claim tax credits against income tax due (both quarterly via 1701Q/1702Q and annually via 1701/1702). If total creditable taxes withheld exceed the income tax due, the excess is either refundable or may be carried over as a tax credit to the next year. Payors must file BIR Form 1601-EQ (Quarterly Remittance) on or before the last day of the month following the quarter, and BIR Form 0619-E (Monthly Remittance) on or before the 10th of the following month (except for the last month of the quarter)."
    },
    {
      "title": "BIR Form 1604-CF and 1604-E - Annual Information Returns",
      "content": "BIR Form 1604-CF (Annual Information Return of Income Taxes Withheld on Compensation and Final Withholding Taxes): Filed by every employer or withholding agent on or before January 31 of the following year. This form summarizes all compensation paid and taxes withheld for the calendar year, accompanied by the alphabetical list of employees (with their individual 2316 data). BIR Form 1604-E (Annual Information Return of Creditable Income Taxes Withheld - Expanded): Filed on or before March 1 of the following year. Summarizes all expanded withholding taxes remitted during the year, accompanied by the alphabetical list of payees (with their individual 2307 data). Both forms must be filed electronically via eFPS or eBIRForms. Penalties for non-filing or late filing: PHP 1,000 per return + 25% surcharge + 12% interest. These annual information returns enable the BIR to cross-reference income declarations by taxpayers against the amounts reported by payors/employers."
    },
    {
      "title": "BIR Form 0605 and 0619 - Registration and Monthly Remittances",
      "content": "BIR Form 0605 (Payment Form / Annual Registration Fee): All registered taxpayers must pay an annual registration fee of PHP 500 on or before January 31 of each year. Also used for: advance payment of taxes, payment of penalties, and other non-return payments. BIR Form 0619-E (Monthly Remittance Form for Creditable Income Taxes Withheld - Expanded): Filed by withholding agents on or before the 10th of the following month for the first 2 months of each quarter. For the 3rd month, the quarterly return (1601-EQ) is filed instead. BIR Form 0619-F (Monthly Remittance Form for Final Income Taxes Withheld): Similar to 0619-E but for final withholding taxes (on interest, dividends, royalties, etc.). Filed on or before the 10th of the following month for the first 2 months of each quarter. For the 3rd month, use BIR Form 1601-FQ. Note: All monthly and quarterly remittances must be reconciled with the annual information returns (1604-CF and 1604-E)."
    },
    {
      "title": "BIR Forms for Real Property Transactions",
      "content": "BIR forms related to real property transactions: (1) BIR Form 1706 (Capital Gains Tax Return for Sale of Real Property classified as Capital Asset): 6% capital gains tax on the selling price or zonal value or fair market value, whichever is higher. Filed within 30 days after sale/disposition. (2) BIR Form 2000-OT (Documentary Stamp Tax Return for One-Time Transactions): DST on sale of real property is PHP 15 for every PHP 1,000 (or fraction thereof) of the selling price or zonal/fair market value, whichever is higher (1.5%). Filed within 5 days after the close of the month of transaction. (3) BIR Form 1707 (CGT Return for Sale of Shares Not Listed): Used for sale of shares of stock in closely held corporations. 15% CGT on net capital gain. (4) Creditable Withholding Tax on sale of real property classified as ordinary asset: 1.5% if selling price <= PHP 2M; 3% if > PHP 2M but <= PHP 5M; 5% if > PHP 5M. (5) Certificate Authorizing Registration (CAR/eCAR): Required from BIR before transfer of title at the Register of Deeds."
    }
  ]
}
