{
  "category": "income_tax",
  "source": "CREATE Act (RA 11534) & CREATE MORE Act (RA 12066)",
  "chunks": [
    {
      "title": "CREATE Act Overview",
      "content": "Republic Act No. 11534, the Corporate Recovery and Tax Incentives for Enterprises (CREATE) Act, was signed on March 26, 2021 and took retroactive effect on July 1, 2020. It is Package 2 of the Comprehensive Tax Reform Program. Key changes: (1) Reduced Regular Corporate Income Tax (RCIT) from 30% to 25%; (2) Reduced RCIT to 20% for domestic corporations with net taxable income not exceeding PHP 5M AND total assets not exceeding PHP 100M (excluding land); (3) Reduced Minimum Corporate Income Tax (MCIT) from 2% to 1% for 3 years (July 1, 2020 to June 30, 2023); (4) Reduced percentage tax from 3% to 1% for the same period; (5) Rationalized fiscal incentives — replaced over 200 investment incentive laws with a unified regime; (6) Created the Fiscal Incentives Review Board (FIRB) to manage investment incentives. The law aims to attract investment and support businesses recovering from the COVID-19 pandemic."
    },
    {
      "title": "CREATE MORE Act Overview",
      "content": "Republic Act No. 12066, the CREATE MORE (Maximize Opportunities for Reinvigorating the Economy) Act, was signed on November 11, 2024. Key enhancements: (1) Enhanced deductions for R&D expenses — 200% deduction for R&D conducted with local universities, 150% for in-house R&D; (2) Expanded list of qualified activities eligible for incentives; (3) Streamlined incentive application process; (4) Extended income tax holiday for registered business enterprises from 4-7 years to up to 17 years for projects in certain areas; (5) Special Corporate Income Tax (SCIT) rate of 5% on gross income in lieu of all national and local taxes; (6) Enhanced Deductions (ED) regime with additional deductions for specific expenses; (7) Made MCIT reduction to 1% permanent (was temporary under CREATE); (8) Extended the 1% percentage tax for non-VAT registered taxpayers. The law aims to make the Philippines more competitive in attracting foreign direct investment."
    },
    {
      "title": "Corporate Income Tax Rates Under CREATE/CREATE MORE",
      "content": "Corporate Income Tax (CIT) structure under CREATE and CREATE MORE Acts: (1) Regular Corporate Income Tax (RCIT) — 25% on net taxable income for domestic corporations and resident foreign corporations; (2) Reduced RCIT — 20% for domestic corporations with (a) net taxable income not exceeding PHP 5,000,000 AND (b) total assets not exceeding PHP 100,000,000 (excluding the value of land on which the business entity's office, plant, and equipment are situated); (3) Minimum Corporate Income Tax (MCIT) — 1% of gross income, applicable from the 4th taxable year of operations, imposed when MCIT exceeds RCIT; (4) Proprietary educational institutions and non-profit hospitals — 1% (temporarily under CREATE, now potentially restored to 10%); (5) Non-resident foreign corporations — 25% on gross income from Philippine sources; (6) International carriers — 2.5% on Gross Philippine Billings; (7) Regional operating headquarters (ROHQ) — 25% (previously 10%). MCIT excess can be carried forward and credited against RCIT for 3 succeeding taxable years."
    },
    {
      "title": "CREATE - Fiscal Incentives Regime",
      "content": "The CREATE Act established a unified fiscal incentives regime managed by the Fiscal Incentives Review Board (FIRB). Key incentive tiers: (1) Income Tax Holiday (ITH) — 4 to 7 years of 100% exemption from income tax, depending on location and industry; (2) Special Corporate Income Tax (SCIT) — 5% on gross income in lieu of all national and local taxes (except real property tax on land), available after ITH; (3) Enhanced Deductions (ED) — additional deductions of up to 50% on certain expenses (training, R&D, infrastructure, etc.) on top of regular deductions; (4) Duty exemption — on importation of capital equipment, raw materials, spare parts, and accessories; (5) VAT exemption or zero-rating on local purchases. Investment Promotion Agencies (IPAs) that administer incentives: PEZA, BOI, TIEZA, BCDA, CEZA, AFAB, and others. All IPAs must follow the Strategic Investment Priority Plan (SIPP) in granting incentives. Maximum total incentive period: 17 years (ITH + SCIT/ED combined)."
    },
    {
      "title": "CREATE - Changes to Withholding Tax on Dividends",
      "content": "Under CREATE Act, withholding tax on dividends and other passive income: (1) Cash or property dividends to individual shareholders — 10% final withholding tax (FWT); (2) Cash or property dividends to domestic corporations — exempt if the investing corporation owns at least 20% of the outstanding shares of the investee corporation; (3) Dividends received from a domestic corporation by a nonresident foreign corporation — 25% FWT (reduced from 30%), or as provided under applicable tax treaties; (4) Inter-corporate dividends between domestic corporations — generally exempt under Section 73(D); (5) Capital gains from sale of shares of stock not listed on the stock exchange — 15% CGT; (6) Capital gains from sale of shares listed on the stock exchange — 6/10 of 1% stock transaction tax on the selling price; (7) Interest income from deposits and yield from deposit substitutes — 20% FWT for residents, 25% for nonresident aliens engaged in trade, exempt for nonresident aliens not engaged in trade."
    },
    {
      "title": "CREATE - Changes Affecting SMEs",
      "content": "The CREATE Act provides significant benefits for Small and Medium Enterprises (SMEs): (1) Reduced CIT rate of 20% — applicable to corporations with net taxable income not exceeding PHP 5M AND total assets not exceeding PHP 100M; (2) Reduced MCIT from 2% to 1% — relief for startups and loss-making companies; (3) Reduced percentage tax from 3% to 1% — benefits non-VAT registered businesses; (4) Optional Standard Deduction (OSD) — retained at 40% of gross income for corporations, 40% of gross sales/receipts for individuals (as alternative to itemized deductions); (5) Simplified tax compliance — EFPS requirements eased for smaller taxpayers; (6) Registration incentives for micro/small enterprises in barangays with no BIR presence. Key compliance note: To avail of the 20% reduced rate, the corporation must demonstrate BOTH conditions (PHP 5M income threshold AND PHP 100M asset threshold) in the annual income tax return. If either threshold is exceeded, the 25% rate applies."
    },
    {
      "title": "CREATE MORE - R&D Tax Incentives",
      "content": "CREATE MORE Act introduced enhanced R&D tax incentives to encourage innovation: (1) 200% deduction for R&D expenses when conducted in collaboration with local higher education institutions (HEIs) or government research institutions; (2) 150% deduction for in-house R&D expenses; (3) Qualified R&D activities include: basic research, applied research, and experimental development aimed at discovering new knowledge or creating new products/processes; (4) R&D expenses eligible for enhanced deduction: salaries of R&D personnel, supplies and materials used in R&D, depreciation of equipment used in R&D, overhead expenses attributable to R&D; (5) Non-qualifying expenses: market research, quality control testing, routine data collection, adaptation of existing products for specific customers; (6) Documentation requirements: R&D project plan, progress reports, itemized expense records, certification from DOST or CHED for collaborative R&D. The enhanced R&D deductions aim to increase the country's R&D spending from less than 0.5% of GDP to a target of 2%."
    }
  ]
}
