{
  "category": "general",
  "source": "Estate Tax and Donor's Tax — TRAIN Law Amendments, Computation and Filing",
  "chunks": [
    {
      "title": "Estate Tax — Flat 6% Rate Under TRAIN Law",
      "content": "Under the TRAIN Law (RA 10963), effective January 1, 2018, the estate tax was simplified from a graduated schedule (5-20%) to a single flat rate of 6% applied to the net estate. The net estate is computed as: Gross Estate minus Allowable Deductions. The gross estate of a resident decedent includes all property, real or personal, tangible or intangible, wherever situated at the time of death. For non-resident decedents who are not citizens, only properties situated in the Philippines are included. The gross estate encompasses: real property (at FMV per assessor or zonal value, whichever is higher), personal property (bank deposits, investments, vehicles, jewelry), intangible property (shares of stock, receivables, intellectual property), proceeds of life insurance (unless irrevocably designated to a beneficiary other than the estate, executor, or administrator), transfers in contemplation of death, and revocable transfers. Property previously taxed (vanishing deductions) within five years before death may qualify for graduated deductions (100% if within 1 year, down to 20% if 4-5 years). The estate tax applies regardless of whether the estate is settled judicially or extrajudicially."
    },
    {
      "title": "Allowable Deductions from Gross Estate",
      "content": "The NIRC allows the following deductions from the gross estate to arrive at the net taxable estate: (1) ELIT — Expenses (funeral expenses up to 5% of gross estate or PHP 200,000 whichever is lower; judicial expenses of estate settlement), Losses (casualty losses not compensated by insurance, incurred within the settlement period), Indebtedness (claims against the estate that are bona fide debts existing at death, supported by notarized documents if owed to related parties), and Taxes (unpaid taxes accrued before death, excluding estate tax itself). (2) Claims against insolvent persons — debts owed to the decedent by insolvent debtors. (3) Transfers for public purpose — bequests to the Philippine government or political subdivisions for public purposes. (4) Family home deduction — FMV of the family home up to PHP 10,000,000 (the family home must have been the decedent's principal residence as certified by the barangay captain). (5) Standard deduction of PHP 5,000,000 — available to all estates of citizen and resident decedents without need for substantiation. (6) Share of the surviving spouse in the conjugal or community property — 50% of the common properties is excluded from the gross estate as it belongs to the surviving spouse. For non-resident alien decedents, only expenses/losses/indebtedness proportionate to Philippine properties are deductible, and the standard deduction is PHP 500,000."
    },
    {
      "title": "Estate Tax Filing — BIR Form 1801 and Requirements",
      "content": "The estate tax return is filed using BIR Form 1801 and must be submitted within one (1) year from the date of death of the decedent. An extension of up to two (2) years may be granted by the BIR Commissioner upon meritorious request filed before the original deadline. The return is filed with the RDO having jurisdiction over the decedent's last residence (for residents) or where the property is located (for non-residents). Required attachments include: (1) certified true copy of the death certificate; (2) TIN of the decedent and the estate; (3) notarized Deed of Extrajudicial Settlement or court order (if judicial settlement); (4) certified true copies of land titles and tax declarations; (5) bank certifications of deposits and investments as of date of death; (6) proof of claimed deductions (funeral receipts, medical receipts, loan documents); (7) Certificate of No Improvement issued by the assessor (if applicable); (8) special power of attorney (if filed by a representative). Payment may be made through AABs or eFPS. Installment payment is allowed for a period of up to two (2) years from the statutory due date, provided the estate tax exceeds PHP 200,000 and the estate is not sufficient to pay the tax in lump sum. Penalties for late filing: 25% surcharge, 12% interest per annum, and compromise penalties."
    },
    {
      "title": "Estate Tax Amnesty Under RA 11213",
      "content": "The Tax Amnesty Act (RA 11213), signed on February 14, 2019, grants an estate tax amnesty covering the estates of decedents who died on or before December 31, 2017 (originally), subsequently extended to cover decedents who died on or before December 31, 2021 through amendments. The amnesty rate is 6% of the total net undeclared estate, or a minimum amnesty tax of PHP 5,000 (whichever is higher). The net estate for amnesty purposes is computed based on the FMV at the time of death. Key features: (1) all estate tax liabilities, including accumulated penalties and interest, are considered settled upon amnesty availment; (2) the amnesty covers both filed and unfiled estate tax returns; (3) immunities from criminal, civil, and administrative penalties related to estate tax; (4) the amnesty cannot be availed of for estates involved in fraud cases already filed in court. To avail, the estate administrator or any heir files the Estate Tax Amnesty Return (ETAR) and pays the amnesty tax. Required documents include the death certificate, TINs, proof of property ownership, and the Deed of Extrajudicial Settlement. The amnesty has been extended multiple times by Congress — taxpayers should verify the current deadline and coverage period. This amnesty is particularly valuable for real properties that have remained in the names of deceased persons for years or decades, enabling heirs to finally process title transfers."
    },
    {
      "title": "Donor's Tax — Flat 6% Rate Under TRAIN Law",
      "content": "Under the TRAIN Law, the donor's tax was simplified from graduated rates (2-15%) to a flat rate of 6% applied to total donations exceeding PHP 250,000 during the calendar year. The PHP 250,000 exempt threshold is a cumulative annual limit — it covers all donations made by the donor to all donees during the year, not per donee. Once total donations exceed PHP 250,000, the 6% tax applies to the excess. The donor's tax return is filed using BIR Form 1800 and must be submitted within thirty (30) days from the date of donation. The return is filed with the RDO where the donor is registered. For donations of real property, the tax base is the FMV at the time of donation (higher of BIR zonal value or assessor's FMV). For personal property, the tax base is the fair market value at the time of the gift. Donations between spouses during the marriage are generally void under the Family Code (with exceptions), but donations made before or upon marriage (donations propter nuptias) are valid and subject to donor's tax. For conjugal or community property, the donation is treated as made by both spouses equally — each spouse has a separate PHP 250,000 exemption."
    },
    {
      "title": "Exempt Donations and Special Rules",
      "content": "The following donations are exempt from donor's tax under Section 101 of the NIRC: (1) gifts made to or for the use of the National Government or any of its agencies or political subdivisions, including fully-owned government corporations; (2) gifts to educational and/or charitable, religious, cultural, or social welfare corporations, institutions, accredited NGOs, trusts, or philanthropic organizations — provided that not more than 30% of the donation is used for administrative purposes; (3) donations to international organizations with tax exemption agreements with the Philippines (e.g., ADB, WHO, UN agencies); (4) encumbrances on the property at the time of donation are deductible from the FMV to arrive at the net gift. Dowries or gifts made on account of marriage by parents to their legitimate, recognized natural, or adopted children are no longer specifically exempt under TRAIN but fall under the general PHP 250,000 annual exemption. For donors who are non-resident aliens, only donations of property situated in the Philippines are subject to donor's tax, and the same 6% rate and PHP 250,000 exemption apply. Tax treaties may modify the donor's tax treatment for gifts between residents of treaty countries."
    },
    {
      "title": "Documentary Stamp Tax and CAR for Donations and Inheritance",
      "content": "In addition to the estate tax or donor's tax, transfers of real property through inheritance or donation are subject to Documentary Stamp Tax (DST) under Section 196 of the NIRC at the rate of 1.5% of the FMV of the property. The DST is filed using BIR Form 2000-OT and must be paid within five (5) days after the close of the month of the transfer document's execution. For estate settlements, the DST is computed on each heir's share of the real property based on the Deed of Extrajudicial Settlement or court order of partition. For donations, the DST is based on the FMV at the time of donation. After payment of all applicable national taxes (estate/donor's tax and DST), the transferor or heir must secure a Certificate Authorizing Registration (eCAR) from the BIR to effect the transfer of title at the Register of Deeds. The eCAR application requires submission of: the estate tax return or donor's tax return with proof of payment; DST return with proof of payment; the Deed of Extrajudicial Settlement or Deed of Donation; certified true copies of land titles; and tax declarations. The local transfer tax (0.5-0.75%) must also be paid at the local treasurer's office before the Register of Deeds will process the title transfer."
    },
    {
      "title": "Estate and Donor's Tax Computation Examples",
      "content": "Example 1 — Estate Tax: Decedent (Filipino citizen) dies in 2024 with the following properties: real property (PHP 15,000,000), bank deposits (PHP 3,000,000), shares of stock (PHP 2,000,000). Gross estate = PHP 20,000,000. Deductions: funeral expenses (PHP 200,000), outstanding debts (PHP 1,000,000), family home (PHP 10,000,000), standard deduction (PHP 5,000,000), share of surviving spouse in conjugal property (PHP 10,000,000 — 50% of the PHP 20M gross estate). Net estate = PHP 20,000,000 - PHP 200,000 - PHP 1,000,000 - PHP 10,000,000 - PHP 5,000,000 - PHP 10,000,000 = negative (PHP 6,200,000). Since the net estate is negative or zero, no estate tax is due. Example 2 — Donor's Tax: A taxpayer donates a parcel of land with a zonal value of PHP 5,000,000 and an assessor's FMV of PHP 4,000,000. This is the donor's first donation in the year. Donor's tax = (PHP 5,000,000 - PHP 250,000) × 6% = PHP 285,000. Additionally, DST of 1.5% × PHP 5,000,000 = PHP 75,000 is due. Total taxes on the donation: PHP 360,000 (donor's tax + DST), excluding local transfer tax."
    },
    {
      "title": "Common Planning Strategies and Pitfalls",
      "content": "Estate and donor's tax planning strategies commonly used in the Philippines include: (1) Lifetime giving: spreading donations across multiple years to maximize the PHP 250,000 annual exemption — for example, donating PHP 250,000 per year over 10 years transfers PHP 2.5M tax-free. (2) Family home strategy: ensuring the principal residence qualifies for the PHP 10M family home deduction by maintaining barangay certification and actual residency. (3) Life insurance planning: designating irrevocable beneficiaries other than the estate to exclude proceeds from the gross estate. (4) Conjugal property planning: leveraging the surviving spouse's 50% share deduction. (5) Estate tax amnesty availment: settling long-pending estates at reduced rates. Common pitfalls include: (a) Failing to file within the 1-year deadline, resulting in 25% surcharge plus interest; (b) Undervaluing properties — the BIR uses zonal values and may reassess; (c) Overlooking intangible assets (bank accounts, investments, receivables); (d) Not securing eCAR timely, resulting in properties remaining in the decedent's name indefinitely; (e) Treating transfers to trusts or family corporations as arm's length when the BIR may deem them as disguised donations; (f) Ignoring the donor's tax on below-market-value sales between related parties, where the difference between FMV and selling price may be treated as a taxable donation."
    }
  ]
}
