{
  "category": "payroll",
  "source": "Fringe Benefits Tax (FBT) Detailed Guide — NIRC Section 33",
  "chunks": [
    {
      "title": "FBT Overview — 35% Final Tax on Grossed-Up Monetary Value",
      "content": "The Fringe Benefits Tax (FBT) under Section 33 of the NIRC is a final tax imposed on the employer for fringe benefits granted to managerial and supervisory employees. The FBT rate is 35% applied to the grossed-up monetary value (GMV) of the fringe benefit. The grossed-up mechanism is designed so that the tax burden falls on the employer while the employee receives the benefit net of tax. For employees subject to the regular graduated income tax rates (i.e., resident citizens, resident aliens, and non-resident aliens engaged in trade or business), the grossed-up divisor is 65% (since 100% - 35% = 65%). The formula is: GMV = Actual Monetary Value of Benefit / 65%. The FBT is then: FBT = GMV × 35%. This effectively means the FBT is approximately 53.85% of the actual benefit value (35% / 65% = 53.846%). For non-resident aliens not engaged in trade or business (NRANETB), the applicable tax rate is 25% (TRAIN Law rate), and the grossed-up divisor is 75%, making GMV = Actual Value / 75% and FBT = GMV × 25%. For special aliens employed by Regional or Area Headquarters of multinational corporations, PEZA-registered enterprises, or those covered by special laws with a preferential 15% tax rate, the grossed-up divisor is 85%, and FBT = GMV × 15%. The FBT is a final withholding tax — meaning the fringe benefit is no longer included in the employee's taxable compensation for purposes of the annual income tax return."
    },
    {
      "title": "Covered Employees: Managerial and Supervisory Only",
      "content": "FBT applies exclusively to fringe benefits furnished to managerial and supervisory employees. Under the Labor Code of the Philippines, 'managerial employees' are those who are vested with powers or prerogatives to lay down and execute management policies and/or to hire, transfer, suspend, lay-off, recall, discharge, assign, or discipline employees. 'Supervisory employees' are those who, in the interest of the employer, effectively recommend managerial actions if the exercise of such authority is not merely routinary or clerical in nature. Rank-and-file employees are NOT subject to FBT. However, fringe benefits granted to rank-and-file employees are treated differently: they are considered additional compensation income subject to the regular graduated income tax rates and must be included in the employee's taxable compensation for withholding tax purposes via BIR Form 2316. The classification of employees as managerial, supervisory, or rank-and-file follows the Labor Code definitions and should be documented in the company's organizational structure. Misclassification can result in incorrect tax treatment — if a rank-and-file employee is erroneously treated as managerial, the employer may pay FBT instead of withholding compensation tax, potentially resulting in tax deficiency assessments on the employee's income."
    },
    {
      "title": "Taxable Fringe Benefits — Comprehensive List",
      "content": "The following fringe benefits are subject to FBT when provided to managerial or supervisory employees: (1) Housing — employer-owned or leased housing provided to the employee, or housing allowance; taxable value is the fair market value of the rental or 50% of the appraised value of the property divided by 20 years for employer-owned property; (2) Motor Vehicle — employer-owned vehicle used by the employee for personal purposes; taxable value based on acquisition cost depreciated at 10% per year; if used partly for business, only the personal-use portion is taxable; (3) Household Expenses — salaries of household help, personal drivers, and other household personnel borne by the employer; (4) Interest on Loans — if the employer lends money to the employee at below market interest rate, the difference between the market rate (BIR benchmark: 12% per annum) and the actual rate charged is a taxable fringe benefit; (5) Membership Fees — country club, sports club, social club, and similar memberships paid by the employer; (6) Travel Expenses — personal travel, vacation trips, and travel of the employee's family members borne by the employer; travel for business purposes with proper documentation is excluded; (7) Educational Assistance — tuition, school fees, and educational expenses not directly related to the employer's business; (8) Life Insurance Premiums — excess over PHP 200,000 group life insurance, individual life insurance premiums paid by employer for the employee's benefit; (9) Holiday Expenses — if the employer shoulders the cost of the employee's personal holiday celebrations; (10) Other benefits of similar nature that are clearly personal to the employee."
    },
    {
      "title": "Exempt Fringe Benefits",
      "content": "The following fringe benefits are NOT subject to FBT: (1) De minimis benefits within the ceilings prescribed under RR 4-2025 (rice subsidy, uniform allowance, medical allowance, meal allowance for overtime, achievement awards, CBA benefits, Christmas gifts, laundry allowance, etc.); (2) Benefits authorized and exempted under special laws — including contributions to SSS, GSIS, PhilHealth, Pag-IBIG, and retirement benefit plans that meet the requirements of RA 4917 (private retirement plans) or RA 7641; (3) Contributions by the employer for the benefit of employees to retirement, insurance, and hospitalization benefit plans; (4) Benefits given to rank-and-file employees (these are taxed as compensation, not FBT); (5) De minimis benefits in excess of the individual ceilings but within the PHP 90,000 aggregate threshold for 13th month pay and other benefits; (6) Fringe benefits that are required by the nature of or necessary to the trade, business, or profession of the employer — e.g., a company vehicle used exclusively for business, protective clothing, and tools of the trade; (7) Fringe benefits granted to government employees and military personnel as allowed under special laws; (8) Benefits specifically exempted by tax treaty provisions for certain expatriate employees. Proper documentation is critical to substantiate that a benefit falls under an exemption. The employer bears the burden of proof in case of a BIR audit."
    },
    {
      "title": "FBT Computation Examples",
      "content": "Example 1 — Housing Benefit: An employer provides a condominium unit to a managerial employee. Monthly fair market rental value: PHP 50,000. Quarterly benefit value: PHP 50,000 × 3 months = PHP 150,000. Grossed-up monetary value (GMV): PHP 150,000 / 65% = PHP 230,769.23. FBT due: PHP 230,769.23 × 35% = PHP 80,769.23. Example 2 — Motor Vehicle (mixed use): Employer provides a company car (acquisition cost PHP 2,000,000). Annual depreciation benefit: PHP 2,000,000 × 10% = PHP 200,000. Assumed personal use: 50%. Annual taxable benefit: PHP 100,000. Quarterly benefit: PHP 25,000. GMV: PHP 25,000 / 65% = PHP 38,461.54. FBT: PHP 38,461.54 × 35% = PHP 13,461.54. Example 3 — Below-market loan: Employer loans PHP 1,000,000 to a supervisor at 3% per annum. BIR benchmark rate: 12%. Interest differential: 12% - 3% = 9% = PHP 90,000 per year. Quarterly benefit: PHP 22,500. GMV: PHP 22,500 / 65% = PHP 34,615.38. FBT: PHP 34,615.38 × 35% = PHP 12,115.38. Example 4 — Non-resident alien (NRANETB): If the housing benefit in Example 1 were given to an NRANETB, the grossed-up divisor would be 75%. GMV: PHP 150,000 / 75% = PHP 200,000. FBT: PHP 200,000 × 25% = PHP 50,000. The employer must remit FBT quarterly using BIR Form 1603."
    },
    {
      "title": "Quarterly Filing via BIR Form 1603 — Due Dates and Procedures",
      "content": "The FBT is filed and paid quarterly using BIR Form 1603 (Quarterly Remittance Return of Final Income Taxes Withheld on Fringe Benefits Paid to Employees Other Than Rank-and-File). The filing deadlines are: Q1 (January–March) — due on or before April 30; Q2 (April–June) — due on or before July 31; Q3 (July–September) — due on or before October 31; Q4 (October–December) — due on or before January 31 of the following year. The 1603 must be filed even if no fringe benefits were granted during the quarter (nil filing). The return contains: (a) details of the employer (TIN, name, address, RDO code), (b) breakdown of fringe benefits by type, (c) actual monetary value of each benefit, (d) grossed-up monetary value, (e) FBT computed, and (f) total FBT payable. Large taxpayers must file via eFPS. Payment is made through AABs, eFPS, or other BIR-authorized payment channels. The employer must maintain a subsidiary ledger or schedule of fringe benefits granted to each managerial/supervisory employee, which the BIR may examine during an audit."
    },
    {
      "title": "Annual Filing via BIR Form 1603-F and Year-End Reconciliation",
      "content": "In addition to the quarterly 1603 filings, employers must file an Annual Information Return (sometimes referenced as the annual FBT reconciliation) to summarize all fringe benefits granted during the calendar year. While BIR Form 1604-F (Annual Information Return of Income Payments Subjected to Final Withholding Taxes) is the comprehensive annual return covering all final withholding taxes (including FBT), the employer must include a schedule of fringe benefits granted, showing: (a) each recipient employee's name and TIN, (b) position/designation (to confirm managerial/supervisory status), (c) type and amount of each fringe benefit, (d) grossed-up values, and (e) FBT remitted per quarter. The 1604-F is due on January 31 of the following year and must be filed electronically with the corresponding alphalist in CSV format. Any discrepancy between the sum of quarterly 1603 filings and the annual 1604-F will be flagged for investigation. Employers must also ensure that fringe benefits subject to FBT are NOT included in the employee's BIR Form 2316 as taxable compensation (since FBT is a final tax and the benefit is already taxed at the employer level). Double taxation — reporting the same benefit as both FBT and compensation — is a common audit finding."
    },
    {
      "title": "Record-Keeping Requirements for FBT",
      "content": "Employers are required to maintain comprehensive records to support FBT computations and filings. Under Section 235 of the NIRC, all books of accounts, records, and other pertinent documents must be kept for a period of ten (10) years from the date the return was filed or was due, whichever is later. Specific FBT documentation includes: (1) Fringe Benefits Register — a detailed ledger showing each fringe benefit granted, the recipient, the date, the actual monetary value, the grossed-up value, and the FBT computed; (2) Supporting documents for housing benefits: lease contracts, rent receipts, property appraisals, or deeds; (3) Supporting documents for vehicle benefits: vehicle registration (OR/CR), log books showing business vs. personal use, fuel receipts; (4) Loan agreements and amortization schedules for below-market loans; (5) Club membership certificates and billing statements; (6) Travel expense reports distinguishing business from personal travel; (7) Payroll records clearly segregating managerial/supervisory from rank-and-file employees; (8) Board resolutions or company policies authorizing fringe benefits; (9) Quarterly BIR Form 1603 filings with proof of payment (bank debit memo or eFPS confirmation). The BIR may conduct a special audit focused on FBT compliance, particularly for companies with high-value executive compensation packages. Inadequate documentation can result in the BIR imputing fringe benefits based on industry benchmarks or available information (best evidence rule)."
    }
  ]
}
