{
  "category": "general",
  "source": "Local Government Taxes — Philippine Local Government Code (RA 7160)",
  "chunks": [
    {
      "title": "Local Business Tax (LBT) — Rates and Coverage",
      "content": "Under Sections 143-151 of the Local Government Code (RA 7160), local government units (LGUs) are authorized to impose business taxes on entities conducting trade or business within their jurisdictions. The LBT rates are set by local ordinance within the ceilings prescribed by RA 7160: (1) Manufacturers, assemblers, repackers, processors, brewers, distillers, rectifiers, and compounders — tax rates range from 1/24 of 1% (for first PHP 2M gross sales) up to 3/8 of 1% (for gross sales exceeding PHP 2M), graduated by bracket. (2) Wholesalers, distributors, dealers — rates from 1/24 of 1% up to 1/2 of 1%. (3) Exporters, manufacturers/millers of essential commodities — 1/2 of the applicable rates. (4) Retailers — rates from 2% (for first PHP 400,000) down to 1% (over PHP 400,000). (5) Contractors and other independent contractors — rates graduated similar to manufacturers. (6) Banks and financial institutions — rates from 1/6 of 1% up to 5/8 of 1%. (7) Peddlers — fixed amounts per peddler. These are maximum rates; LGUs may impose lower rates. The LBT is based on the preceding calendar year's gross sales or receipts. Common practical issues include: double taxation controversies when businesses operate in multiple LGUs, allocation rules for sales across jurisdictions, and the tax on the same item by multiple LGU levels (province and municipality)."
    },
    {
      "title": "LBT Filing, Business Permits, and Compliance",
      "content": "The Local Business Tax must be paid annually on or before January 20 of each year, based on the gross sales or receipts of the preceding calendar year. LGUs also allow quarterly payments (on or before the 20th of each quarter's first month: January 20, April 20, July 20, October 20). Late payment incurs a surcharge of 25% of the tax due plus 2% monthly interest (up to 36 months maximum). Business permits must be renewed annually, typically in January. The business permit application/renewal requires: (1) barangay clearance; (2) community tax certificate (cedula); (3) previous year's financial statements or income tax return; (4) lease contract or proof of business address; (5) proof of payment of LBT; (6) fire safety inspection certificate; (7) sanitary permit; (8) BIR registration (BIR Form 2303). New businesses must register within 30 days of commencement. Retirement or closure of business must be reported to the LGU, and the LBT for the current year is computed based on actual gross sales up to the closure date. Many LGUs, especially in Metro Manila, have implemented online business permit and tax payment systems (e.g., Manila eBPLS, Quezon City eTax). The local treasurer has the authority to examine books of accounts and pertinent records for LBT audit purposes."
    },
    {
      "title": "Real Property Tax (RPT / Amilyar) — Computation and Assessment",
      "content": "Real Property Tax (RPT), locally known as 'amilyar,' is imposed under Title II, Book II of the Local Government Code. The maximum basic RPT rates are: (1) Province — 1% of assessed value; (2) City or Municipality within Metro Manila — 2% of assessed value. On top of the basic rate, a 1% Special Education Fund (SEF) levy is imposed by all LGUs. The assessed value is computed as: Fair Market Value (per the assessor's schedule of values revised every 3 years) multiplied by the assessment level. Assessment levels by property classification: Residential — 20%; Agricultural — 40%; Commercial — 50%; Industrial — 50%; Mineral — 50%; Timberland — 20%. For example, a residential property with an assessor's FMV of PHP 5,000,000 has an assessed value of PHP 1,000,000 (PHP 5M × 20%). In a city within Metro Manila, the basic RPT would be PHP 20,000 (2% × PHP 1M) plus SEF of PHP 10,000 (1% × PHP 1M), totaling PHP 30,000 annually. The assessor's schedule of values may differ significantly from BIR zonal values. Property owners may contest the assessed value by filing a written protest with the Local Board of Assessment Appeals (LBAA) within 60 days from receipt of the assessment notice, and appeal to the Central Board of Assessment Appeals (CBAA) within 30 days from an adverse LBAA decision."
    },
    {
      "title": "RPT Payment, Discounts, and Delinquency Remedies",
      "content": "RPT is payable annually on or before January 31, or in four quarterly installments: March 31, June 30, September 30, and December 31. Many LGUs offer early payment discounts: typically 10-20% discount for full annual payment made on or before January 31 (varies by LGU ordinance). Some LGUs offer additional discounts for advance payment of multiple years. Delinquent RPT accrues interest at the rate of 2% per month on the unpaid amount, up to a maximum of 72% (36 months). LGU remedies for RPT delinquency include: (1) Administrative remedies — distraint of personal property, levy on real property; (2) Judicial remedy — civil action for collection. Real property delinquent for more than two (2) consecutive years may be sold at public auction by the local treasurer after proper notice. The delinquent owner has a one-year redemption period from the date of sale to redeem the property by paying the delinquent taxes, penalties, interest, and costs of sale. Failure to redeem results in the consolidation of ownership in the purchaser's name. Certain properties are exempt from RPT: (1) government-owned real property used for public purposes; (2) charitable institutions, churches, parsonages, convents; (3) machineries and equipment used for pollution control or environmental protection; (4) real property owned by registered cooperatives."
    },
    {
      "title": "Professional Tax, Community Tax, and Other Local Taxes",
      "content": "Professional Tax (Section 139, RA 7160): Every person who exercises a profession requiring a government examination (CPAs, lawyers, doctors, engineers, architects, etc.) must pay an annual professional tax not exceeding PHP 300 to the city or municipality where they practice or, in the case of professionals practicing in more than one LGU, where their principal office is located. Payment is required on or before January 31 each year. Community Tax Certificate (CTC/Cedula) under Sections 156-161: Every individual with income of at least PHP 1,000 annually, or who owns real property with an assessed value of PHP 1,000 or more, or who is required by law to file an income tax return, must secure a CTC. The tax is: PHP 5.00 basic + PHP 1.00 for every PHP 1,000 of income, not to exceed PHP 5,000 total. For juridical entities: PHP 500 basic + PHP 2.00 for every PHP 5,000 of assessed real property value + PHP 2.00 for every PHP 5,000 of gross receipts, not to exceed PHP 10,000 total. Other local taxes include: Sand and Gravel Tax (max 10% of FMV per cubic meter); Printing and Publication Tax; Tax on Delivery Trucks (fixed amounts); and Barangay Taxes (on stores/retailers within the barangay at rates not exceeding 1% of gross sales for those earning PHP 50,000 or less)."
    },
    {
      "title": "Local Transfer Tax and Amusement Tax",
      "content": "Local Transfer Tax (Sections 135-136, RA 7160): A tax is imposed on the sale, donation, barter, or any other mode of transferring ownership or title of real property. The maximum rates are: 0.50% of the total consideration or FMV (whichever is higher) for provinces; and 0.75% for cities and municipalities within Metro Manila. This tax is paid to the city/municipal treasurer where the property is located, within 60 days from the date of execution of the deed or document transferring ownership. Proof of payment is required for title transfer at the Register of Deeds. Local Amusement Tax (Section 140, RA 7160): LGUs may impose amusement taxes on operators of theaters, cinemas, concert halls, circuses, boxing stadia, and other places of amusement at a rate not exceeding 30% of gross receipts from admission fees. This is distinct from the national amusement taxes under NIRC Section 125, which cover professional basketball, boxing, horse races, and jai-alai. For PEZA-registered or BOI-registered enterprises enjoying tax incentives, local amusement taxes may be covered under the special tax regime (e.g., the 5% GIE in lieu of all taxes). Operators must obtain an amusement permit and remit the collected tax monthly to the local treasurer."
    },
    {
      "title": "Franchise Tax and Situs of Local Taxes",
      "content": "Local Franchise Tax (Section 137, RA 7160): Notwithstanding any exemption granted by any law or franchise, the province or city may impose a franchise tax at a rate not exceeding 50% of 1% of gross annual receipts for the preceding calendar year within the LGU. This applies to businesses operating under a franchise within the LGU's territory. The franchise tax is in addition to other local taxes unless specifically exempted by the LGU ordinance. Situs of Taxation (Section 150, RA 7160): The critical rule for determining which LGU has the right to tax is based on where the sale, transaction, or activity takes place. For manufacturers with sales offices in different LGUs: 30% of sales allocated to the LGU where the factory is located, 70% to the LGU where the sales office/branch is located. For plantation owners with sales offices elsewhere: 30% to the LGU where the plantation is located, 70% to the LGU of the sales office. For banks with branches: based on the gross receipts of each branch. Disputes between LGUs regarding the situs of taxation are resolved by the following hierarchy: (1) Joint Body of the LGUs concerned; (2) if unresolved, the Department of Finance (DOF); (3) ultimately, the courts. Double taxation issues arise frequently, particularly for businesses operating across multiple LGUs."
    },
    {
      "title": "Tax Incentives from LGUs and Free Port Zones",
      "content": "Under Section 192 of the Local Government Code, LGUs may grant tax exemptions, incentives, or relief through local ordinances. Common LGU incentive ordinances include: (1) tax holidays for new businesses — typically 1-5 years of LBT/RPT exemption for businesses establishing in the LGU; (2) RPT condonation programs — periodic amnesty on delinquent RPT penalties and interest; (3) discounts for senior citizens and PWDs on local fees; (4) incentives for green/environmental businesses; (5) special rates for industries targeted for economic development. Free port zones (Subic Bay Freeport, Clark Freeport, Cagayan Freeport, Zamboanga Freeport) offer special local tax treatment under their respective charters: enterprises located within free ports are generally exempt from local taxes in lieu of a 5% gross income tax paid directly to the free port authority. However, under CREATE and CREATE MORE, the Fiscal Incentives Review Board (FIRB) now has centralized authority over all investment incentives, including those in free ports, which may affect the local tax exemptions. The RBELT (Regional Board Enterprises Local Tax) under CREATE MORE provides an optional 2% Gross Income Earned tax for registered business enterprises in lieu of local business taxes, subject to FIRB approval and LGU consent."
    },
    {
      "title": "RBELT and CREATE MORE Impact on Local Taxation",
      "content": "The CREATE MORE Act (RA 12066, November 2024) introduced significant changes to the interplay between national investment incentives and local government taxation. The Regional Board Enterprises Local Tax (RBELT) provision allows registered business enterprises (RBEs) under the enhanced incentives regime to opt for a 2% tax on Gross Income Earned (GIE) in lieu of all local taxes, fees, and charges. This is intended to provide fiscal certainty and reduce the compliance burden for registered enterprises across multiple LGUs. Key provisions: (1) The 2% GIE replaces local business tax, RPT on business-related properties, and other local fees during the incentive period; (2) LGUs are compensated through a share of the national government's revenue from incentive-registered enterprises; (3) The FIRB administers the RBELT regime and coordinates with LGUs; (4) LGUs may negotiate additional terms with RBEs under the strategic investment priority plan (SIPP). This represents a fundamental shift from the previous regime where LGUs had autonomous taxing powers over businesses within their jurisdictions. Some LGU leagues have expressed concerns about potential revenue loss. The IRR of CREATE MORE (signed February 17, 2025) provides detailed implementing guidelines for the RBELT, including the application process, GIE computation methodology, and LGU coordination mechanisms."
    }
  ]
}
