{
  "category": "income_tax",
  "source": "NIRC Title II - Income Tax (Sections 24-77) Detailed Provisions",
  "chunks": [
    {
      "title": "Section 24 - Income Tax Rates for Individual Citizens and Residents",
      "content": "Section 24(A) NIRC as amended by TRAIN: Tax on taxable income of individual citizen and resident alien: (1) Graduated rates from 0% to 35% (see TRAIN Law rate table); (2) Taxable income = Gross income less allowable deductions (itemized or OSD at 40% of gross sales/receipts); (3) For purely compensation income earners: employer withholds monthly via BIR 1601-C, annual reconciliation via BIR 2316; (4) For self-employed/professionals: quarterly returns (1701Q) + annual return (1701 or 1701A); (5) Mixed income earners (compensation + business): compensation taxed first using graduated rates, then business income added on top; 8% option available only for the business portion. Section 24(B) — Passive income: (1) Interest from Philippine currency deposits — 20% FWT; (2) Interest from foreign currency deposits — 15% FWT; (3) Royalties — 20% FWT (10% for books and literary works); (4) Prizes exceeding PHP 10,000 — 20% FWT; (5) PCSO/lotto winnings exceeding PHP 10,000 — 20% FWT; (6) Dividends from domestic corporations — 10% FWT."
    },
    {
      "title": "Section 25 - Tax on Nonresident Aliens",
      "content": "Section 25 NIRC: (A) Nonresident Alien Engaged in Trade/Business (NRAETB) — taxed at the same graduated rates as resident individuals on income from Philippine sources. Subject to 25% FWT on certain passive income. (B) Nonresident Alien Not Engaged in Trade/Business (NRANETB) — taxed at 25% flat rate on gross income from Philippine sources. Not entitled to deductions. Exceptions: (1) Subject to tax on capital gains from sale of shares; (2) Interest income from deposits — exempt; (3) Dividends from domestic corporations — 25% FWT. (C) Alien individuals employed by: (a) Regional or area headquarters of multinational companies — 15% flat rate on gross income; (b) Offshore banking units — 15% flat rate; (c) Petroleum service contractors — 15% flat rate. Special rules for determining residence: an alien who stays in the Philippines for an aggregate period of more than 180 days during any calendar year is considered a resident alien. Tax treaties may modify these rates — the Philippines has double taxation agreements with over 40 countries."
    },
    {
      "title": "Section 27 - Corporate Income Tax Rates (Domestic Corporations)",
      "content": "Section 27 NIRC as amended by CREATE/CREATE MORE: (A) In general: domestic corporations shall be taxed at 25% of taxable income from all sources. (B) Reduced rate: 20% for domestic corporations with net taxable income not exceeding PHP 5,000,000 AND total assets not exceeding PHP 100,000,000 (excluding land). (C) Minimum Corporate Income Tax (MCIT): 1% of gross income, applicable starting from the 4th taxable year. If MCIT > RCIT, pay MCIT. Excess MCIT is creditable against RCIT for 3 succeeding years. (D) Improperly Accumulated Earnings Tax (IAET) — REPEALED by CREATE Act. Previously 10% on improperly accumulated taxable income. (E) Special corporations: (1) Proprietary educational institutions and non-profit hospitals — 1% (under CREATE, subject to sunset); (2) GOCCs, agencies, and instrumentalities — 25%; (3) Taxable cooperatives — 25%; (4) Domestic corporations with BOI/PEZA registration — subject to incentive rates per CREATE fiscal incentives regime."
    },
    {
      "title": "Section 28 - Tax on Foreign Corporations",
      "content": "Section 28 NIRC as amended by CREATE: (A) Resident Foreign Corporations — taxed at 25% on taxable income from Philippine sources. Same MCIT rules apply. Branch profit remittance tax: 15% on profits remitted to the head office (reduced from 15% by some tax treaties to 10%). (B) Nonresident Foreign Corporations — taxed at 25% on gross income from Philippine sources (no deductions allowed). Special rates: (1) International carriers — 2.5% on Gross Philippine Billings; (2) Nonresident cinematographic film owners/lessors — 25% on gross income; (3) Nonresident lessor of vessels — 4.5% of gross rentals/charter fees; (4) Nonresident lessor of aircraft/machinery — 7.5% of gross rentals. (C) Tax on certain income received by nonresident foreign corporations: (1) Interest on foreign loans — 20% FWT; (2) Dividends from domestic corporations — 15% FWT (or as provided by tax treaties, as low as 10%); (3) Capital gains from sale of shares not listed — 15% CGT. Tax treaty provisions may reduce these rates. Withholding agent must apply the correct treaty rate and file BIR Form 1601-FQ."
    },
    {
      "title": "Allowable Deductions (Sections 34-35)",
      "content": "Section 34 NIRC — Allowable Deductions from gross income for computing taxable income: (A) Business expenses — ordinary and necessary expenses paid or incurred during the taxable year, including: (1) Salaries, wages, and other forms of compensation; (2) Travel expenses; (3) Rentals; (4) Entertainment, amusement, recreation (subject to ceiling of 0.50% of net revenue for sellers of goods, 1% for sellers of services); (B) Interest on indebtedness — deductible amount reduced by 20% of interest income subjected to FWT; (C) Taxes — all taxes paid or incurred except income tax, estate tax, donor's tax, VAT, and final withholding taxes; (D) Losses — actually sustained, not compensated by insurance, including: (1) Net operating loss carryover (NOLCO) — deductible for 3 succeeding years; (2) Under CREATE MORE, NOLCO from 2020-2023 may be carried over for 5 years; (E) Bad debts — debts actually ascertained to be worthless; (F) Depreciation — using straight-line, declining balance, or sum-of-years-digits method; (G) Charitable contributions — deductible in full if to the government or accredited NGOs, otherwise limited to 5% (individuals) or 5% (corporations) of taxable income. Section 34(L) — Optional Standard Deduction (OSD): 40% of gross sales/receipts (individuals) or 40% of gross income (corporations) in lieu of itemized deductions."
    },
    {
      "title": "Capital Gains Tax (Sections 24(C), 24(D), 27(D)(5))",
      "content": "Capital Gains Tax (CGT) under NIRC as amended: (1) Sale of shares of stock NOT listed on the stock exchange — 15% of net capital gain (Section 24(C) for individuals, Section 27(D)(5) for corporations). Net capital gain = selling price minus cost/basis of shares minus expenses of sale. Filed via BIR Form 1707 within 30 days of transaction, plus annual return. (2) Sale of real property classified as capital asset — 6% of gross selling price, or zonal value, or fair market value, whichever is higher (Section 24(D)). Filed via BIR Form 1706 within 30 days. Capital asset: property not used in trade or business, or not forming part of inventory. (3) Sale of shares LISTED on the stock exchange — not subject to CGT but to Stock Transaction Tax (STT) of 6/10 of 1% of gross selling price (Section 127). (4) Sale of principal residence by individuals — exempt from CGT if the proceeds are fully utilized for new principal residence within 18 months. The exemption can be availed once every 10 years. An escrow deposit or bond may be required if the new property is not yet acquired."
    },
    {
      "title": "Tax on Passive Income (Final Withholding Taxes)",
      "content": "Final Withholding Tax (FWT) on passive income — taxes are final, not creditable: (1) Interest on Philippine peso bank deposits and deposit substitutes — 20%; (2) Interest on FCDU deposits — 15%; (3) Interest on long-term deposits (5 years+) — exempt, but early pre-termination: 5% if held 4-5 years, 12% if held 3-4 years, 20% if held less than 3 years; (4) Royalties — 20% (10% for books, literary works, musical compositions); (5) Dividends received by individuals from domestic corporations — 10%; (6) Dividends received by domestic corporations from another domestic corporation — exempt; (7) Dividends received by nonresident foreign corporations — 15% (or treaty rate); (8) Prizes exceeding PHP 10,000 — 20%; (9) Winnings from PCSO/lotto exceeding PHP 10,000 — 20% (previously exempt); (10) Interest income of foreign currency borrowings — various rates. The withholding agent (bank, corporation, etc.) deducts the FWT at source and remits to BIR. The payee receives the net amount and reports the gross for information but does not claim the FWT as credit."
    },
    {
      "title": "Fringe Benefits Tax (Section 33)",
      "content": "Section 33 NIRC — Fringe Benefits Tax (FBT): A final tax imposed on the grossed-up monetary value of fringe benefits furnished to managerial or supervisory employees. FBT rate: 35% of the grossed-up value. Grossing-up formula: monetary value / 65% x 35%. FBT is paid by the employer on a quarterly basis via BIR Form 1603. Taxable fringe benefits include: (1) Housing benefits (employer-owned/leased); (2) Expense accounts; (3) Vehicle of any kind; (4) Household expenses (domestic help, groceries, laundry for the employee's personal benefit); (5) Interest on loans at below-market rate; (6) Membership fees in social and athletic clubs; (7) Foreign travel expenses borne by the employer; (8) Holiday and vacation expenses; (9) Educational assistance not related to the employer's business. Exempt fringe benefits: (a) Those required by the nature of the business; (b) For the convenience of the employer; (c) Authorized under a CBA; (d) Benefits enjoyed by rank-and-file employees; (e) De minimis benefits; (f) Contributions to retirement, insurance, and hospitalization under existing law."
    },
    {
      "title": "Net Operating Loss Carryover (NOLCO) and MCIT",
      "content": "Net Operating Loss Carryover (NOLCO) — Section 34(D)(3) NIRC: If a business incurs a net operating loss during a taxable year, it may carry over the loss and deduct it from taxable income for the next 3 succeeding taxable years. Under CREATE Act, NOLCO incurred during taxable years 2020, 2021, 2022, and 2023 may be carried over for 5 years (instead of 3) as pandemic relief. NOLCO cannot be used simultaneously with OSD — if the taxpayer uses OSD, NOLCO cannot be deducted. Minimum Corporate Income Tax (MCIT) — Section 27(E)(2): (1) Rate: 1% of gross income (permanently reduced from 2% by CREATE MORE); (2) Applicable from the 4th taxable year from commencement of business operations; (3) Paid when MCIT exceeds RCIT; (4) Excess MCIT (MCIT paid minus RCIT computed) can be carried forward and credited against RCIT for 3 succeeding years; (5) The CIR may suspend MCIT for a specific taxable year if the corporation suffers losses due to: prolonged labor dispute, force majeure, or legitimate business reverses. Application must be filed within 30 days from the relevant quarter."
    }
  ]
}
