{
  "category": "vat",
  "source": "NIRC Title IV - Value-Added Tax (Sections 105-115)",
  "chunks": [
    {
      "title": "Section 105 - Persons Liable for VAT",
      "content": "Section 105 of the NIRC (as amended by TRAIN Law RA 10963): Any person who, in the course of trade or business, sells, barters, exchanges, leases goods or properties, renders services, and any person who imports goods shall be subject to VAT at 12%. The phrase 'in the course of trade or business' means the regular conduct or pursuit of a commercial or economic activity, including transactions incidental thereto, by any person regardless of whether the person engaged therein is a non-stock, nonprofit organization or government entity. The rule of regularity, to the contrary notwithstanding, services rendered in the Philippines by nonresident foreign persons shall be considered as being rendered in the course of trade or business."
    },
    {
      "title": "Section 106 - VAT on Sale of Goods or Properties",
      "content": "Section 106 NIRC: VAT at 12% applies to every sale, barter, or exchange of goods or properties. 'Goods or properties' includes real properties held primarily for sale to customers or held for lease in the ordinary course of trade or business, the right or privilege to use patent, copyright, design or model, plan, secret formula or process, goodwill, trademark, trade brand or other like property or right, the right or privilege to use industrial, commercial, or scientific equipment, motion picture films, tapes, and discs, and radio, television, satellite transmission, and cable television time. The term also includes electricity, gas, steam, and water. The sale of real property is subject to VAT if the seller is a real estate dealer or developer. Transactions deemed sale: (a) transfer, use, or consumption not in the course of business of goods originally intended for sale or use in business; (b) distribution or transfer to shareholders or investors as share in profits; (c) consignment of goods if actual sale is not made within 60 days; (d) retirement from or cessation of business with respect to all goods on hand."
    },
    {
      "title": "Section 106(A)(2) - Zero-Rated Sales of Goods",
      "content": "Section 106(A)(2) NIRC as amended: The following sales by VAT-registered persons shall be subject to 0% rate: (a) Export sales — the sale and actual shipment of goods from the Philippines to a foreign country, irrespective of any shipping arrangement; (b) Sale of raw materials or packaging materials to a non-resident buyer for delivery to a resident local export-oriented enterprise; (c) Sale of raw materials or packaging materials to export-oriented enterprise whose export sales exceed 70% of total annual production; (d) Sale of gold to the Bangko Sentral ng Pilipinas (BSP); (e) Those considered export sales under the Omnibus Investments Code of 1987 and other special laws; (f) The sale of goods, supplies, equipment and fuel to persons engaged in international shipping or international air transport operations, provided the goods are exclusively used for international shipping or air transport. Under TRAIN Law, effective January 1, 2018, previously zero-rated sales of goods or properties to PEZA-registered or ecozones-registered enterprises are now subject to 12% VAT unless the enterprise elects the 5% gross income tax incentive."
    },
    {
      "title": "Section 108 - VAT on Sale of Services and Use of Properties",
      "content": "Section 108 NIRC: VAT at 12% applies to the sale or exchange of services, including the use or lease of properties. 'Sale or exchange of services' means the performance of all kinds of services in the Philippines for others for a fee, remuneration or consideration, including: professional services, services of customs, real estate, stock, immigration and commercial brokers, lessors of property (personal/real), warehousing, construction/service contractors, franchise grantees, common carriers, non-life insurance companies, similar services regardless of designation. Also includes: (a) lease of property; (b) service contracts between the government and any private entity; (c) supply of electric power by generation, transmission, and distribution companies; (d) sale of electricity by generation companies, transmission, and distribution companies. The term also covers the supply of importation of digital services consumed in the Philippines."
    },
    {
      "title": "Section 108(B) - Zero-Rated Sale of Services",
      "content": "Section 108(B) NIRC as amended by TRAIN: The following services performed in the Philippines by VAT-registered persons shall be subject to 0% rate: (1) Processing, manufacturing or repacking goods for other persons doing business outside the Philippines, which goods are subsequently exported, provided said services are paid for in acceptable foreign currency and accounted for under BSP rules; (2) Services other than those mentioned above rendered to a person engaged in business conducted outside the Philippines or to a nonresident person not engaged in business who is outside the Philippines when the services are performed, provided payment is in acceptable foreign currency accounted for under BSP rules; (3) Services rendered to persons or entities whose exemption under special laws effectively subjects the supply of such services to 0% rate; (4) Transport of passengers and cargo by domestic air or sea carriers from the Philippines to a foreign country; (5) Sale of power or fuel generated through renewable energy sources."
    },
    {
      "title": "Section 109 - VAT-Exempt Transactions (Part 1)",
      "content": "Section 109 NIRC as amended by TRAIN Law — VAT-exempt transactions include: (A) Sale or importation of agricultural and marine food products in their original state, livestock and poultry of a kind generally used as human food or yielding products ordinarily used as human food; (B) Sale or importation of fertilizers, seeds, seedlings, fingerlings, fish, prawn, livestock and poultry feeds, including ingredients whether locally produced or imported; (C) Importation of personal and household effects belonging to residents returning from abroad and nonresident citizens coming to resettle in the Philippines; (D) Importation of professional instruments and implements, wearing apparel, domestic animals, and personal household effects belonging to persons coming to settle in the Philippines for the first time; (E) Services subject to percentage tax under Title V; (F) Services by agricultural contract growers and milling for others of palay into rice, corn into grits, and sugar cane into raw sugar."
    },
    {
      "title": "Section 109 - VAT-Exempt Transactions (Part 2)",
      "content": "Section 109 NIRC continued: (G) Medical, dental, hospital and veterinary services except those rendered by professionals; (H) Educational services rendered by private educational institutions duly accredited by CHED, DepEd, and TESDA; (I) Services rendered by individuals pursuant to an employer-employee relationship; (J) Services rendered by regional or area headquarters established in the Philippines by multinational corporations which act as supervisory, communications, and coordinating centers for their affiliates; (K) Transactions which are exempt under international agreements; (L) Sales by agricultural cooperatives duly registered and in good standing with the CDA to their members, as well as sale of their produce; (M) Gross receipts from lending activities by credit or multi-purpose cooperatives duly registered with CDA; (N) Sales by non-agricultural, non-electric, and non-credit cooperatives with accumulated reserves and undivided net savings not exceeding PHP 10,000,000."
    },
    {
      "title": "Section 109 - VAT-Exempt Transactions (Part 3)",
      "content": "Section 109 NIRC continued: (O) Export sales by persons who are not VAT-registered; (P) Sale of real properties not primarily held for sale to customers or held for lease in the ordinary course of trade or business; sale of real properties utilized for low-cost housing (not exceeding PHP 750,000) and socialized housing (not exceeding PHP 580,000 under RA 7279); sale of residential lot valued at not more than PHP 1,919,500; and sale of house and lot and other residential dwellings valued at not more than PHP 3,199,200 (adjusted amounts per RR 13-2018); (Q) Lease of residential unit with monthly rental not exceeding PHP 15,000; (R) Sale, importation, printing, or publication of books and any newspaper, magazine, review, or bulletin which appears at regular intervals with fixed prices for subscription and sale; (S) Transport of passengers by international carriers; (T) Sale, importation, or lease of passenger or cargo vessels and aircraft, including engine, equipment and spare parts thereof for domestic or international transport operations; (U) Importation of fuel, goods, and supplies by persons engaged in international shipping or air transport; (V) Services of banks, non-bank financial intermediaries performing quasi-banking functions, and other non-bank financial intermediaries; (W) Sale or lease of goods or properties or services to senior citizens and persons with disability (PWD) as provided under RA 9994 and RA 7277."
    },
    {
      "title": "Section 110 - Tax Credits (Input VAT)",
      "content": "Section 110 NIRC: (A) Creditable Input Tax — (1) Any input tax evidenced by a VAT invoice or official receipt issued by a VAT-registered person; (2) Transitional input tax credits — persons who become liable to VAT or any person who elects to be a VAT-registered person shall be allowed input tax on his beginning inventory of goods, materials and supplies equivalent to 2% of the value of such inventory; (3) A VAT-registered person may apply for a TIN of his beginning inventory of goods; (4) Input tax on a depreciable capital good shall be spread evenly over the month of acquisition and the 59 succeeding months if the aggregate acquisition cost for such capital goods (excluding VAT) exceeds PHP 1,000,000 during any 12-month period. If below PHP 1M, input VAT is allowed in the month of acquisition. (B) Excess Output or Input Tax — if output tax exceeds input tax, the excess shall be paid by the VAT-registered person. If input tax exceeds output tax, the excess shall be carried over to the succeeding quarter. In case of zero-rated or effectively zero-rated sales, any excess input tax may be refunded or issued a tax credit certificate within 2 years (Section 112)."
    },
    {
      "title": "Section 112 - Refunds or Tax Credits of Input Tax",
      "content": "Section 112 NIRC as amended: (A) Zero-Rated or Effectively Zero-Rated Sales — Any VAT-registered person whose sales are zero-rated or effectively zero-rated may apply for the issuance of a tax credit certificate or refund of creditable input tax within 2 years after the close of the taxable quarter when the sales were made. (B) Cancellation of VAT Registration — A person whose registration has been cancelled due to retirement or cessation of business may apply for refund within 2 years from the date of cancellation. (C) Period within which refund shall be made — The CIR shall grant a refund or issue the tax credit certificate within 90 days from filing of complete documents. In case of full or partial denial, the taxpayer may appeal to the CTA within 30 days from receipt of denial or from expiration of the 90-day period. (D) Manner of giving refund — Refunds shall be made upon verification by the CIR or his authorized representative. The CIR may, in lieu of refund, issue a tax credit certificate which may be used in payment of internal revenue taxes."
    },
    {
      "title": "Section 113 - Invoicing and Accounting Requirements",
      "content": "Section 113 NIRC: (A) Invoicing Requirements — A VAT-registered person shall issue: (1) a VAT invoice for every sale, barter or exchange of goods or properties; (2) a VAT official receipt for every sale, barter or exchange of services and for every lease of goods or properties. All invoices/receipts shall show: (a) a header reading 'VAT Invoice' or 'VAT Official Receipt'; (b) BIR permit to use or Authority to Print (ATP); (c) TIN followed by the word 'VAT'; (d) total amount (with VAT component shown separately); (e) date of transaction; (f) quantity, unit cost, and description of goods/services; (g) name, business name, TIN, and address of the purchaser/client for sales over PHP 1,000. (B) Accounting Requirements — VAT-registered persons must maintain: a subsidiary sales journal (for output tax) and a subsidiary purchase journal (for input tax). Non-compliance leads to: (1) 25% surcharge; (2) disallowance of input VAT claims by the buyer."
    },
    {
      "title": "Section 114 - Return and Payment of VAT",
      "content": "Section 114 NIRC: (A) In General — Every person liable for VAT shall file a quarterly return of the amount of gross sales or receipts within 25 days following the close of each taxable quarter. VAT-registered persons shall pay the VAT on a monthly basis using a monthly VAT declaration (BIR Form 2550M), due within 20 days following the close of each taxable month. For the month ending the taxable quarter, the quarterly return (BIR Form 2550Q) is filed instead. (B) Where to File — Returns shall be filed with and the tax paid to: (1) an authorized agent bank; (2) Revenue Collection Officer; (3) duly authorized city or municipal treasurer. (C) Withholding of VAT — The government or any of its political subdivisions shall, before making payment for goods or services subject to VAT, deduct and withhold 5% of the gross payment (12% effective pending IRR). (D) Electronic Filing — Large taxpayers and top corporations are mandated to file electronically via the Electronic Filing and Payment System (eFPS)."
    },
    {
      "title": "Section 115 - Power of the Commissioner to Suspend Business Operations",
      "content": "Section 115 NIRC: The CIR or his authorized representative may temporarily close or suspend the business operations of any person for: (a) Failure to issue receipts or invoices — the first offense results in a 5-day suspension; (b) Failure to file a VAT return within the time prescribed — results in temporary suspension until compliance; (c) Understatement of taxable sales or receipts by 30% or more — results in temporary closure; (d) Failure to register — business shall be closed until proper registration is obtained. The temporary closure shall be for not less than 5 days and shall be lifted only upon compliance with the requirements of the law. The CIR may also impose a fine of not less than PHP 5,000 but not more than PHP 50,000 and imprisonment of not less than 2 years but not more than 4 years for violations."
    }
  ]
}
