{
  "category": "payroll",
  "source": "Payroll Withholding Tax and BIR Form 1601-C Detailed Guide",
  "chunks": [
    {
      "title": "Compensation Income Tax Withholding Overview (Section 79 NIRC)",
      "content": "Under Section 79 of the National Internal Revenue Code (NIRC), every employer making payment of compensation to an employee is required to deduct and withhold a tax on such compensation. This is the withholding tax on compensation (WTC), which serves as an advance payment of the employee's income tax liability. The employer acts as the withholding agent and is personally liable for the tax required to be withheld. The amount to be withheld is determined using the BIR withholding tax tables, which are based on the graduated income tax rates under Section 24(A)(2) of the NIRC as amended by the TRAIN Law (RA 10963) and further adjusted by subsequent legislation. The withholding tax system is designed so that the cumulative amount withheld throughout the year approximates the employee's annual income tax liability, minimizing or eliminating the need for the employee to file a separate income tax return (for purely compensation income earners with a single employer). Employers must register as withholding agents with the BIR (BIR Form 1903 or 1905) and must issue BIR Form 2316 (Certificate of Compensation Payment/Tax Withheld) to each employee on or before January 31 of the following year."
    },
    {
      "title": "Withholding Tax on Compensation Table — TRAIN Law 2023+ Graduated Rates",
      "content": "The graduated income tax rates for compensation income, effective January 1, 2023 onwards (as amended by TRAIN Law RA 10963), are as follows: (1) Not over PHP 250,000 annually — 0% (exempt); (2) Over PHP 250,000 but not over PHP 400,000 — 15% of excess over PHP 250,000; (3) Over PHP 400,000 but not over PHP 800,000 — PHP 22,500 + 20% of excess over PHP 400,000; (4) Over PHP 800,000 but not over PHP 2,000,000 — PHP 102,500 + 25% of excess over PHP 800,000; (5) Over PHP 2,000,000 but not over PHP 8,000,000 — PHP 402,500 + 30% of excess over PHP 2,000,000; (6) Over PHP 8,000,000 — PHP 2,202,500 + 35% of excess over PHP 8,000,000. For withholding purposes, these annual rates are converted to monthly, semi-monthly, weekly, or daily equivalents using BIR Annex B/C tables. The employer computes taxable compensation by taking gross compensation minus: (a) non-taxable benefits (13th month pay and other benefits up to PHP 90,000), (b) mandatory employee contributions (SSS, PhilHealth, Pag-IBIG), (c) union dues, and (d) any other exempt items. The withholding is applied on the net taxable compensation per pay period using the cumulative averaging method."
    },
    {
      "title": "Monthly Remittance via BIR Form 1601-C — Deadline and Procedures",
      "content": "BIR Form 1601-C (Monthly Remittance Return of Income Taxes Withheld on Compensation) is filed monthly by every employer who withholds tax from employee compensation. The return, together with payment, must be filed on or before the 10th day of the month following the month in which the withholding was made. For example, taxes withheld in January are due on or before February 10. If the 10th falls on a weekend or holiday, the deadline is extended to the next business day. Large taxpayers must file via eFPS (Electronic Filing and Payment System). Non-large taxpayers may file via eBIRForms and pay through Authorized Agent Banks (AABs), GCash, PayMaya, or other BIR-authorized payment channels. The 1601-C reports: (a) total compensation paid during the month, (b) total non-taxable/exempt compensation, (c) total taxable compensation, (d) total taxes withheld, and (e) any adjustments. A 'nil' return must be filed even if no compensation was paid during the month (though some RDOs accept a sworn declaration instead). The employer must keep records of all 1601-C filings for 10 years under Section 235 of the NIRC."
    },
    {
      "title": "Quarterly Return BIR 1601-EQ and Annualized Withholding",
      "content": "BIR Form 1601-EQ (Quarterly Remittance Return of Creditable Income Taxes Withheld — Expanded) covers withholding taxes on payments other than compensation, such as professional fees, rentals, and other income payments subject to expanded withholding tax (EWT). While 1601-C covers compensation withholding monthly, employers who also make EWT payments must file 1601-EQ quarterly (due 25 days after each quarter). For compensation specifically, the annualized withholding tax method is used at year-end: the employer computes the employee's annual taxable compensation, applies the graduated tax table, and compares the result to total taxes already withheld during the year. If under-withheld, the employer collects the deficiency from the employee's December pay. If over-withheld, the employer refunds the excess to the employee. This year-end adjustment (YEA) is mandatory and must be completed by January 15 of the following year. The YEA result is reflected in the December 1601-C filing (or a separate adjusting entry). Employers with substituted filing privileges (where employees have only one employer) are deemed to have filed the employee's annual income tax return upon filing the 1601-C and issuing the 2316."
    },
    {
      "title": "Year-End Adjustment and BIR Form 2316 (Certificate of Compensation)",
      "content": "BIR Form 2316 (Certificate of Compensation Payment/Tax Withheld) is the Philippine equivalent of the W-2 form. Every employer must issue Form 2316 to each employee on or before January 31 of the following year (or within 30 days after termination of employment, if applicable). The 2316 shows: (1) total compensation income (gross), (2) non-taxable income items (13th month pay, de minimis benefits, SSS/PhilHealth/Pag-IBIG employee share, union dues), (3) taxable compensation income, (4) income tax due based on the graduated rates, (5) total taxes withheld during the year, and (6) over-withholding or under-withholding adjustment. For employees with a single employer and no other income sources, the 2316 serves as the employee's income tax return under the substituted filing system (RR 2-1998 as amended). These employees are no longer required to file BIR Form 1700. However, employees who have two or more employers during the year, or who have additional income (business/professional), must file their own annual ITR (Form 1700 or 1700A). The employer must provide two copies of 2316 to the employee and submit a copy to the BIR along with the annual information return (Form 1604-CF)."
    },
    {
      "title": "Annual Information Return BIR Form 1604-CF — Deadline January 31",
      "content": "BIR Form 1604-CF (Annual Information Return of Income Taxes Withheld on Compensation and Final Withholding Taxes) is the employer's annual summary return of all compensation paid and taxes withheld during the calendar year. The filing deadline is January 31 of the following year. The 1604-CF must be accompanied by: (1) an alphabetical list of all employees showing each employee's TIN, name, total compensation, taxable compensation, and tax withheld (using the prescribed CSV format for electronic submission); (2) copies of all BIR Forms 2316 issued; and (3) a reconciliation showing total taxes withheld per monthly 1601-C filings versus total per the 2316 certificates. Discrepancies between the sum of monthly 1601-C remittances and the 1604-CF totals will trigger a BIR discrepancy notice. The 1604-CF is filed electronically via eFPS (mandatory for large taxpayers) or eBIRForms. Failure to file the 1604-CF on time is subject to: (a) compromise penalty of PHP 1,000 per return, (b) 25% surcharge on any deficiency, and (c) 12% annual interest. Additionally, failure to issue 2316 certificates may result in a penalty of PHP 50 per certificate (up to PHP 100,000 per year) under the TRAIN Law."
    },
    {
      "title": "De Minimis Benefits Exemption — Updated 2025 List (RR 4-2025)",
      "content": "De minimis benefits are facilities or privileges of relatively small value furnished by the employer to the employee as a means of promoting health, goodwill, contentment, or efficiency. Under Revenue Regulations No. 4-2025 (amending RR 2-1998 and RR 11-2018), the updated de minimis benefit ceilings effective 2025 are: (1) Monetized unused vacation leave credits — not exceeding 12 days per year (for private sector employees); (2) Medical cash allowance to dependents of employees — not exceeding PHP 2,000 per semester or PHP 333.33 per month; (3) Rice subsidy — PHP 4,000 per month or 1 sack of 50-kg rice per month; (4) Uniform and clothing allowance — not exceeding PHP 7,000 per annum; (5) Actual medical assistance — not exceeding PHP 10,000 per annum; (6) Laundry allowance — not exceeding PHP 450 per month; (7) Employees' achievement awards (length of service/safety) — not exceeding PHP 10,000 per annum, in the form of tangible property other than cash; (8) Gifts during Christmas and major anniversary celebrations — not exceeding PHP 5,000 per employee per annum; (9) Daily meal allowance for overtime work — not exceeding 25% of basic minimum wage; (10) Benefits under a CBA (Collective Bargaining Agreement) — not exceeding PHP 12,000 per year. Any excess over the prescribed ceiling is taxable as compensation income. The aggregate amount of de minimis benefits that exceeds the ceiling is added to the PHP 90,000 threshold for 13th month pay and other benefits."
    },
    {
      "title": "13th Month Pay and Other Benefits — PHP 90,000 Threshold",
      "content": "Under the TRAIN Law (effective 2018 onwards), the combined total of 13th month pay and other benefits received by an employee is exempt from income tax up to PHP 90,000 per calendar year. This threshold covers: (1) 13th month pay (mandatory under PD 851 — computed as total basic salary earned during the year divided by 12); (2) Christmas bonus, productivity incentive bonus, loyalty awards, and similar payments; (3) Other benefits not classified as de minimis that are given by the employer. The PHP 90,000 exemption is computed as follows: Total 13th month pay + other benefits + excess de minimis benefits (amount exceeding individual de minimis ceilings). If the aggregate does not exceed PHP 90,000, the entire amount is non-taxable. If the aggregate exceeds PHP 90,000, only the excess over PHP 90,000 is added to taxable compensation income. Important notes: (a) the 13th month pay is mandatory for all rank-and-file employees regardless of employment status or amount of salary; (b) managerial employees are not entitled to mandatory 13th month pay under PD 851 but may receive it as a company policy; (c) the PHP 90,000 threshold is a collective limit — all qualifying benefits are aggregated."
    },
    {
      "title": "Non-Taxable Income Items for Compensation Earners",
      "content": "The following items are excluded from taxable compensation income: (1) Mandatory employee contributions: SSS contributions (employee share), PhilHealth contributions (employee share), and Pag-IBIG/HDMF contributions (employee share) — these are deducted from gross compensation before applying withholding tax; (2) 13th month pay and other benefits up to the PHP 90,000 statutory limit; (3) De minimis benefits within the prescribed ceilings under RR 4-2025; (4) Hazard pay of government personnel stationed in strife-torn or calamity-stricken areas; (5) DOLE-mandated benefits such as separation pay due to authorized causes (retrenchment, redundancy, closure not due to serious business losses) — per Section 32(B)(6)(b) of the NIRC; (6) Retirement benefits received under RA 7641 (Retirement Pay Law) or a reasonable private benefit plan, provided the retiring employee is at least 50 years old and has served at least 10 years; (7) Benefits received from SSS (sickness, maternity, disability, retirement, death benefits); (8) Union dues paid by the employee. These exclusions must be properly documented and reflected in BIR Form 2316. Employers who erroneously include non-taxable items in the taxable compensation base will over-withhold, requiring year-end adjustment refunds."
    },
    {
      "title": "Penalties for Non-Remittance of Withholding Tax",
      "content": "Employers who fail to withhold or remit withholding taxes on compensation face severe penalties under the NIRC: (1) Civil penalties: 25% surcharge on the tax due for late filing/payment; 50% surcharge if the failure is due to fraud or willful neglect (Section 248); 12% annual interest from due date until full payment (Section 249, as amended by TRAIN Law from 20% to 12%); compromise penalty per RMO 7-2015 ranging from PHP 200 to PHP 50,000 depending on the deficiency amount. (2) Criminal penalties under Section 255: any employer who willfully fails to withhold or remit the correct amount of tax shall, upon conviction, be punished by a fine of not less than PHP 10,000 and not more than PHP 100,000 and imprisonment of not less than 1 year but not more than 10 years. (3) Under Section 253, failure to make a return, supply correct information, or remit taxes withheld is a criminal offense. The responsible officer (president, general manager, treasurer, or equivalent) can be held personally liable. (4) The BIR may also issue a Warrant of Distraint and/or Levy (WDL) to seize the employer's assets to satisfy the tax deficiency. (5) Tax amnesty programs (like RA 11213, Tax Amnesty Act) have historically offered relief for past delinquencies, but these are time-limited. Employers should prioritize timely remittance to avoid compounding penalties."
    }
  ]
}
