{
  "category": "general",
  "source": "Percentage Tax — NIRC Title V, Sections 116-127 Detailed Guide",
  "chunks": [
    {
      "title": "Section 116 — 3% Percentage Tax on Non-VAT Persons",
      "content": "Section 116 of the NIRC imposes a 3% percentage tax on every person who sells or leases goods, properties, or services and is not VAT-registered, based on quarterly gross sales or receipts. This applies to taxpayers whose annual gross sales or receipts do not exceed the VAT threshold of PHP 3,000,000. The percentage tax is filed using BIR Form 2551Q on a quarterly basis, due within 25 days after the close of each taxable quarter (i.e., April 25, July 25, October 25, and January 25 of the following year). The tax base is gross sales for sellers of goods, and gross receipts for sellers of services. Gross sales/receipts include all amounts received or receivable in exchange for goods or services, net of returns and allowances but before any deductions for cost of goods or expenses. Taxpayers who are subject to the 3% percentage tax are NOT required to issue VAT invoices/receipts but must still issue non-VAT official receipts and sales invoices duly registered with the BIR. Mixed taxpayers (those with both VAT and non-VAT activities) must segregate their transactions. The 3% percentage tax was temporarily reduced to 1% from July 1, 2020 to June 30, 2023 under the Bayanihan Acts and subsequent extensions, but has reverted to 3% effective July 1, 2023."
    },
    {
      "title": "VAT Threshold and Registration Requirements",
      "content": "The mandatory VAT registration threshold is PHP 3,000,000 in annual gross sales or receipts. Taxpayers whose gross sales or receipts exceed this threshold are required to register as VAT taxpayers and are no longer eligible for the 3% percentage tax. Taxpayers below the threshold have the option to voluntarily register for VAT, which may be advantageous if they have significant input VAT to claim. Once registered for VAT (whether mandatory or voluntary), a taxpayer cannot revert to non-VAT/percentage tax status for at least three (3) years from the date of VAT registration. Exceeding the threshold during any quarter triggers mandatory VAT registration effective the following month. The PHP 3M threshold is evaluated on a per-taxpayer basis, not per branch or business line. Professionals and self-employed individuals have an additional option: the 8% flat income tax rate, which is computed on gross sales/receipts exceeding PHP 250,000, in lieu of both the graduated income tax rates AND the 3% percentage tax. This election must be made on the first quarterly income tax return or the BIR Form 1901/1905 at the beginning of the year and is irrevocable for the taxable year."
    },
    {
      "title": "8% Flat Tax Option for Self-Employed Individuals",
      "content": "Under the TRAIN Law (RA 10963), self-employed individuals and professionals with gross sales/receipts not exceeding the PHP 3,000,000 VAT threshold may elect to pay an 8% flat tax on gross sales or receipts in excess of PHP 250,000, in lieu of: (1) the graduated income tax rates (0-35%); and (2) the 3% percentage tax under Section 116. This effectively simplifies tax compliance by consolidating two taxes into one. The 8% flat tax is filed using BIR Form 1701A (annual) and BIR Form 1701Q (quarterly). The election must be signified on the taxpayer's first quarterly return (1701Q) or upon registration/update using BIR Form 1905. If no election is made, the taxpayer defaults to the graduated income tax rates plus 3% percentage tax. The 8% option is NOT available to: (1) VAT-registered taxpayers; (2) taxpayers subject to Other Percentage Taxes under Sections 117-127; (3) partners in a general professional partnership (the partnership itself is tax-exempt but partners are taxed individually); (4) individuals with both compensation and business income exceeding PHP 250,000. Taxpayers who exceed the PHP 3M threshold during the year must shift to VAT and graduated income tax rates for the entire year."
    },
    {
      "title": "Sections 117-119 — Carriers and Franchise Taxes",
      "content": "Section 117 imposes a 3% percentage tax on domestic carriers and keepers of garages for hire, based on their quarterly gross receipts. This covers land, water, and air carriers operating domestically, excluding those subject to VAT (i.e., those exceeding the PHP 3M threshold, who would be VAT-registered). Section 118 imposes a 3% percentage tax on international carriers (airlines and shipping companies) based on their gross receipts from transport of passengers and cargo originating from the Philippines. This is a final tax and applies regardless of whether the carrier is VAT-registered. Tax treaties may reduce or exempt this tax for carriers of treaty partner countries, subject to reciprocity and the filing of a tax treaty relief application (TTRA) with the BIR's International Tax Affairs Division (ITAD). Section 119 covers percentage taxes on franchises: (1) franchises on electric, gas, and water utilities are taxed at 2% of gross receipts; and (2) franchises on radio and/or television broadcasting companies whose annual gross receipts do not exceed PHP 10,000,000 are taxed at 3% of gross receipts (those exceeding PHP 10M are subject to VAT). These franchise taxes are in lieu of all other percentage taxes under Title V."
    },
    {
      "title": "Section 120-121 — Overseas Communication Tax and Banks/Financial Intermediaries (GRT)",
      "content": "Section 120 imposes a 10% Overseas Communication Tax on amounts paid for overseas telephone calls, messages, or other communications originating from the Philippines. The tax is collected by the telecommunications carrier and remitted to the BIR. This tax was historically significant but has become less relevant as most overseas communication now occurs via internet-based services. Section 121 imposes the Gross Receipts Tax (GRT) on banks and non-bank financial intermediaries performing quasi-banking functions. The GRT rates are: (1) 5% on interest, commissions, and discounts from lending activities, finance, and leasing on the basis of remaining maturities of instruments from which receipts were derived — specifically 5% for those with maturity of 5 years or less; (2) 1% for maturities exceeding 5 years; (3) 5% on dividends and equity shares in net income of subsidiaries; (4) 5% on royalties, rentals of real or personal property, and profit from exchange; (5) 7% on net trading gains on foreign currency, debt securities, derivatives, and similar financial instruments. The GRT is filed using BIR Form 2551Q. Banks and financial intermediaries subject to GRT are generally exempt from VAT on their core banking services, but may be subject to VAT on non-financial services such as safe deposit box rentals."
    },
    {
      "title": "Section 123 — Tax on Life Insurance Premiums",
      "content": "Section 123 of the NIRC imposes a percentage tax on life insurance premiums collected by every domestic or resident foreign insurance company. The rates are: (1) 5% on the total premium collected for each policy of group life insurance, life insurance covering industrial lives, or pre-need plans; and (2) 2% on the total premium collected for all other life insurance policies (individual life). The tax base is the total premium collected, whether paid in money, notes, credits, or substitutes. Exempt from this tax are: (1) reinsurance premiums (where one insurer cedes risk to another); (2) premiums refunded to policyholders within six months of payment; (3) variable unit-linked insurance policies to the extent that premiums are invested in the insurance fund (subject to VAT instead under certain BIR rulings). Non-life insurance companies are generally subject to VAT (if VAT-registered) or percentage tax on their premium collections rather than this specific Section 123 tax. The tax is filed using BIR Form 2551Q and is due quarterly. Insurance companies must maintain detailed records of premiums collected, categorized by policy type, to correctly apply the appropriate rate."
    },
    {
      "title": "Section 127 — Stock Transaction Tax (STT)",
      "content": "Section 127(A) of the NIRC imposes a Stock Transaction Tax (STT) of 6/10 of 1% (0.6%) on the gross selling price or gross value in money of shares of stock sold, bartered, exchanged, or otherwise disposed of through the local stock exchange (Philippine Stock Exchange, PSE). This tax is collected by the stockbroker and remitted to the BIR within five (5) banking days from the date of collection. The STT is a final tax — gains from the sale of listed shares traded through the PSE are not subject to capital gains tax or regular income tax. For shares sold outside the stock exchange (i.e., over-the-counter or private sales), a 15% final capital gains tax applies on net capital gains under Section 24(C). Section 127(B) imposes a percentage tax on Initial Public Offerings (IPOs) of shares: (1) 4% if the proportion of shares sold is up to 25% of outstanding shares; (2) 2% if the proportion is 25% to 33.33%; (3) 1% if the proportion exceeds 33.33%. This IPO tax is in addition to the regular STT. The STT is a significant revenue source and applies to both individual and institutional investors, including foreign investors trading Philippine-listed shares."
    },
    {
      "title": "Section 125 — Amusement Taxes",
      "content": "Section 125 of the NIRC imposes percentage taxes on certain amusement activities as follows: (1) 18% on gross receipts of boxing exhibitions and professional basketball games; (2) 15% on gross receipts of horse races, including winnings from betting (the racing club pays the tax on all receipts); (3) 10% on gross receipts of jai-alai and similar games; (4) 15% on cockpits; and (5) 18% on professional basketball games. These amusement taxes are national taxes imposed in addition to any local amusement taxes under the Local Government Code, subject to the aggregate ceiling. It is important to distinguish national amusement taxes under Section 125 from local amusement taxes imposed by LGUs under Section 140 of RA 7160. LGUs may impose amusement taxes on operators of theaters, cinemas, concert halls, circuses, and other places of amusement at a rate not exceeding 30% of gross receipts. The national and local amusement taxes apply to different activities and are not mutually exclusive. Operators must register with both the BIR (for national taxes) and the local treasurer's office (for local taxes) and file the appropriate returns."
    },
    {
      "title": "Filing Requirements and Deadlines for Percentage Taxes",
      "content": "The primary filing form for most percentage taxes is BIR Form 2551Q (Quarterly Percentage Tax Return), which consolidates reporting for Sections 116-127. Filing deadlines are within 25 days after the close of each taxable quarter: Q1 (Jan-Mar) due April 25; Q2 (Apr-Jun) due July 25; Q3 (Jul-Sep) due October 25; Q4 (Oct-Dec) due January 25 of the following year. Payment must accompany the return and can be made through Authorized Agent Banks (AABs), the eFPS (Electronic Filing and Payment System), or eBIRForms with bank payment. Large taxpayers and those mandated for eFPS must file electronically. Some percentage taxes have specific collection mechanisms: the STT (Section 127) is collected by the stockbroker and remitted within 5 banking days; the overseas communication tax (Section 120) is collected by the telecommunications company; and insurance premium taxes (Section 123) are remitted by the insurance company. Penalties for late filing include: 25% surcharge (or 50% for willful neglect), 12% annual interest, and compromise penalties per RMO 7-2015. Taxpayers transitioning between percentage tax and VAT must file BIR Form 1905 and ensure proper cutoff of transactions."
    },
    {
      "title": "Comparison of Percentage Tax vs VAT and Practical Considerations",
      "content": "The percentage tax regime under Sections 116-127 serves as an alternative to VAT for specific taxpayers and activities. Key practical considerations: (1) Percentage tax is simpler — it is a straightforward tax on gross sales/receipts with no input tax crediting mechanism, unlike VAT which allows crediting of input VAT against output VAT. (2) For businesses with significant purchases subject to VAT (e.g., capital-intensive operations), voluntary VAT registration may result in lower net tax liability due to input VAT credits. (3) For service-oriented businesses with minimal VAT-able purchases, the 3% percentage tax (or 8% flat tax option) may be more advantageous than 12% VAT. (4) Percentage tax payers cannot pass on the tax to buyers in the same explicit manner as VAT (no input tax credit for the buyer). (5) Mixed transactions: if a taxpayer has both VAT-able and percentage-tax-subject activities, proper segregation and accounting are mandatory. (6) Export sales: percentage tax payers cannot claim zero-rated VAT on exports, which makes VAT registration preferable for exporters. (7) The EOPT Act (RA 11976) introduced micro/small/medium/large taxpayer classifications that may affect compliance requirements and audit selection for percentage tax filers."
    }
  ]
}
