{
  "category": "incentives",
  "source": "PEZA/BOI/FIRB Fiscal Incentives Regime — CREATE and CREATE MORE Acts",
  "chunks": [
    {
      "title": "Investment Promotion Agencies (IPAs) in the Philippines",
      "content": "The Philippines has multiple Investment Promotion Agencies (IPAs) that administer fiscal and non-fiscal incentives for qualified enterprises: (1) PEZA (Philippine Economic Zone Authority) — governs ecozones (special economic zones, IT parks, manufacturing zones, agri-ecozones, tourism zones, medical tourism zones). PEZA is the largest IPA by number of registered enterprises; (2) BOI (Board of Investments) — registers enterprises in preferred areas of investment listed in the Investment Priorities Plan (IPP). BOI-registered enterprises can locate anywhere in the Philippines; (3) TIEZA (Tourism Infrastructure and Enterprise Zone Authority) — governs tourism enterprise zones; (4) CDC (Clark Development Corporation) — administers the Clark Special Economic Zone and Freeport in Pampanga; (5) SBMA (Subic Bay Metropolitan Authority) — administers the Subic Bay Freeport Zone in Zambales; (6) JHMC (John Hay Management Corporation) — governs the John Hay Special Economic Zone in Baguio; (7) AFAB (Authority of the Freeport Area of Bataan) — governs the Freeport Area of Bataan. Under the CREATE Law (RA 11534) and CREATE MORE Act (RA 12066), the Fiscal Incentives Review Board (FIRB) was given a central oversight role to rationalize incentives across all IPAs. The Strategic Investment Priority Plan (SIPP) replaced the BOI Investment Priorities Plan as the basis for granting incentives."
    },
    {
      "title": "FIRB — Fiscal Incentives Review Board Oversight",
      "content": "The Fiscal Incentives Review Board (FIRB) was established under the CREATE Law and enhanced under CREATE MORE to serve as the oversight body for all fiscal incentives granted by IPAs. FIRB composition: Secretary of Finance (Chair), Secretary of Trade and Industry, Secretary of Budget and Management, Director-General of NEDA, and the Commissioner of Internal Revenue. Key FIRB functions: (1) Approval authority for investment projects with incentives exceeding the threshold — projects with total investment capital of PHP 15 billion or more, or those granted incentives beyond the standard packages, require FIRB approval; (2) Review and approve requests for extension of incentive periods; (3) Monitor compliance of registered enterprises with the terms and conditions of their incentive grants; (4) Cancel or suspend incentives for non-compliant enterprises; (5) Issue rules and regulations on incentive administration; (6) Maintain a centralized database of all incentive beneficiaries (Cost-Benefit Analysis system). FIRB Resolution No. 29-2023 provides guidelines for the application and grant of fiscal incentives. The FIRB reviews each project based on: job creation, export potential, technology transfer, strategic importance, location (developed vs. less-developed areas), and overall economic contribution. For projects below the PHP 15B threshold, the IPA (PEZA, BOI, etc.) has direct approval authority, subject to FIRB oversight."
    },
    {
      "title": "Income Tax Holiday (ITH) — 4 to 7 Years",
      "content": "The Income Tax Holiday (ITH) is the most valuable fiscal incentive — it provides a 100% exemption from corporate income tax on income derived from the registered activity during the ITH period. Under the CREATE and CREATE MORE framework, the ITH period depends on the type and location of the project: (1) Export Enterprises — 4 to 7 years ITH. Domestic market enterprises may qualify for shorter ITH periods depending on the activity's tier in the SIPP; (2) Location-based incentives: projects located in less-developed areas outside Metro Manila, Metro Cebu, and Metro Davao may receive additional years of ITH; (3) SIPP Tier Classification: Tier I (activities highly desirable for economic development) gets maximum ITH, Tier II (important activities) gets moderate ITH, Tier III (other activities) gets the base ITH period; (4) Under CREATE MORE, the maximum ITH for export enterprises in less-developed areas was extended and the FIRB was given authority to grant additional ITH years for strategic projects. During the ITH period, the enterprise: (a) is exempt from CIT on registered activities; (b) is NOT exempt from VAT, withholding taxes, or local taxes (unless separately exempted); (c) must maintain separate books for registered and non-registered activities; (d) must comply with all IPA conditions (employment, export requirements, environmental standards). After the ITH expires, the enterprise transitions to either SCIT or EDR for the remaining incentive period."
    },
    {
      "title": "Special Corporate Income Tax (SCIT) — 5% on Gross Income Earned",
      "content": "The Special Corporate Income Tax (SCIT) at 5% on gross income earned is available as a post-ITH incentive for qualified registered enterprises under the CREATE framework. SCIT replaces the former 5% GIE (Gross Income Earned) regime that was available to PEZA enterprises. Key features of SCIT: (1) Rate: 5% of gross income earned (defined as gross sales or gross revenues less direct costs, but before deducting operating expenses). Under CREATE MORE, this rate remains at 5%; (2) 'In Lieu Of' Provision: the 5% SCIT is in lieu of all national and local taxes — this means the enterprise is exempt from CIT (25% regular rate), local business tax, real property tax (on machinery and equipment), and other national and local taxes; (3) Duration: the SCIT period is typically 10 years after ITH expiration, but the total incentive period (ITH + SCIT) is capped at 17-27 years depending on the project and location under CREATE MORE; (4) Limitation: enterprises under SCIT are VAT-exempt (not zero-rated). This means they cannot claim input VAT credit or refund. Under the original CREATE Law, local purchases by SCIT enterprises were VAT-exempt (not zero-rated), which created cascading issues for local suppliers. CREATE MORE addressed this by reinstating zero-rating for export enterprises' local purchases, but the zero-rating benefit applies primarily to EDR enterprises; (5) SCIT vs. EDR Choice: enterprises must elect between SCIT and EDR after ITH. The choice is irrevocable for the remaining incentive period."
    },
    {
      "title": "Enhanced Deductions Regime (EDR) — 20% CIT + Additional Deductions",
      "content": "The Enhanced Deductions Regime (EDR) is the alternative post-ITH incentive under CREATE MORE. Under EDR, the enterprise pays a reduced Corporate Income Tax (CIT) rate and enjoys additional deductions: (1) CIT Rate: 20% (reduced from the regular 25% CIT rate under CREATE; CREATE MORE maintained the 20% preferential rate for EDR enterprises); (2) Additional Deductions from Taxable Income: (a) 100% additional deduction on labor expense (50% for direct labor training expense, 100% for skills development training); (b) 200% additional deduction on R&D expenses conducted in the Philippines; 150% if R&D is conducted abroad but benefits Philippine operations (enhanced under CREATE MORE); (c) 100% additional deduction on power expenses for manufacturing activities (new under CREATE MORE); (d) 50% additional deduction on domestic input expense; (e) Depreciation allowance on infrastructure, buildings, and equipment — accelerated depreciation over 5 years; (f) Reinvestment allowance of 5% of income for manufacturing enterprises that reinvest in expansion; (3) Under EDR, the enterprise is subject to regular VAT (not VAT-exempt), which means it can claim input VAT credits and its local purchases from VAT-registered suppliers are zero-rated (reinstated under CREATE MORE for export enterprises); (4) The EDR is particularly advantageous for enterprises with high labor costs, significant R&D spending, or substantial local content, as the additional deductions can reduce the effective tax rate well below 20%."
    },
    {
      "title": "VAT and Duty Exemptions — Capital Equipment and Local Purchases",
      "content": "Registered enterprises enjoy the following VAT and customs duty incentives: (1) Duty Exemption on Imported Capital Equipment — machinery, equipment, spare parts, and accessories directly and exclusively used in the registered activity are exempt from customs duties. This benefit applies during the registered project's construction and operational phases. The list of eligible items must be approved by the IPA and endorsed to the Bureau of Customs; (2) VAT Exemption on Importation of Capital Equipment — importation of qualifying capital equipment is also exempt from 12% VAT (in addition to customs duty exemption); (3) Zero-Rated Local Purchases (CREATE MORE Reinstatement) — under the original CREATE Law, local purchases by export enterprises in ecozones lost their zero-rated status and became VAT-exempt, creating cascading VAT costs for local suppliers who could not claim input VAT credits. CREATE MORE (RA 12066) reinstated the zero-rating on local purchases of goods and services by registered export enterprises, provided such purchases are 'directly attributable' to the registered project or activity. The 'directly attributable' standard requires that the goods or services are directly and exclusively used in the registered export activity — general administrative expenses or overhead may not qualify; (4) Tax and Duty-Free Importation of Raw Materials — for export enterprises, raw materials and supplies used in manufacturing export products are exempt from customs duties and VAT, subject to export commitment requirements; (5) These benefits are conditioned on maintaining good standing with the IPA, meeting export and employment requirements, and proper documentation (import permits, Certificates of Product Exportation)."
    },
    {
      "title": "Registered Business Enterprise Local Tax (RBELT) and Location Requirements",
      "content": "CREATE and CREATE MORE introduced the RBELT as an optional local tax incentive: (1) RBELT Rate: 2% of gross income earned — an optional tax paid in lieu of all local taxes (local business tax, real property tax, community tax, etc.). This is available to enterprises registered with any IPA, regardless of whether they elected SCIT or EDR for national taxes; (2) The RBELT simplifies local tax compliance for registered enterprises, which previously had to navigate varying local tax rates across different LGUs (Local Government Units); (3) Payment and Administration: RBELT is remitted to the LGU where the enterprise is located, with the DOF providing guidelines on allocation and collection; (4) Location Requirements by IPA: PEZA enterprises must be physically located within a proclaimed PEZA economic zone (IT parks, manufacturing zones, agri-ecozones, etc.). BOI enterprises can locate anywhere in the Philippines — this flexibility is a key advantage of BOI registration. SBMA and CDC enterprises must be within the Subic/Clark freeport zones. TIEZA enterprises must be within tourism enterprise zones; (5) Location-based Incentive Tiers: enterprises located in less-developed areas outside the National Capital Region, Metro Cebu, and Metro Davao receive longer incentive periods and more generous benefits. The SIPP identifies priority geographic areas; (6) For IT-BPM enterprises: PEZA IT parks and virtual ecozone arrangements are available, though CREATE MORE tightened the work-from-home provisions for IT-BPM enterprises claiming incentives."
    },
    {
      "title": "Strategic Investment Priority Plan (SIPP) and Priority Activities",
      "content": "The Strategic Investment Priority Plan (SIPP) replaced the traditional Investment Priorities Plan (IPP) under the CREATE framework. The SIPP for 2023-2025 identifies the following priority investment activities across three tiers: Tier I — Activities with the highest strategic importance: (a) Green Ecosystem activities — renewable energy, electric vehicle manufacturing, sustainable packaging, waste management and recycling; (b) Health and pandemic preparedness — pharmaceutical manufacturing, medical device production, vaccine development; (c) Defense transformation — defense equipment and technology manufacturing; (d) Food security — advanced agricultural technology, food processing for export. Tier II — Activities generating employment and supporting supply chains: (a) Industry 4.0 — AI, IoT, automation, advanced manufacturing; (b) Creative industries — animation, game development, film production; (c) Aerospace parts manufacturing; (d) Shipbuilding and maritime. Tier III — Other important activities: (a) General manufacturing; (b) Agribusiness; (c) Tourism facilities; (d) Mass housing. The SIPP also includes specific provisions for micro, small, and medium enterprises (MSMEs) and startups in priority sectors, with simplified registration processes and proportionate compliance requirements."
    },
    {
      "title": "Registration Process and CREATE MORE IRR (February 2025)",
      "content": "The registration process for availing fiscal incentives follows these steps: (1) SEC/DTI Registration — the enterprise must first be registered with the Securities and Exchange Commission (for corporations/partnerships) or Department of Trade and Industry (for sole proprietors); (2) IPA Application — submit application to the appropriate IPA (PEZA, BOI, etc.) with: project feasibility study, financial projections, proposed registered activity, investment capital, employment plan, and environmental compliance certificate if applicable; (3) IPA Evaluation — the IPA evaluates the project against the SIPP criteria, including: job creation, export commitment, technology transfer, location, and overall economic contribution; (4) IPA Approval — for projects below the PHP 15B threshold, the IPA issues the Certificate of Registration directly; (5) FIRB Review — projects exceeding PHP 15B in investment capital, or those seeking incentives beyond the standard package, must secure FIRB approval; (6) Post-Registration Compliance — the enterprise must comply with registration conditions: file annual incentive compliance reports, maintain separate books for registered and non-registered activities, meet export and employment commitments, and submit audited financial statements. The CREATE MORE Act (RA 12066) was signed on November 11, 2024, and its Implementing Rules and Regulations (IRR) were signed on February 17, 2025. Key CREATE MORE IRR provisions include: clarification of the 'directly attributable' standard for zero-rated local purchases, guidelines on the extended incentive periods, streamlined registration for MSMEs, and transition rules for existing registered enterprises migrating from the original CREATE framework to CREATE MORE."
    }
  ]
}
