{
  "category": "general",
  "source": "Real Property Taxation in the Philippines — CGT, DST, Transfer Tax, eCAR",
  "chunks": [
    {
      "title": "Capital Gains Tax (CGT) on Real Property",
      "content": "Under Section 24(D) of the NIRC, the sale, exchange, or other disposition of real property classified as a capital asset in the Philippines is subject to a final Capital Gains Tax (CGT) of 6% based on the gross selling price or the current fair market value (FMV) at the time of sale, whichever is higher. The FMV is determined as the higher of the BIR zonal value or the assessed value per the provincial/city assessor. CGT is filed using BIR Form 1706 and must be paid within thirty (30) days from the date of notarization of the deed of sale. For installment sales, the CGT on the entire gain is still due within 30 days of notarization unless the seller qualifies for installment reporting under Section 49 of the NIRC. The CGT return must be filed with the Revenue District Office (RDO) having jurisdiction over the location of the property. Failure to file within the prescribed period results in a 25% surcharge (or 50% for willful neglect/fraud), 12% annual interest, and applicable compromise penalties. The CGT is a final tax, meaning the gain is not included in the seller's regular income tax return."
    },
    {
      "title": "Creditable Withholding Tax (CWT) on Real Property Sales",
      "content": "When real property is classified as an ordinary asset (i.e., used in trade or business, or held primarily for sale by a real estate dealer/developer), the sale is not subject to the 6% CGT but instead to Creditable Withholding Tax (CWT) under RR 2-98 as amended. The CWT rates are: 1.5% of the gross selling price or FMV (whichever is higher) for sales by persons not habitually engaged in real estate; and 6% for sellers classified as real estate dealers or developers, for properties exceeding certain thresholds. For residential lots exceeding PHP 1,919,500 and other real properties exceeding PHP 1,000,000, the applicable withholding tax rate is 6%. The buyer/withholding agent files BIR Form 1606 and remits the withheld tax within 10 days following the month of withholding (for eFPS filers, within 15 days). The CWT is creditable against the seller's income tax liability for the taxable year. Both buyer and seller must secure Tax Identification Numbers (TINs) and the property details must be accurately reflected in the return."
    },
    {
      "title": "Documentary Stamp Tax (DST) on Real Property Transfers",
      "content": "Section 196 of the NIRC imposes Documentary Stamp Tax (DST) on deeds of sale, conveyances, and transfers of real property at the rate of PHP 15.00 for every PHP 1,000 (or fractional part thereof) of the consideration or FMV, whichever is higher — effectively 1.5%. DST is filed using BIR Form 2000-OT and must be paid within five (5) days after the close of the month when the taxable document was executed or signed. Both the buyer and seller are jointly and severally liable for the DST, though by common practice the buyer usually shoulders it. For property transfers through donation, DST is imposed under Section 196 on the FMV. For mortgage transactions, a separate DST under Section 195 applies at PHP 20 per PHP 5,000 of the secured amount (0.4%). DST is distinct from CGT and transfer taxes and must be paid before the BIR will process the Certificate Authorizing Registration (CAR/eCAR). Exemptions include transfers to the government or its instrumentalities, and transfers pursuant to certain reorganization provisions."
    },
    {
      "title": "VAT on Real Property Transactions",
      "content": "When a VAT-registered seller (or one required to be VAT-registered) sells real property in the ordinary course of trade or business, the transaction is subject to 12% Value-Added Tax under Section 106 of the NIRC. VAT applies when the selling price exceeds the following thresholds (as adjusted by RR 16-2011 and RR 13-2018): PHP 3,199,200 for residential lots; PHP 1,919,500 for residential houses and lots or other residential dwellings. For commercial and industrial properties, there is no threshold — all sales by VAT-registered persons are subject to VAT regardless of amount. The VAT base is the gross selling price or FMV, whichever is higher. Input VAT on construction costs and related expenses may be credited against the output VAT. The seller reports the VAT on BIR Form 2550M (monthly) and BIR Form 2550Q (quarterly). Real property sales that are exempt from VAT include: sales of residential lots below PHP 1,919,500, socialized housing (PHP 580,000 and below under RA 11534/CREATE), and sales of real property not in the ordinary course of business (subject to CGT instead). Transitional input VAT under Section 111(A) may be claimed on beginning inventory of real properties."
    },
    {
      "title": "Local Transfer Tax on Real Property",
      "content": "Under Sections 135-136 of the Local Government Code (RA 7160), local government units impose a transfer tax on the sale, donation, barter, or any other mode of transferring ownership of real property. The maximum rates are: 0.50% of the total consideration or FMV (whichever is higher) for provinces; and 0.75% for cities and municipalities within Metro Manila. The transfer tax is paid to the City or Municipal Treasurer's Office where the property is located. Payment is due within sixty (60) days from the date of execution of the deed of conveyance. Late payment incurs a penalty of up to 25% of the transfer tax due plus 2% monthly interest (up to 36 months). The local transfer tax is separate from and in addition to the national taxes (CGT/CWT, DST, VAT). Both buyer and seller may negotiate who bears this cost, but the buyer is typically responsible. Proof of payment of local transfer tax is required for processing the transfer of title at the Register of Deeds."
    },
    {
      "title": "Real Property Tax (RPT / Amilyar) — Annual Local Tax",
      "content": "Real Property Tax (RPT), locally known as 'amilyar,' is an annual ad valorem tax imposed by provincial, city, and municipal governments under Title II of the Local Government Code. The basic RPT rate is: not exceeding 1% of the assessed value for provinces; and not exceeding 2% of the assessed value for cities and municipalities within Metro Manila. An additional 1% Special Education Fund (SEF) levy applies on top of the basic rate. Assessed value is computed as: Fair Market Value (per the assessor's schedule of values) × Assessment Level (e.g., 20% for residential, 50% for commercial/industrial). RPT is payable annually on or before January 31, or in four quarterly installments (March 31, June 30, September 30, December 31). Many LGUs offer early payment discounts of 10-20% for full annual payment in January. Delinquent RPT accrues interest of 2% per month (up to 72% maximum). Properties delinquent for more than two consecutive years may be sold at public auction. Exemptions include government properties, charitable institutions, churches, and cooperatives. The RPT assessed values are distinct from BIR zonal values and may differ significantly."
    },
    {
      "title": "Certificate Authorizing Registration (CAR / eCAR)",
      "content": "The Certificate Authorizing Registration (CAR), now processed electronically as eCAR, is a certification issued by the BIR confirming that all national internal revenue taxes due on the transfer of real property have been fully paid. The eCAR is an absolute prerequisite for transferring the title at the Register of Deeds. The process requires submission of: (1) notarized Deed of Absolute Sale or other transfer document; (2) certified true copy of the Transfer Certificate of Title (TCT) or Condominium Certificate of Title (CCT); (3) tax clearance from the LGU; (4) proof of payment of CGT or CWT (BIR Form 1706 or 1606); (5) proof of payment of DST (BIR Form 2000-OT); (6) VAT return if applicable; (7) Tax Identification Numbers of buyer and seller; (8) sworn declaration of the property's FMV. Under the EOPT Act (RA 11976), the BIR is mandated to process eCAR within a specific timeframe, and the digital transformation roadmap aims to reduce processing to 5-10 working days. In practice, eCAR processing at many RDOs still takes 2-8 weeks. The eCAR is valid only for the specific transaction described and must be presented together with the deed and tax payment receipts to the Register of Deeds for title transfer."
    },
    {
      "title": "Ordinary Asset vs Capital Asset Classification",
      "content": "The tax treatment of real property sales critically depends on whether the property is classified as a capital asset or an ordinary asset under the NIRC. Capital assets are properties held by a taxpayer that are NOT: (1) stock in trade or inventory; (2) property primarily held for sale to customers in the ordinary course of business; (3) property used in trade or business subject to depreciation; or (4) real property used in trade or business. All other real properties are ordinary assets. Under RR 7-2003, real property is presumed ordinary if: the taxpayer is a real estate dealer/developer; the property is located where the taxpayer's business operates; or the property was previously used in business. Key tax differences: capital asset sales are subject to 6% CGT (final tax); ordinary asset sales are subject to regular income tax (graduated rates for individuals, 25% for corporations) with CWT, and potentially 12% VAT. Reclassification from ordinary to capital asset generally requires a holding period of at least two years after cessation of business use and conversion. Taxpayers should maintain clear documentation of property classifications and any changes, as the BIR regularly scrutinizes this during audits. Incorrect classification can result in deficiency assessments and penalties."
    },
    {
      "title": "Installment Reporting for Real Property Sales",
      "content": "Section 49 of the NIRC allows installment reporting of income from the sale of real property classified as an ordinary asset when: (1) the initial payments in the year of sale do not exceed 25% of the selling price; and (2) the selling price exceeds PHP 1,000. 'Initial payments' include the down payment plus all installments received during the taxable year of sale, but exclude the buyer's promissory note or mortgage. Under installment reporting, the seller recognizes gain proportionally as payments are received: recognized gain = (payment received / contract price) × total gain. The income tax (and CWT) is computed based on the proportional gain recognized each year. For CGT purposes on capital assets, Section 24(D) does not allow installment reporting — the 6% CGT is due within 30 days of notarization regardless of payment terms. However, in practice, the BIR has issued rulings allowing deferred CGT payment in certain installment sale arrangements, provided the taxpayer secures prior BIR approval. For VAT purposes, output VAT on installment sales of real property is recognized based on actual collections (cash basis), not on the accrual of receivables. The seller must issue VAT official receipts as payments are collected and report accordingly in BIR Forms 2550M/Q."
    },
    {
      "title": "Special Economic Zones and Estate Tax Amnesty Implications on Real Property",
      "content": "Real property located within Special Economic Zones (SEZs), such as PEZA zones, freeport zones (Subic, Clark, Cagayan, Zamboanga), and tourism enterprise zones, may enjoy preferential tax treatment under their respective charters and the CREATE/CREATE MORE framework. Registered business enterprises (RBEs) within SEZs may opt for a 5% Gross Income Earned (GIE) tax in lieu of all national and local taxes, including RPT, or the enhanced deductions regime under CREATE MORE. Under the FIRB (Fiscal Incentives Review Board) centralized administration, the tax treatment of real property within SEZs depends on the enterprise's registered activities and chosen incentive scheme. Separately, the Estate Tax Amnesty under RA 11213 (Tax Amnesty Act), as extended by subsequent laws, allows the settlement of estate tax liabilities for decedents who died on or before December 31, 2021, at a flat rate of 6% of the net undeclared estate, with a minimum amnesty tax of PHP 5,000. This amnesty is particularly significant for real properties that remain titled in the names of deceased persons. Availing of the amnesty allows heirs to process eCAR and transfer titles to their names without facing the full estate tax liability plus years of penalties and interest. The amnesty has been extended multiple times and taxpayers should confirm the current deadline with the BIR."
    }
  ]
}
