{
  "category": "compliance",
  "source": "Key BIR Issuances, Revenue Regulations, and Tax Laws — 2024-2025 Updates",
  "chunks": [
    {
      "title": "CREATE MORE Act (RA 12066) — Key Changes to Investment Incentives",
      "content": "The Corporate Recovery and Tax Incentives for Enterprises to Maximize Opportunities for Reinvigorating the Economy (CREATE MORE) Act, Republic Act No. 12066, was signed into law on November 11, 2024, with its Implementing Rules and Regulations (IRR) signed on February 17, 2025. CREATE MORE enhances and liberalizes the incentives regime established by the original CREATE Act (RA 11534) to attract more foreign investment. Key provisions: (1) Enhanced Deductions (ED) regime — registered business enterprises (RBEs) may claim up to 200% super-deduction on qualified training, research and development, and domestic input expenses, in addition to the regular 25% corporate income tax (or special CIT rate). (2) Income Tax Holiday (ITH) extended — the maximum ITH period for strategic investments increased from 4-7 years to 4-17 years depending on the industry, location, and investment size. (3) Special Corporate Income Tax (SCIT) of 5% on gross income earned (GIE) available for a longer period after ITH. (4) Duty exemption on imported capital equipment, raw materials, and spare parts. (5) VAT zero-rating on local purchases of goods and services by RBEs. (6) Transferability of registration — RBEs may transfer incentives when relocating to another economic zone or when changing investment promotion agency (IPA). (7) Fiscal Incentives Review Board (FIRB) retains centralized authority but with streamlined application and monitoring processes. (8) Strategic Investment Priority Plan (SIPP) updated to include AI, digital transformation, green energy, and healthcare as priority sectors."
    },
    {
      "title": "EOPT Act (RA 11976) — Modernized Tax Administration",
      "content": "The Ease of Paying Taxes (EOPT) Act, Republic Act No. 11976, signed on January 5, 2024, represents the most comprehensive reform of Philippine tax administration procedures in decades. Key provisions: (1) Taxpayer classification — micro (gross sales up to PHP 3M), small (PHP 3M-20M), medium (PHP 20M-1B), and large (over PHP 1B). This classification affects compliance requirements, filing obligations, and audit selection. (2) Simplified return filing — the BIR must simplify tax return forms and reduce the number of required attachments, particularly for micro and small taxpayers. (3) Electronic filing and payment — mandatory for medium and large taxpayers; optional but encouraged for micro and small taxpayers. The BIR must provide free electronic filing tools. (4) Single BIR Form concept — eventual consolidation of multiple returns into simplified forms. (5) Refund processing — the BIR must process VAT refund claims within 180 days from filing (reduced from the previous practice of 2-5 years). Risk-based processing allows low-risk claims to be fast-tracked. (6) Withholding tax simplification — reduced filing frequency for micro taxpayers; simplified alphalist requirements. (7) Invoice system modernization — the law mandates the development of an Electronic Invoicing System (EIS) to be implemented in phases. (8) Taxpayer rights — strengthened provisions on taxpayer protection, including the right to a speedy resolution of tax cases, the right to information, and protection from harassment. (9) Transition period — full implementation expected within 3-5 years, with the BIR issuing implementing regulations in phases."
    },
    {
      "title": "RR 04-2025 — Updated De Minimis Benefits",
      "content": "Revenue Regulations No. 04-2025, issued in early 2025, updated the list of de minimis benefits and their ceiling amounts. De minimis benefits are employer-provided benefits that are relatively small in value and are exempt from income tax and withholding tax under Section 33 of the NIRC. The updated de minimis benefits and ceiling amounts are: (1) Monetized unused vacation leave credits — not exceeding 12 days per year for private sector employees (government employees: 10 days); (2) Medical cash allowance to dependents of employees — not exceeding PHP 2,000 per semester or PHP 4,000 per year; (3) Rice subsidy — not exceeding PHP 2,000 per month or one sack of 50kg rice per month (approximate value equivalent); (4) Uniform and clothing allowance — not exceeding PHP 7,000 per annum; (5) Actual medical assistance — not exceeding PHP 10,000 per annum; (6) Laundry allowance — not exceeding PHP 300 per month; (7) Employees' achievement awards (loyalty, length of service, safety) — not exceeding PHP 10,000 per annum in the form of tangible personal property, cash, or gift certificates; (8) Gifts during Christmas and major anniversary celebrations — not exceeding PHP 5,000 per employee per annum; (9) Daily meal allowance for overtime work and night/graveyard shift — not exceeding 25% of the minimum wage; (10) CBA-mandated benefits and productivity incentives — not exceeding PHP 12,000 per annum. Benefits exceeding the de minimis ceiling are treated as part of the 'other benefits' subject to the PHP 90,000 annual threshold under Section 32(B)(7)(e) of the NIRC. Any excess beyond both de minimis and the PHP 90,000 threshold is taxable compensation income."
    },
    {
      "title": "RA 12023 and RR 03-2025 — VAT on Digital Services",
      "content": "Republic Act No. 12023 imposes 12% VAT on digital services consumed in the Philippines, with Revenue Regulations No. 03-2025 providing the implementing rules. Effective date: June 1, 2025, with nonresident Digital Service Providers (DSPs) required to register with the BIR by April 1, 2025. Key implementation details: (1) DSPs providing digital services (streaming, cloud computing, SaaS, digital advertising, online marketplaces, app stores, e-books, online gaming) to Philippine consumers must register, collect, and remit VAT. (2) Simplified registration system for nonresident DSPs through BIR's online portal. (3) B2B reverse charge mechanism — VAT-registered Philippine businesses self-assess VAT on purchases from nonresident DSPs and simultaneously claim input VAT credit. (4) Place of supply determined by customer location indicators: billing address, IP address, payment method, phone country code. (5) VAT threshold of PHP 3,000,000 applies to DSPs. (6) Filing: quarterly simplified VAT returns for nonresident DSPs. This legislation is expected to generate PHP 12-15 billion in additional annual revenue and levels the playing field between domestic and foreign digital service providers. Major platforms affected include Netflix, Spotify, Google, Meta, Amazon Web Services, Microsoft, Apple, and other global technology companies providing digital services to Philippine consumers."
    },
    {
      "title": "RR 10-2025 — Streamlined VAT Refund Documentary Requirements",
      "content": "Revenue Regulations No. 10-2025 significantly streamlines the documentary requirements for VAT refund claims, implementing the EOPT Act's mandate for simplified and faster refund processing. Key changes: (1) Certified copies accepted — taxpayers may now submit certified true copies of supporting documents instead of original copies, which was a major pain point that frequently caused delays and lost-document issues. (2) Reduced documentation tiers — documents are categorized by risk level: low-risk claims (based on BIR's risk assessment system) require minimal documentation; medium-risk claims require standard documentation; high-risk claims may require additional verification. (3) Risk-based processing timeline — low-risk claims targeted for processing within 90 days; medium-risk within 120 days; high-risk within the statutory 180-day period. (4) Electronic submission — all supporting documents may be submitted electronically through the BIR's refund portal, reducing physical document handling. (5) Standardized checklists — the BIR published specific document checklists for each type of VAT refund (zero-rated sales, capital goods purchases, cessation of business) to provide clarity on requirements. (6) No more redundant certifications — eliminated the requirement for multiple notarized certifications that previously duplicated information already available in the VAT returns and invoices. (7) Integration with eSales and ePurchases reports — the BIR cross-references refund claims with the taxpayer's electronically reported sales and purchases data, reducing the need for manual verification. This is a major improvement in the Philippine VAT refund system, which has historically been among the slowest in the ASEAN region."
    },
    {
      "title": "RMC 5-2024, RMC 38-2024, and Treaty Application Updates",
      "content": "Revenue Memorandum Circular (RMC) 5-2024 and RMC 38-2024 provide important clarifications on cross-border services taxation and tax treaty application: (1) RMC 5-2024 — clarifies the taxation of cross-border services, particularly in the context of digital and remote services rendered by nonresidents to Philippine clients. It reiterates that income payments to nonresidents for services performed within the Philippines (even if remotely) are subject to Philippine income tax and withholding tax. The circular provides guidance on determining the 'source' of service income — whether the service is performed in, or generates income from, the Philippines. (2) RMC 38-2024 — provides updated procedures for Tax Treaty Relief Application (TTRA) processing and clarifies the documentary requirements for claiming reduced withholding tax rates under the Philippines' tax treaty network (over 40 bilateral tax treaties). Key clarifications include: (a) the TTRA must be filed before the first payment or within the prescribed period to be effective; (b) the BIR will accept Tax Residency Certificates (TRCs) from treaty partner countries as primary evidence of treaty eligibility; (c) simplified procedures for repeat claimants with existing BIR rulings; (d) digital submission of TTRA applications is now accepted. (3) These circulars are particularly relevant for businesses engaged in cross-border transactions including technical services, royalties, interest payments, and dividends, where treaty rates can significantly reduce withholding tax from the default 25% or 30% to 10-15%."
    },
    {
      "title": "RMC 107-2025, RR 15-2024, and FIRB Advisory 007-2024",
      "content": "Three significant issuances affecting taxpayer compliance and investment incentives: (1) RMC 107-2025 — Suspension of All BIR Field Audits: Issued November 24, 2025, this unprecedented circular orders the immediate suspension of all field audit activities pending a comprehensive overhaul of the BIR's audit selection and conduct protocols. The suspension covers all pending and new LOAs, document examination at taxpayer premises, and compliance verification field activities. It does NOT affect desk audits, already-issued assessments, or CTA proceedings. This reform initiative aims to implement a truly risk-based audit system under the EOPT Act and address systemic issues with field audit conduct. (2) RR 15-2024 — CREATE MORE Implementing Provisions: This regulation provides the first set of implementing rules for RA 12066 (CREATE MORE), covering: application procedures for investment incentives, ITH and SCIT availment mechanics, enhanced deductions computation methodology, and the transition rules for existing registered business enterprises under CREATE (RA 11534) migrating to CREATE MORE incentives. (3) FIRB Advisory 007-2024 — Interim IRR on Incentive Availment and Transfer of Registration: Issued by the Fiscal Incentives Review Board, this advisory provides interim guidelines on: (a) the process for transferring incentive registrations between economic zones and IPAs; (b) availment procedures during the transition from CREATE to CREATE MORE; (c) interim rules on the enhanced deductions regime while final IRR is being prepared; (d) documentation requirements for existing RBEs seeking enhanced incentives under the new law."
    },
    {
      "title": "Estate Tax Amnesty Extensions and BIR Digital Transformation",
      "content": "Two ongoing developments affecting Philippine taxpayers: (1) Estate Tax Amnesty Extensions — The Estate Tax Amnesty originally provided under RA 11213 (Tax Amnesty Act, 2019) has been extended multiple times by Congress. The amnesty covers estates of decedents who died on or before December 31, 2021, allowing heirs to settle estate tax liabilities at a flat 6% rate with a minimum tax of PHP 5,000, inclusive of all penalties and interest that would otherwise have accrued. Key benefits: allows processing of eCAR and title transfer for long-pending estates; provides immunity from estate tax-related penalties, surcharges, and interest; and offers a practical solution for the estimated millions of real properties in the Philippines that remain titled in the names of deceased persons. Taxpayers should monitor congressional action on further extensions as the amnesty has a defined expiration date. (2) BIR Digital Transformation under EOPT Act — The BIR has embarked on an ambitious digital transformation roadmap mandated by RA 11976: (a) Electronic Invoicing System (EIS) — phased implementation requiring taxpayers to issue and transmit invoices electronically to the BIR in near-real-time; (b) enhanced eFPS and eBIRForms platforms for electronic filing and payment; (c) data analytics and AI-driven risk assessment for audit selection; (d) interoperability with other government systems (LGU business permits, SEC filings, PhilSys national ID); (e) automated VAT refund processing with risk-based verification; (f) online taxpayer portal for viewing compliance status, assessment history, and requesting certificates."
    },
    {
      "title": "2025 BIR Filing Calendar and New Form Updates",
      "content": "The 2025 BIR filing calendar reflects updates from the EOPT Act and recent revenue regulations: (1) January 31, 2025 — Annual Registration Fee (BIR Form 0605, PHP 500), books of accounts registration/stamping. (2) Monthly VAT returns (BIR Form 2550M) — due within 25 days after the close of each month (except for quarters ending March, June, September, December, which use 2550Q). (3) Quarterly VAT returns (BIR Form 2550Q) — due within 25 days after the close of each quarter. (4) Quarterly Income Tax Returns — BIR Form 1701Q (individuals) and BIR Form 1702Q (corporations), due within 60 days after the close of each quarter. (5) Annual Income Tax Returns — BIR Form 1701 (individuals, due April 15), BIR Form 1702-RT/EX/MX (corporations, due on the 15th day of the 4th month following the close of the taxable year). (6) Withholding tax returns — BIR Form 0619E/F (monthly), BIR Form 1601EQ/FQ (quarterly), BIR Form 1604E/F (annual alphalist, due January 31 and March 1 respectively). (7) New/updated forms for 2025: simplified VAT return form for micro taxpayers under EOPT; updated BIR Form 2550Q reflecting digital services VAT provisions; revised withholding tax returns incorporating EOPT simplification measures; new forms for nonresident DSP registration and VAT filing under RA 12023. (8) Large taxpayers and eFPS-mandated filers continue to have the extended 15-day filing window for electronically filed returns (i.e., 15 days after the manual filing deadline). All deadlines falling on weekends or holidays are automatically moved to the next business day."
    },
    {
      "title": "Practical Impact Assessment — What Taxpayers Need to Know for 2025",
      "content": "The confluence of major tax legislation and regulatory changes in 2024-2025 creates both opportunities and compliance challenges for Philippine taxpayers. Key action items: (1) Review investment incentive structure — existing RBEs should evaluate whether migration from CREATE to CREATE MORE incentives provides net benefits (longer ITH, enhanced deductions, SCIT). Consult with FIRB and the relevant IPA for transition procedures. (2) Digital services procurement — businesses purchasing foreign digital services (SaaS, cloud, advertising) must prepare for VAT reverse charge obligations effective June 1, 2025. Update accounting systems, train staff, and review contracts with DSPs. (3) De minimis benefits — HR and payroll departments should update benefit structures to align with RR 04-2025's new ceiling amounts, ensuring tax-efficient compensation packages. (4) VAT refund claims — take advantage of RR 10-2025's streamlined documentary requirements. Organize existing refund claims with the updated checklists and submit certified copies instead of originals. (5) Audit preparedness — while field audits are suspended under RMC 107-2025, maintain audit-ready records as the suspension is temporary and the new risk-based audit system will likely target previously identified discrepancies first. (6) Estate settlement — avail of the estate tax amnesty before it expires for estates of decedents who died on or before December 31, 2021. (7) Tax treaty claims — implement the updated TTRA procedures under RMC 38-2024 for all cross-border payments to ensure reduced withholding tax rates are properly claimed. (8) EOPT compliance — monitor BIR issuances on the Electronic Invoicing System rollout and simplified return forms, and participate in pilot programs if invited."
    }
  ]
}
