{
  "category": "general",
  "source": "NIRC Title VI-VII - Documentary Stamp Tax, Excise Tax, and Other Special Taxes",
  "chunks": [
    {
      "title": "Documentary Stamp Tax (DST) Overview",
      "content": "Documentary Stamp Tax (DST) — NIRC Title VII (Sections 173-201): A tax imposed on certain documents, instruments, and transactions. Key DST rates (per TRAIN Law): (1) Sale/conveyance of real property — PHP 15 per PHP 1,000 of consideration or value (1.5%); (2) Deeds of sale of shares of stock — PHP 1.50 per PHP 200 of par value (0.75%); (3) Bonds, debentures, certificates of indebtedness — PHP 1.50 per PHP 200 of face value; (4) Bank checks — PHP 3.00 per check (previously PHP 1.50); (5) Bills of exchange/drafts — PHP 0.60 per PHP 200 of face value; (6) Original issue of shares of stock — PHP 2.00 per PHP 200 of par value; (7) Insurance policies: (a) life — based on amount insured; (b) non-life — based on premiums; (8) Lease agreements — based on total rental amount; (9) Mortgages and pledges — PHP 40 per PHP 5,000 of secured debt; (10) Warehouse receipts — PHP 30 per receipt. DST must be paid within 5 days from the close of the month of document execution. Filed using BIR Form 2000 (regular) or 2000-OT (one-time transactions). Electronic DST: for financial institutions, DST may be remitted through an electronic DST collection system."
    },
    {
      "title": "DST on Loans, Mortgages, and Financial Instruments",
      "content": "DST on financial transactions (Sections 179-195 NIRC as amended by TRAIN): (1) Promissory notes, bills of exchange — PHP 1.50 per PHP 200 of face value (Section 180); (2) Acceptance of bills of exchange — same rate; (3) Foreign bills of exchange drawn in the Philippines — PHP 0.60 per PHP 200 (Section 181); (4) Bonds, debentures, and certificates of stock — PHP 1.50 per PHP 200 (Section 179); (5) Mortgages, pledges, and deeds of trust — PHP 40.00 per PHP 5,000 of amount secured (Section 195); refinancing is subject to DST only on the incremental amount; (6) Certificates of deposit bearing interest — PHP 1.50 per PHP 200 (Section 180); (7) Bank checks, drafts, certificates of deposit — PHP 3.00 per check (Section 181). Important exemptions from DST: (a) Government borrowings; (b) Certificates of deposit NOT bearing interest; (c) Interbank call loans; (d) Transactions of cooperatives; (e) Assignment of mortgage without new consideration. DST is borne by the party who makes, signs, issues, accepts, or transfers the document, unless there is an agreement to the contrary."
    },
    {
      "title": "Excise Tax on Alcohol and Tobacco",
      "content": "NIRC Sections 141-145 (as amended by TRAIN, RA 11346/Sin Tax Reform, and RA 11467): Excise tax on alcohol products (2024 rates): (1) Distilled spirits — specific tax of PHP 42.00 per proof liter + ad valorem tax of 22% of net retail price; (2) Wines and fermented liquors — (a) sparkling wines: PHP 500 per liter; (b) still wines: PHP 80 per liter; (c) fermented liquors (beer): PHP 39.00 per liter; (3) These rates increase by 6% annually under the indexation provisions. Excise tax on tobacco products (2024 rates): (1) Cigarettes — PHP 60.00 per pack of 20 (increasing by PHP 5 annually under RA 11467); (2) Cigars — same rate as cigarettes based on equivalent number; (3) Heated tobacco products (HTPs) — PHP 30.00 per pack; (4) Vapor products (e-cigarettes): (a) nicotine salt/freebase — PHP 58.00 per milliliter; (b) conventional freebase — PHP 50.00 per 10 milliliters. Revenue from sin taxes is earmarked for Universal Health Care (RA 11223) and the Medical Assistance Program."
    },
    {
      "title": "Excise Tax on Minerals and Petroleum",
      "content": "NIRC Sections 148-151 (as amended by TRAIN): Excise tax on mineral products: (1) Coal and coke — PHP 150.00 per metric ton (increasing annually under TRAIN schedule); (2) Non-metallic minerals and quarry resources — 4% of actual market value at the time of removal; (3) Metallic minerals — except gold, 4% of actual market value; (4) Indigenous petroleum — 3% to 6% of fair international market price, depending on production levels; (5) Copper, gold, and chromite concentrate — 4% of actual market value. Excise tax on petroleum products (2020 onwards, per TRAIN): (1) Lubricating oils and greases — PHP 10.00 per liter/kilogram; (2) Processed gas — PHP 10.00 per liter; (3) Waxes and petrolatum — PHP 10.00 per kilogram; (4) Denatured alcohol used for motive power — PHP 10.00 per liter; (5) Naphtha, regular gasoline, and other similar products of distillation — PHP 10.00 per liter; (6) Unleaded premium gasoline — PHP 10.00 per liter; (7) Aviation turbo jet fuel — PHP 4.00 per liter; (8) Kerosene — PHP 5.00 per liter; (9) Diesel fuel oil — PHP 6.00 per liter; (10) LPG — PHP 3.00 per kilogram; (11) Bunker fuel oil — PHP 6.00 per liter."
    },
    {
      "title": "Percentage Tax (Title V - Sections 116-127)",
      "content": "Percentage Tax — imposed on persons not subject to VAT: (1) Section 116 — Tax on persons exempt from VAT: 3% of quarterly gross sales/receipts for non-VAT registered taxpayers (1% temporarily under CREATE/CREATE MORE). Filed using BIR Form 2551Q (Quarterly Percentage Tax Return), due within 25 days after the end of each taxable quarter. (2) Section 117 — Percentage tax on domestic carriers and keepers of garages: 3% of gross receipts. (3) Section 118 — Percentage tax on international carriers: 3% of gross receipts from transport of cargo from the Philippines to another country. (4) Section 119 — Tax on franchises: (a) Electric/water utilities with annual gross receipts exceeding PHP 10M — 2% of gross receipts from franchise business; (b) gas and water utilities — 2%; (c) radio/TV broadcasting with annual gross receipts not exceeding PHP 10M — 3%; (5) Section 121 — Tax on banks and non-bank financial intermediaries: 0% to 7% on interest income, commissions, and other gross receipts; (6) Section 123 — Tax on life insurance premiums: 2% on total premium collections; (7) Section 127 — Tax on sale of shares listed and traded through the stock exchange: 6/10 of 1% of gross selling price."
    },
    {
      "title": "Community Tax (Cedula) and Local Taxes",
      "content": "Community Tax and Local Government Taxation (RA 7160 — Local Government Code): While not BIR-administered, local taxes are important for compliance: (1) Community Tax Certificate (CTC / Cedula) — Annual tax of PHP 5.00 basic + PHP 1.00 per PHP 1,000 of income (individuals) or PHP 500 basic + PHP 2.00 per PHP 5,000 of assessed real property value (corporations). Required for various government transactions. (2) Local Business Tax (LBT) — imposed by municipalities/cities on businesses operating within their jurisdiction. Rates vary by LGU but typically 0.25% to 0.75% of gross sales/receipts. (3) Real Property Tax (RPT) — 1% to 2% of assessed value (province: max 1%, cities/municipalities within Metro Manila: max 2%). (4) Professional Tax — PHP 300 per year for licensed professionals practicing in the LGU. (5) Transfer Tax — imposed on sale/transfer of real property: 0.50% to 0.75% of selling price or zonal value, whichever is higher. (6) Amusement Tax — 10% to 30% of gross receipts. Local taxes are separate from national taxes (BIR) and must be paid to the respective LGU. Business permits (Mayor's Permit) require proof of payment of local business tax and BIR registration."
    }
  ]
}
