{
  "category": "payroll",
  "source": "SSS, PhilHealth, and Pag-IBIG Mandatory Contributions — 2025 Rates",
  "chunks": [
    {
      "title": "SSS Contribution Rates and Schedule (2025)",
      "content": "Under the Social Security Act of 2018 (Republic Act No. 11199) and its amendments, the Social Security System (SSS) contribution rate for 2025 is 15% of the Monthly Salary Credit (MSC), split between employer and employee: 10% employer share and 5% employee share. The MSC range for 2025 is PHP 5,000 (minimum) to PHP 35,000 (maximum). The MSC is a bracket-based system — the employee's actual monthly salary is mapped to the nearest MSC bracket, and contributions are computed based on that bracket, not the actual salary. For example, an employee earning PHP 20,500 per month falls under the PHP 20,000 MSC bracket, and the total SSS contribution is PHP 20,000 × 15% = PHP 3,000 (PHP 2,000 employer + PHP 1,000 employee). The SSS contribution schedule is published annually by SSS and prescribes the exact contribution amount for each MSC bracket. Self-employed individuals and voluntary members pay the full 15% themselves, based on their declared monthly earnings. Overseas Filipino Workers (OFWs) follow the same 15% rate based on their declared earnings, with a minimum MSC of PHP 5,000. The SSS has been implementing incremental MSC ceiling increases under RA 11199, with the ceiling expected to continue rising in subsequent years until it reaches the statutory target."
    },
    {
      "title": "SSS Employees' Compensation (EC) Program",
      "content": "In addition to the regular SSS contribution, employers are required to pay the Employees' Compensation (EC) contribution under Presidential Decree No. 626. The EC program provides compensation and rehabilitation services to employees who suffer work-related illness, injury, or death. The EC contribution is entirely borne by the employer (the employee does not share in this cost). For 2025, the EC contribution rates are: PHP 10 per month for employees with MSC of PHP 15,000 and below, and PHP 30 per month for employees with MSC above PHP 15,000. The EC contribution is collected together with the regular SSS contribution and remitted as a single payment. EC benefits include: (1) medical services and appliances; (2) rehabilitation services; (3) temporary total disability (TTD) benefit — 90% of daily salary credit for each day of disability; (4) permanent total disability (PTD) benefit — monthly pension; (5) permanent partial disability benefit; (6) death benefit — monthly pension to beneficiaries; (7) funeral benefit. EC claims are filed with the SSS (for private sector employees) or GSIS (for government employees) and are separate from the regular SSS benefit claims."
    },
    {
      "title": "SSS Benefits Overview",
      "content": "SSS provides a comprehensive range of benefits to covered members: (1) Sickness Benefit — daily cash allowance for members unable to work due to illness or injury, equivalent to 90% of the daily salary credit, for up to 120 days per year. Requires at least 3 monthly contributions within the 12-month period before the semester of illness; (2) Maternity Benefit — 105 days of paid maternity leave for live childbirth (normal or caesarean), with an additional 15 days for solo parents, 60 days for miscarriage or emergency termination. The daily maternity benefit is 100% of the daily salary credit. Under the Expanded Maternity Leave Law (RA 11210), the employer advances the benefit and claims reimbursement from SSS; (3) Disability Benefit — monthly pension or lump sum for permanent disability; (4) Retirement Benefit — monthly pension for members who have paid at least 120 monthly contributions and have reached age 60 (optional) or 65 (mandatory). The monthly pension is the highest of three formulas: (a) PHP 300 + 20% of average monthly salary credit (AMSC) + 2% of AMSC for each credited year of service (CYS) in excess of 10 years; (b) 40% of AMSC; (c) PHP 1,000 + PHP 84 per CYS; (5) Death Benefit — monthly pension to primary beneficiaries (spouse and dependent children) or lump sum to secondary beneficiaries; (6) Funeral Benefit — PHP 40,000 grant to help defray burial expenses; (7) Unemployment/Involuntary Separation Benefit — available under RA 11199 for members who are involuntarily separated from employment."
    },
    {
      "title": "SSS Contribution Remittance Deadline and Compliance",
      "content": "Employers must remit SSS contributions (including EC) on a monthly basis. The deadline for remittance is within the first ten (10) business days of the month following the applicable month. The specific due date depends on the last digit of the employer's SSS number: employers with SS numbers ending in 1-2 remit on or before the 10th, ending in 3-4 by the 15th, ending in 5-6 by the 20th, ending in 7-8 by the 25th, and ending in 9-0 by the last business day of the month. However, in practice, many employers remit within the first 10 business days to avoid penalties. Payment channels include: SSS accredited banks (over-the-counter or online banking), GCash, PayMaya, and the SSS online portal (My.SSS). Employers must also submit the Monthly Collection List or R-3 report along with the payment. Penalties for non-remittance: (a) a penalty of 2% per month (24% per annum) on unpaid contributions from the due date; (b) the employer is liable for the employee's share even if it was not deducted from wages; (c) criminal liability under RA 11199: the responsible officer (president, manager, managing partner, or any person in charge of SSS remittances) may face imprisonment of 6 years and 1 day to 12 years, and a fine of PHP 10,000 to PHP 20,000 for each act of non-remittance."
    },
    {
      "title": "PhilHealth Contribution Rates (2025)",
      "content": "Under the Universal Health Care Act (Republic Act No. 11223) and its implementing rules, PhilHealth contributions for 2025 are set at 5% of the employee's basic monthly salary, split equally between employer and employee (2.5% each). The applicable salary range for 2025 has a floor of PHP 10,000 and a ceiling of PHP 100,000 per month. This means: (1) Minimum monthly contribution: PHP 10,000 × 5% = PHP 500 (PHP 250 employer + PHP 250 employee); (2) Maximum monthly contribution: PHP 100,000 × 5% = PHP 5,000 (PHP 2,500 employer + PHP 2,500 employee). However, based on PhilHealth Circular No. 2024-0040, the effective premium rate for 2025 remains at 5% but with the actual maximum contribution capped at PHP 2,500 per month (i.e., the salary ceiling effectively operates at PHP 50,000 for contribution computation purposes, resulting in a maximum of PHP 2,500 total — PHP 1,250 employer + PHP 1,250 employee). Employers should verify the latest PhilHealth advisory for the exact 2025 ceiling. Self-employed, voluntary, and OFW members pay the full contribution based on their declared income. Indigent members are covered by the national government through LGU-identified listings. PhilHealth contributions are remitted monthly to PhilHealth-accredited banks or through PhilHealth's online portal. The deadline is on or before the 15th of the month following the applicable month."
    },
    {
      "title": "PhilHealth Benefits and Coverage",
      "content": "PhilHealth provides the following benefits to qualified members and their dependents: (1) Inpatient Benefits — coverage for room and board, drugs and medicines, laboratories, operating room fees, and professional fees for hospital confinement. Under the All Case Rate (ACR) system, PhilHealth reimburses hospitals at fixed rates per case or diagnosis (e.g., PHP 32,000 for normal spontaneous delivery, PHP 43,500 for cesarean section, varying rates for other conditions); (2) Outpatient Benefits — primary care consultations (through Konsulta package), outpatient drug benefits, and day surgery procedures; (3) Z-Benefits — special benefit packages for catastrophic conditions (e.g., certain cancers, kidney transplant, coronary artery bypass graft), with coverage up to PHP 600,000 per case; (4) SDG-Related Benefits — maternity care package, newborn care package, TB-DOTS, HIV/AIDS treatment, and animal bite treatment; (5) Konsulta Package — comprehensive outpatient benefit for primary care, including consultations, laboratory tests, and medicines, accessed through accredited primary care providers. Under UHC, all Filipino citizens are automatically PhilHealth members (either as direct contributors or through the national subsidy program). The 'No Balance Billing' policy applies to indigent and sponsored members confined in government hospitals — they should not be charged any amount beyond what PhilHealth covers."
    },
    {
      "title": "Pag-IBIG (HDMF) Contribution Rates (2025)",
      "content": "The Home Development Mutual Fund (HDMF), commonly known as Pag-IBIG, is a mandatory savings and housing loan fund established under Republic Act No. 9679. For 2025, the contribution structure is: (1) For employees earning more than PHP 1,500 per month: 2% employee share + 2% employer share of the monthly compensation. The maximum monthly compensation for Pag-IBIG contribution purposes was raised to PHP 10,000 (from the previous PHP 5,000), making the maximum contribution PHP 200 employee + PHP 200 employer = PHP 400 per month; (2) For employees earning PHP 1,500 and below per month: 1% employee share + 2% employer share; (3) Self-employed, voluntary, and OFW members: contribute at least PHP 200 per month (or higher based on their declared income). The Pag-IBIG contribution is mandatory for all employees covered by SSS/GSIS who are earning at least PHP 1,000 per month. Remittance deadline: on or before the 10th day of the month following the applicable month. Payment is made through Pag-IBIG Fund accredited banks, GCash, or the Virtual Pag-IBIG platform. Member savings are credited to two sub-accounts: Member's Total Accumulated Value (TAV) consisting of employee contributions + employer counterpart + dividends. The TAV can be withdrawn upon: retirement (age 65), permanent departure from the Philippines, permanent disability, insanity, or after 20 years of continuous membership."
    },
    {
      "title": "Pag-IBIG MP2 Voluntary Savings and Housing Loans",
      "content": "In addition to the mandatory contribution, Pag-IBIG offers the Modified Pag-IBIG II (MP2) Savings Program — a voluntary savings program that offers higher dividends than the regular Pag-IBIG savings. Key features of MP2: (1) Minimum save of PHP 500 per month (or lump sum); (2) 5-year maturity period — savings can be withdrawn after 5 years, or earlier upon retirement, death, or insanity of the member; (3) Dividend rate: historically between 6-7% per annum (tax-free), significantly higher than bank time deposits; (4) Tax-exempt: MP2 dividends are exempt from income tax under RA 9679; (5) PDIC-insured up to the applicable limit. Pag-IBIG Housing Loans: (1) Maximum loanable amount: PHP 6,000,000 for socialized housing, up to PHP 6,000,000 for open market (specific amounts depend on the appraisal and member's capacity to pay); (2) Interest rates: as low as 5.375% per annum for socialized housing and 6.375% for low-cost housing (2024-2025 rates); (3) Loan tenor: up to 30 years; (4) Eligibility: at least 24 monthly contributions, must be an active member, and the property must be in the Philippines. Other Pag-IBIG loan products include: Multi-Purpose Loan (MPL) — up to 80% of TAV for personal use, Calamity Loan, and Pag-IBIG Loyalty Card benefits. The Pag-IBIG Fund declares annual dividends on regular savings, which have historically ranged from 5-7%, making it one of the highest-yielding government savings instruments."
    },
    {
      "title": "Tax Treatment of Mandatory Contributions and Employer Compliance",
      "content": "The tax treatment of SSS, PhilHealth, and Pag-IBIG contributions is as follows: (1) Employee's Share — the employee's mandatory contributions to SSS, PhilHealth, and Pag-IBIG are deductible from gross compensation income for purposes of computing withholding tax on compensation. This means the employee's share reduces the taxable compensation base. These are not itemized deductions on the income tax return but rather exclusions from taxable compensation; (2) Employer's Share — the employer's contributions are deductible as ordinary and necessary business expenses under Section 34 of the NIRC. They are reported as part of compensation expense or employee benefits in the employer's income tax return; (3) Benefits Received — SSS benefits (retirement, sickness, maternity, disability, death) are TAX-EXEMPT under Section 32(B)(7)(a) of the NIRC. PhilHealth benefit payments are also tax-exempt. Pag-IBIG dividends and benefits are exempt under RA 9679. Employer Compliance Requirements: (a) Register with SSS, PhilHealth, and Pag-IBIG within 30 days of start of business or within 30 days of hiring the first employee; (b) Report all new hires and terminations to each agency within the prescribed period; (c) Remit contributions monthly by the applicable deadlines; (d) Maintain records of all contributions for at least 10 years; (e) Provide employees with monthly pay slips showing contributions deducted. Penalties for non-compliance vary by agency but generally include monetary fines, interest on unpaid contributions, and potential criminal liability for responsible officers."
    },
    {
      "title": "Contribution Summary Table and Practical Payroll Computation",
      "content": "Summary of mandatory contributions for 2025 (for a private sector employee earning PHP 30,000/month): SSS — Employer: PHP 2,000 (10% of PHP 20,000 MSC bracket, assuming PHP 30,000 salary maps to an MSC around PHP 30,000; exact amount depends on the SSS contribution table). At PHP 30,000 MSC: Employer PHP 3,000, Employee PHP 1,500, Total PHP 4,500. EC: PHP 30 (employer only). PhilHealth — 5% of PHP 30,000 = PHP 1,500 total. Employer: PHP 750, Employee: PHP 750. Pag-IBIG — based on PHP 10,000 ceiling: Employer PHP 200, Employee PHP 200, Total PHP 400. Total Monthly Mandatory Deductions from Employee: SSS PHP 1,500 + PhilHealth PHP 750 + Pag-IBIG PHP 200 = PHP 2,450. Total Monthly Employer Cost (above salary): SSS PHP 3,000 + EC PHP 30 + PhilHealth PHP 750 + Pag-IBIG PHP 200 = PHP 3,980. Payroll Computation: Gross Salary PHP 30,000 minus SSS Employee Share (PHP 1,500) minus PhilHealth Employee Share (PHP 750) minus Pag-IBIG Employee Share (PHP 200) = Taxable Compensation of PHP 27,550 per month. Withholding tax is then computed on PHP 27,550 using the BIR withholding tax table (annualized: PHP 330,600, which falls in the 20% bracket — tax = PHP 22,500 + 20% of excess over PHP 400,000 annualized, but since PHP 330,600 is above PHP 250,000 but below PHP 400,000: tax = 15% × (PHP 330,600 - PHP 250,000) = PHP 12,090 annual or PHP 1,007.50/month). Net take-home pay: approximately PHP 30,000 - PHP 2,450 - PHP 1,007.50 = PHP 26,542.50 per month (before any other deductions or benefits)."
    }
  ]
}
