{
  "category": "income_tax",
  "source": "TRAIN Law (RA 10963) - Tax Reform for Acceleration and Inclusion",
  "chunks": [
    {
      "title": "TRAIN Law Overview",
      "content": "Republic Act No. 10963, the Tax Reform for Acceleration and Inclusion (TRAIN) Law, was signed on December 19, 2017 and took effect on January 1, 2018. It is Package 1 of the Comprehensive Tax Reform Program (CTRP). Key changes: (1) Reduced individual income tax rates with a simplified 6-bracket schedule; (2) Raised VAT-exempt threshold for residential real estate; (3) Introduced 8% flat tax option for self-employed/professionals earning under PHP 3M; (4) Removed personal and additional exemptions (replaced by zero-rated first PHP 250,000); (5) Increased excise taxes on fuel, vehicles, sweetened beverages, cosmetic surgery, mining; (6) Simplified estate tax to flat 6%; (7) Simplified donor's tax to flat 6%; (8) Expanded VAT base (removed some exemptions). The law aims to make the tax system simpler, fairer, and more efficient while generating revenue for infrastructure and social services."
    },
    {
      "title": "TRAIN Law - Individual Income Tax Rates (2023 onwards)",
      "content": "Under TRAIN Law Section 24(A)(2)(a), effective January 1, 2023 onwards, the graduated income tax rates for individuals are: (1) Not over PHP 250,000 — 0% (exempt); (2) Over PHP 250,000 but not over PHP 400,000 — 15% of excess over PHP 250,000; (3) Over PHP 400,000 but not over PHP 800,000 — PHP 22,500 + 20% of excess over PHP 400,000; (4) Over PHP 800,000 but not over PHP 2,000,000 — PHP 102,500 + 25% of excess over PHP 800,000; (5) Over PHP 2,000,000 but not over PHP 8,000,000 — PHP 402,500 + 30% of excess over PHP 2,000,000; (6) Over PHP 8,000,000 — PHP 2,202,500 + 35% of excess over PHP 8,000,000. These rates apply to compensation income, business income, and professional income of resident citizens and resident aliens. Non-resident aliens engaged in trade or business in the Philippines are taxed at the same rates."
    },
    {
      "title": "TRAIN Law - 8% Flat Income Tax Option",
      "content": "Under TRAIN Law, self-employed individuals and professionals with gross sales/receipts not exceeding PHP 3,000,000 may opt for an 8% flat tax on gross sales/receipts in excess of PHP 250,000, in lieu of the graduated income tax rates AND the 3% percentage tax. This election must be made at the beginning of each taxable year via BIR Form 1905 or upon filing the first quarterly income tax return (BIR Form 1701Q). Once elected, the option is irrevocable for the taxable year. Key advantages: simplicity (no need for detailed expense tracking), lower effective tax rate for those with high margins. If gross sales exceed PHP 3M during the year, the taxpayer automatically shifts to graduated rates and must register for VAT. BIR Form 1701A is used for annual filing under the 8% option. Mixed income earners (compensation + business) may use the 8% option for the business income portion only."
    },
    {
      "title": "TRAIN Law - Exempt Income and Benefits",
      "content": "Under TRAIN Law, the following are exempt from income tax: (1) 13th month pay and other benefits — up to PHP 90,000 per year (increased from PHP 82,000); (2) First PHP 250,000 of taxable income for individuals; (3) Minimum wage earners — exempt from income tax on minimum wage, holiday pay, overtime pay, night shift differential, and hazard pay; (4) Personal and additional exemptions were REMOVED under TRAIN (previously PHP 50,000 personal + PHP 25,000 per dependent); (5) De minimis benefits remain exempt: unused vacation leave credits converted to cash (10 days or less), medical cash allowance (PHP 1,500/month), rice subsidy (PHP 2,000/month or 1 sack/50kg rice), uniform and clothing allowance (PHP 6,000/year), actual medical benefits (PHP 10,000/year), laundry allowance (PHP 300/month), employee achievement awards (PHP 10,000/year), Christmas gifts (PHP 5,000/year), daily meal allowance for overtime (25% of basic daily minimum wage)."
    },
    {
      "title": "TRAIN Law - Estate Tax Simplification",
      "content": "Under TRAIN Law Section 84, the estate tax was simplified to a flat rate of 6% based on the value of the net estate. Previously, estate tax used graduated rates ranging from 5% to 20%. Key provisions: (1) Standard deduction: PHP 5,000,000 (increased from PHP 1,000,000); (2) Family home deduction: up to PHP 10,000,000 (increased from PHP 1,000,000); (3) Net share of surviving spouse in conjugal/community property is deducted; (4) Amount received by heirs under RA 4917 (retirement benefits); (5) Estate tax return must be filed within 1 year from death (extendable by CIR up to 30 days for meritorious cases); (6) Estate tax is paid before distribution of estate; (7) BIR Form 1801 is used for estate tax filing; (8) If net estate does not exceed PHP 5,000,000, no estate tax is due."
    },
    {
      "title": "TRAIN Law - Donor's Tax Simplification",
      "content": "Under TRAIN Law Section 99, donor's tax was simplified to a flat rate of 6% based on total gifts in excess of PHP 250,000 per year. Previously, donor's tax used graduated rates from 2% to 15%. Key rules: (1) Flat 6% applies regardless of whether the donee is a stranger or relative; (2) Exempt amount: first PHP 250,000 per donor per year; (3) Dowries or gifts on account of marriage are no longer separately exempt under TRAIN; (4) Donations to the Philippine government or its political subdivisions are exempt; (5) Donations to accredited NGOs (not more than 30% of taxable income) are exempt; (6) Donor's tax return is filed within 30 days after the date of gift; (7) BIR Form 1800 is used for donor's tax filing. The simplification eliminates the need to determine if the donee is a relative or stranger, making compliance significantly easier."
    },
    {
      "title": "TRAIN Law - Excise Tax on Petroleum Products",
      "content": "TRAIN Law introduced phased increases in excise taxes on petroleum products (Section 148 NIRC as amended): Effective January 1, 2018 and adjusted annually. As of 2020 onwards: (1) Gasoline — PHP 10.00/liter; (2) Diesel — PHP 6.00/liter; (3) LPG — PHP 3.00/kg; (4) Kerosene — PHP 5.00/liter; (5) Bunker fuel oil — PHP 6.00/liter; (6) Aviation turbo jet fuel — PHP 4.00/liter. These rates are subject to annual adjustment by the DOF secretary based on the original schedule unless suspended by law. The increased excise taxes on petroleum aim to fund the government's Build, Build, Build infrastructure program. To mitigate the impact on poor households, the TRAIN Law provides for unconditional cash transfers to the bottom 10 million households."
    },
    {
      "title": "TRAIN Law - Excise Tax on Automobiles",
      "content": "TRAIN Law Section 149 (Automobiles excise tax): (1) Net manufacturer's price/importer's selling price up to PHP 600,000 — 4%; (2) Over PHP 600,000 to PHP 1,000,000 — PHP 24,000 + 10% of excess over PHP 600,000; (3) Over PHP 1,000,000 to PHP 4,000,000 — PHP 64,000 + 20% of excess over PHP 1,000,000; (4) Over PHP 4,000,000 — PHP 664,000 + 50% of excess over PHP 4,000,000. Purely electric vehicles are exempt from excise tax. Hybrid vehicles are taxed at 50% of the applicable rate. Pick-up trucks are exempt. The excise tax on automobiles was introduced under TRAIN to promote progressive taxation — luxury vehicles bear a higher tax burden. Previously, automobile excise tax rates were lower and less progressive."
    },
    {
      "title": "TRAIN Law - Sweetened Beverages Tax",
      "content": "TRAIN Law introduced excise tax on sweetened beverages (new Section 150-B NIRC): (1) Using purely caloric sweeteners (sugar) — PHP 6.00 per liter; (2) Using purely non-caloric sweeteners or a mix of caloric and non-caloric sweeteners — PHP 12.00 per liter; (3) Using high fructose corn syrup (HFCS) — PHP 12.00 per liter. Exempt beverages: (a) All milk products, including plain and flavored milk, milk drinks, and milk-based beverages; (b) Meal replacement and medically indicated beverages; (c) Ground coffee, instant soluble coffee, pre-packaged powdered coffee products; (d) 100% natural fruit juices (no added sugar); (e) 100% natural vegetable juices (no added sugar); (f) All forms of tea without added sugar. The tax is imposed on manufacturers and importers at the point of production or importation."
    },
    {
      "title": "TRAIN Law - Percentage Tax Changes",
      "content": "Under TRAIN Law, key changes to percentage tax (Title V NIRC): (1) The percentage tax for non-VAT registered persons was reduced from 3% to 1% effective July 1, 2020 to June 30, 2023 (under Bayanihan II/CREATE MORE), then reverted to 3%; (2) Stock transaction tax increased from 1/2 of 1% to 6/10 of 1% on net capital gains; (3) Amusement tax rates simplified; (4) Tax on winnings — lotto and PCSO winnings exceeding PHP 10,000 are now subject to 20% final tax (previously exempt); (5) Overseas Communication Tax — 10% on the amount paid for overseas calls, messages, and similar services originating from the Philippines; (6) For persons not VAT-registered whose annual gross sales/receipts do not exceed PHP 3,000,000, the 3% percentage tax applies in lieu of VAT. If gross sales exceed PHP 3M, the person must register for VAT within 30 days."
    }
  ]
}
