{
  "category": "vat",
  "source": "VAT Refund Process — Detailed Guide for Zero-Rated and Effectively Zero-Rated Sellers",
  "chunks": [
    {
      "title": "Who Can Claim a VAT Refund (Section 112 NIRC)",
      "content": "Under Section 112 of the NIRC, a VAT-registered person whose sales are zero-rated or effectively zero-rated may apply for the issuance of a tax credit certificate (TCC) or refund of creditable input tax due or paid attributable to such sales. Zero-rated sales include: (1) export sales under Section 106(A)(2)(a) — actual shipment of goods from the Philippines to a foreign country; (2) sale of raw materials or packaging materials to a BOI-registered export enterprise; (3) sale of gold to the Bangko Sentral ng Pilipinas; (4) foreign currency denominated sales (Section 108(B)) — services rendered to non-resident foreign clients paid in foreign currency and accounted for under BSP rules; (5) transport of passengers and cargo by domestic air or sea carriers from the Philippines to a foreign country; (6) sale of power or fuel generated through renewable energy sources (under RA 9513); (7) sales to PEZA, ecozones, and freeport-registered enterprises (reinstated under CREATE MORE Act). Effectively zero-rated sales are transactions that would otherwise be subject to VAT but are zero-rated by special law or international agreement (e.g., sales to Asian Development Bank, WHO, or other entities with tax exemption agreements with the Philippines). Only the excess of input VAT attributable to zero-rated sales over output VAT liability is refundable. Input VAT attributable to VAT-exempt sales is NOT refundable."
    },
    {
      "title": "Two-Year Prescriptive Period for Filing Refund Claims",
      "content": "The application for VAT refund or tax credit certificate must be filed within two (2) years after the close of the taxable quarter when the zero-rated or effectively zero-rated sales were made. This is an absolute prescriptive period — failure to file within this window permanently forfeits the right to the refund. The two-year period is counted from the close of the quarter, not from the filing date of the quarterly return. For example, if zero-rated sales were made in Q1 (January–March 2025), the 2-year period runs from March 31, 2025, and the application must be filed no later than March 31, 2027. Important jurisprudential rules: (a) the Supreme Court in CIR v. Aichi Forging (2010) ruled that the 2-year period applies to the administrative claim with the BIR, not the judicial claim with the CTA; (b) the TRAIN Law amendment clarified that the taxpayer must file the administrative claim first; (c) the input VAT must have been reported in the quarterly return (2550Q) for the relevant period — input VAT not reported in the return for the quarter of the zero-rated sale cannot be included in the refund claim. Taxpayers should file refund claims well before the 2-year deadline to allow time for BIR processing and potential CTA appeal."
    },
    {
      "title": "Filing Requirements and Administrative Application Process",
      "content": "To file a VAT refund claim, the taxpayer must submit the following to the BIR Revenue District Office (RDO) or Large Taxpayers Service (LTS) having jurisdiction: (1) Written application/letter requesting refund or TCC, stating the legal basis and amount claimed; (2) BIR Form 1914 (Application for Tax Credits/Refunds); (3) Certified copies of the quarterly VAT returns (BIR Form 2550Q) for the period covered by the claim; (4) Summary List of Sales (SLS) showing all zero-rated sales transactions with details of each buyer; (5) Summary List of Purchases (SLP) showing all purchases with corresponding input VAT; (6) Proof of zero-rating: export documents (Bill of Lading, Commercial Invoice, Export Declaration, Packing List), PEZA certification, or other applicable certifications; (7) VAT official receipts and invoices supporting input VAT claimed; (8) BIR Certificate of Registration (BIR Form 2303) showing VAT registration; (9) SEC Registration and Articles of Incorporation; (10) Audited Financial Statements for the taxable year. The BIR may request additional documents during the evaluation. Under the EOPT Act, the BIR is encouraged to adopt a more streamlined process and reduce documentary requirements for low-risk taxpayers."
    },
    {
      "title": "EOPT Act (RA 11976) Risk-Based Classification for VAT Refunds",
      "content": "The Ease of Paying Taxes (EOPT) Act (Republic Act No. 11976), signed into law on January 5, 2024, introduced a risk-based approach to VAT refund processing. The BIR classifies refund claims into three risk categories: (1) Low Risk — claims from taxpayers with consistent filing history, clean audit record, verifiable zero-rated sales, and complete documentation. Low-risk claims benefit from expedited processing with reduced documentary requirements and faster turnaround; (2) Medium Risk — claims requiring standard review procedures with moderate verification; (3) High Risk — claims from taxpayers with audit issues, discrepancies in returns, first-time filers, or unusually large claims relative to historical patterns. High-risk claims undergo thorough investigation and may require field audit. The risk classification criteria are based on: taxpayer compliance history, industry risk profile, amount of claim relative to reported sales, completeness and consistency of submitted documents, and existence of third-party information matching (e.g., cross-referencing SLS/SLP with counterparty filings). The EOPT Act mandates the BIR to publish its risk-based audit framework and update it annually. This classification system aims to balance facilitation for compliant taxpayers with enforcement against fraudulent claims."
    },
    {
      "title": "90-Day BIR Processing Period and 30-Day CTA Appeal",
      "content": "Under Section 112(C) of the NIRC as amended by the TRAIN Law, the BIR Commissioner has ninety (90) days from the date of submission of the complete documents to grant a refund or issue a tax credit certificate. This was reduced from the previous 120-day period. If the BIR (a) fully or partially denies the claim, or (b) fails to act on the application within the 90-day period, the taxpayer may appeal to the Court of Tax Appeals (CTA) within thirty (30) days from: (i) the receipt of the denial decision, or (ii) the expiration of the 90-day period (in case of BIR inaction). This 30-day appeal period is mandatory and jurisdictional — failure to file within 30 days results in the CTA losing jurisdiction over the claim. The landmark Supreme Court case CIR v. San Roque Power Corporation (2013) established that: (a) the 120/90-day period is mandatory and the taxpayer cannot file a judicial claim before the period expires (premature filing is fatal); (b) BIR Ruling DA-489-03 provided an exception for claims filed between December 10, 2003 and October 6, 2010; (c) after the San Roque ruling, strict compliance with the waiting period is required. The TRAIN Law's reduction to 90 days applies to claims filed starting January 1, 2018."
    },
    {
      "title": "Documentary Requirements in Detail",
      "content": "Complete documentation is the single most critical factor in a successful VAT refund claim. The required documents include: (1) Sales Invoices and Official Receipts — for zero-rated sales, these must conspicuously print 'zero-rated sale' on the face (failure to do so can void the zero-rated treatment per BIR rulings); invoices must be BIR-registered with Authority to Print (ATP) or CAS (Computerized Accounting System) permit; (2) Export Documents — for goods exports: Bill of Lading or Airway Bill, Export Declaration (ED) validated by Bureau of Customs, Commercial Invoice, Packing List, and proof of inward remittance of foreign currency through the banking system; (3) For services exports (Section 108(B)): service agreements, proof of payment in foreign currency, BSP-registered inward remittance, and proof that the service recipient is a non-resident foreign corporation/individual; (4) Zero-Rate Certification — for PEZA enterprises: PEZA certification of registration; for BOI: BOI registration certificate; (5) Input VAT Supporting Documents — all purchase invoices and receipts supporting claimed input VAT, with corresponding SLP in prescribed format; (6) SAWT — Summary Alphalist of Withholding Taxes, if applicable; (7) RR 10-2025 has streamlined requirements by allowing certified copies instead of original documents, reducing the burden on taxpayers while maintaining audit trail integrity."
    },
    {
      "title": "Common Grounds for Denial and How to Avoid Them",
      "content": "The BIR frequently denies VAT refund claims on the following grounds: (1) Incomplete documentation — missing invoices, export documents, or supporting schedules. Prevention: maintain a comprehensive filing system and pre-audit all documents before submission; (2) Taxpayer not VAT-registered at the time of the transaction — the taxpayer must be VAT-registered when the zero-rated sale occurred. Prevention: verify VAT registration is active and current; (3) Failure to print 'zero-rated sale' on invoices/receipts — the NIRC and RR 16-2005 require this marking. Prevention: ensure all accounting systems and pre-printed forms include this notation; (4) Input VAT not attributable to zero-rated sales — for mixed transactions, the taxpayer must apportion input VAT. Prevention: maintain separate tracking of input VAT by sales category; (5) Prescriptive period expired — the claim was filed beyond the 2-year window. Prevention: diarize filing deadlines; (6) Input VAT already claimed as deduction from gross income — input VAT can either be claimed as VAT credit/refund or as itemized deduction, not both. Prevention: elect one treatment consistently; (7) Non-compliance with invoicing requirements — missing TIN, address, or other required information on invoices. Prevention: verify seller invoices upon receipt; (8) Inconsistency between VAT returns and refund claim — amounts in 2550Q do not match the refund application. Prevention: reconcile before filing."
    },
    {
      "title": "VAT Refund for PEZA and Ecozone Enterprises",
      "content": "The CREATE MORE Act (RA 12066, effective November 2024) made significant changes to the VAT treatment of PEZA and ecozone enterprises. Under CREATE MORE, local purchases of goods and services by registered export enterprises directly attributable to their registered activity are subject to zero percent (0%) VAT. This reinstates zero-rating on local purchases that was removed under the original CREATE Law (RA 11534). The 'directly attributable' standard means the goods or services must be directly and exclusively used in the registered project or activity. For VAT refund purposes: (1) Ecozone/PEZA enterprises making zero-rated export sales can claim refund of input VAT on local purchases; (2) Local suppliers selling to PEZA enterprises issue zero-rated invoices and can claim refund of their own input VAT attributable to those zero-rated sales; (3) The FIRB (Fiscal Incentives Review Board) may issue guidelines on the 'directly attributable' standard; (4) PEZA enterprises under the 5% Special Corporate Income Tax (SCIT) regime that are VAT-exempt cannot claim VAT refunds — only those under the Enhanced Deductions Regime (EDR) or Income Tax Holiday (ITH) who are VAT-registered zero-rated exporters are eligible. Transitional rules apply for the period between the original CREATE Law (effective April 2021) and CREATE MORE (November 2024), during which local purchases were VAT-exempt rather than zero-rated."
    },
    {
      "title": "Transitional Input VAT (Section 111 NIRC)",
      "content": "Section 111(A) of the NIRC provides for Transitional Input VAT — a person who becomes liable to VAT or any person who elects to be VAT-registered is allowed input tax on the inventory of goods, materials, and supplies on hand as of the effectivity date of VAT registration. The transitional input VAT is computed at 2% of the value of the beginning inventory or the actual VAT paid on such goods, whichever is higher. This is a one-time benefit claimed in the first quarter of VAT registration. The purpose is to prevent double taxation on inventory that was purchased under the non-VAT regime and will be sold under the VAT regime. Requirements: (1) Physical inventory count as of the date of VAT registration, certified by an independent CPA; (2) Inventory listing showing description, quantity, and value of each item; (3) The inventory must consist of goods, materials, and supplies intended for sale or for use in the course of trade or business. The transitional input VAT is reported in BIR Form 2550Q for the quarter in which VAT registration becomes effective. Jurisprudence (Fort Bonifacio Development Corp. v. CIR, 2009) confirmed that transitional input VAT applies to real property developers on the value of land inventory. This input VAT, if in excess of output VAT, can be carried forward to succeeding quarters."
    }
  ]
}
